;******************************************************************************
;* TI ARM C/C++ Codegen                                             PC v5.0.4 *
;* Date/Time created: Mon Apr 28 11:29:10 2014                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../Source/timers.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.0.4 Copyright (c) 1996-2013 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Debug")
;	C:\TI_CodeComposer\ccsv5\tools\compiler\arm_5.0.4\bin\armacpia.exe -@C:\\Users\\llammers\\AppData\\Local\\Temp\\0651212 

;******************************************************************************
;* BUILD ATTRIBUTES                                                           *
;******************************************************************************
	.battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)

	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$54, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include/timers.h")
	.dwattr $C$DW$T$54, DW_AT_decl_line(0x70)
	.dwattr $C$DW$T$54, DW_AT_decl_column(0x10)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$35	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$5)
$C$DW$T$36	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$36, DW_AT_address_class(0x20)
$C$DW$T$37	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
$C$DW$T$55	.dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$55, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/stddef.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x1a)
$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
$C$DW$T$56	.dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
	.dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$56, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/stddef.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0x31)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x1c)
$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
$C$DW$T$57	.dwtag  DW_TAG_typedef, DW_AT_name("size_t")
	.dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$57, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/stddef.h")
	.dwattr $C$DW$T$57, DW_AT_decl_line(0x35)
	.dwattr $C$DW$T$57, DW_AT_decl_column(0x19)
$C$DW$T$12	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_name("long")
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x04)

$C$DW$T$58	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
$C$DW$11	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$11, DW_AT_type(*$C$DW$T$3)
	.dwendtag $C$DW$T$58

$C$DW$T$59	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$T$59, DW_AT_address_class(0x20)
$C$DW$T$60	.dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_HOOK_CODE")
	.dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$60, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include/FreeRTOS.h")
	.dwattr $C$DW$T$60, DW_AT_decl_line(0x66)
	.dwattr $C$DW$T$60, DW_AT_decl_column(0x19)
$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
$C$DW$T$19	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$13)
$C$DW$T$38	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$38, DW_AT_address_class(0x20)
$C$DW$T$26	.dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$26, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include\../../Source/portable/CCS5/ARM_CM3/portmacro.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x1c)
$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x08)

$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_name("xLIST")
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x14)
$C$DW$12	.dwtag  DW_TAG_member
	.dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$12, DW_AT_name("uxNumberOfItems")
	.dwattr $C$DW$12, DW_AT_TI_symbol_name("uxNumberOfItems")
	.dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$12, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include\list.h")
	.dwattr $C$DW$12, DW_AT_decl_line(0x88)
	.dwattr $C$DW$12, DW_AT_decl_column(0x22)
$C$DW$13	.dwtag  DW_TAG_member
	.dwattr $C$DW$13, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$13, DW_AT_name("pxIndex")
	.dwattr $C$DW$13, DW_AT_TI_symbol_name("pxIndex")
	.dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$13, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include\list.h")
	.dwattr $C$DW$13, DW_AT_decl_line(0x89)
	.dwattr $C$DW$13, DW_AT_decl_column(0x17)
$C$DW$14	.dwtag  DW_TAG_member
	.dwattr $C$DW$14, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$14, DW_AT_name("xListEnd")
	.dwattr $C$DW$14, DW_AT_TI_symbol_name("xListEnd")
	.dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$14, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include\list.h")
	.dwattr $C$DW$14, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$14, DW_AT_decl_column(0x19)
	.dwendtag $C$DW$T$25

	.dwattr $C$DW$T$25, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include\list.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
$C$DW$T$61	.dwtag  DW_TAG_typedef, DW_AT_name("xList")
	.dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$61, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include\list.h")
	.dwattr $C$DW$T$61, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$T$61, DW_AT_decl_column(0x03)

$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_name("xLIST_ITEM")
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x14)
$C$DW$15	.dwtag  DW_TAG_member
	.dwattr $C$DW$15, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$15, DW_AT_name("xItemValue")
	.dwattr $C$DW$15, DW_AT_TI_symbol_name("xItemValue")
	.dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$15, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include\list.h")
	.dwattr $C$DW$15, DW_AT_decl_line(0x73)
	.dwattr $C$DW$15, DW_AT_decl_column(0x0f)
$C$DW$16	.dwtag  DW_TAG_member
	.dwattr $C$DW$16, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$16, DW_AT_name("pxNext")
	.dwattr $C$DW$16, DW_AT_TI_symbol_name("pxNext")
	.dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$16, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include\list.h")
	.dwattr $C$DW$16, DW_AT_decl_line(0x74)
	.dwattr $C$DW$16, DW_AT_decl_column(0x1f)
$C$DW$17	.dwtag  DW_TAG_member
	.dwattr $C$DW$17, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$17, DW_AT_name("pxPrevious")
	.dwattr $C$DW$17, DW_AT_TI_symbol_name("pxPrevious")
	.dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$17, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include\list.h")
	.dwattr $C$DW$17, DW_AT_decl_line(0x75)
	.dwattr $C$DW$17, DW_AT_decl_column(0x1f)
$C$DW$18	.dwtag  DW_TAG_member
	.dwattr $C$DW$18, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$18, DW_AT_name("pvOwner")
	.dwattr $C$DW$18, DW_AT_TI_symbol_name("pvOwner")
	.dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$18, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include\list.h")
	.dwattr $C$DW$18, DW_AT_decl_line(0x76)
	.dwattr $C$DW$18, DW_AT_decl_column(0x09)
$C$DW$19	.dwtag  DW_TAG_member
	.dwattr $C$DW$19, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$19, DW_AT_name("pvContainer")
	.dwattr $C$DW$19, DW_AT_TI_symbol_name("pvContainer")
	.dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$19, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include\list.h")
	.dwattr $C$DW$19, DW_AT_decl_line(0x77)
	.dwattr $C$DW$19, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$29

	.dwattr $C$DW$T$29, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include\list.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x71)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x08)
$C$DW$T$27	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$29)
$C$DW$T$28	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$28, DW_AT_address_class(0x20)
$C$DW$T$20	.dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$20, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include\list.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0x79)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x1b)
$C$DW$T$21	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
$C$DW$T$22	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$22, DW_AT_address_class(0x20)

$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_name("xMEMORY_REGION")
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x0c)
$C$DW$20	.dwtag  DW_TAG_member
	.dwattr $C$DW$20, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$20, DW_AT_name("pvBaseAddress")
	.dwattr $C$DW$20, DW_AT_TI_symbol_name("pvBaseAddress")
	.dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$20, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include/task.h")
	.dwattr $C$DW$20, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$20, DW_AT_decl_column(0x08)
$C$DW$21	.dwtag  DW_TAG_member
	.dwattr $C$DW$21, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$21, DW_AT_name("ulLengthInBytes")
	.dwattr $C$DW$21, DW_AT_TI_symbol_name("ulLengthInBytes")
	.dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$21, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include/task.h")
	.dwattr $C$DW$21, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$21, DW_AT_decl_column(0x10)
$C$DW$22	.dwtag  DW_TAG_member
	.dwattr $C$DW$22, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$22, DW_AT_name("ulParameters")
	.dwattr $C$DW$22, DW_AT_TI_symbol_name("ulParameters")
	.dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$22, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include/task.h")
	.dwattr $C$DW$22, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$22, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$30

	.dwattr $C$DW$T$30, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include/task.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x78)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
$C$DW$T$39	.dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$39, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include/task.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x03)

$C$DW$T$40	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
$C$DW$23	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$23, DW_AT_upper_bound(0x00)
	.dwendtag $C$DW$T$40


$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_name("xMINI_LIST_ITEM")
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x0c)
$C$DW$24	.dwtag  DW_TAG_member
	.dwattr $C$DW$24, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$24, DW_AT_name("xItemValue")
	.dwattr $C$DW$24, DW_AT_TI_symbol_name("xItemValue")
	.dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$24, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include\list.h")
	.dwattr $C$DW$24, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$24, DW_AT_decl_column(0x0f)
$C$DW$25	.dwtag  DW_TAG_member
	.dwattr $C$DW$25, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$25, DW_AT_name("pxNext")
	.dwattr $C$DW$25, DW_AT_TI_symbol_name("pxNext")
	.dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$25, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include\list.h")
	.dwattr $C$DW$25, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$25, DW_AT_decl_column(0x1e)
$C$DW$26	.dwtag  DW_TAG_member
	.dwattr $C$DW$26, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$26, DW_AT_name("pxPrevious")
	.dwattr $C$DW$26, DW_AT_TI_symbol_name("pxPrevious")
	.dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$26, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include\list.h")
	.dwattr $C$DW$26, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$26, DW_AT_decl_column(0x1e)
	.dwendtag $C$DW$T$31

	.dwattr $C$DW$T$31, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include\list.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x08)
$C$DW$T$23	.dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$23, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include\list.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0x81)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x20)
$C$DW$T$24	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)

$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_name("xTASK_PARAMTERS")
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x24)
$C$DW$27	.dwtag  DW_TAG_member
	.dwattr $C$DW$27, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$27, DW_AT_name("pvTaskCode")
	.dwattr $C$DW$27, DW_AT_TI_symbol_name("pvTaskCode")
	.dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$27, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include/task.h")
	.dwattr $C$DW$27, DW_AT_decl_line(0x84)
	.dwattr $C$DW$27, DW_AT_decl_column(0x0e)
$C$DW$28	.dwtag  DW_TAG_member
	.dwattr $C$DW$28, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$28, DW_AT_name("pcName")
	.dwattr $C$DW$28, DW_AT_TI_symbol_name("pcName")
	.dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$28, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include/task.h")
	.dwattr $C$DW$28, DW_AT_decl_line(0x85)
	.dwattr $C$DW$28, DW_AT_decl_column(0x1c)
$C$DW$29	.dwtag  DW_TAG_member
	.dwattr $C$DW$29, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$29, DW_AT_name("usStackDepth")
	.dwattr $C$DW$29, DW_AT_TI_symbol_name("usStackDepth")
	.dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$29, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include/task.h")
	.dwattr $C$DW$29, DW_AT_decl_line(0x86)
	.dwattr $C$DW$29, DW_AT_decl_column(0x11)
$C$DW$30	.dwtag  DW_TAG_member
	.dwattr $C$DW$30, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$30, DW_AT_name("pvParameters")
	.dwattr $C$DW$30, DW_AT_TI_symbol_name("pvParameters")
	.dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$30, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include/task.h")
	.dwattr $C$DW$30, DW_AT_decl_line(0x87)
	.dwattr $C$DW$30, DW_AT_decl_column(0x08)
$C$DW$31	.dwtag  DW_TAG_member
	.dwattr $C$DW$31, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$31, DW_AT_name("uxPriority")
	.dwattr $C$DW$31, DW_AT_TI_symbol_name("uxPriority")
	.dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$31, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include/task.h")
	.dwattr $C$DW$31, DW_AT_decl_line(0x88)
	.dwattr $C$DW$31, DW_AT_decl_column(0x19)
$C$DW$32	.dwtag  DW_TAG_member
	.dwattr $C$DW$32, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$32, DW_AT_name("puxStackBuffer")
	.dwattr $C$DW$32, DW_AT_TI_symbol_name("puxStackBuffer")
	.dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$32, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include/task.h")
	.dwattr $C$DW$32, DW_AT_decl_line(0x89)
	.dwattr $C$DW$32, DW_AT_decl_column(0x12)
$C$DW$33	.dwtag  DW_TAG_member
	.dwattr $C$DW$33, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$33, DW_AT_name("xRegions")
	.dwattr $C$DW$33, DW_AT_TI_symbol_name("xRegions")
	.dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$33, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include/task.h")
	.dwattr $C$DW$33, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$33, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$41

	.dwattr $C$DW$T$41, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include/task.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0x82)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
$C$DW$T$62	.dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
	.dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$62, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include/task.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x03)

$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_name("xTIME_OUT")
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x08)
$C$DW$34	.dwtag  DW_TAG_member
	.dwattr $C$DW$34, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$34, DW_AT_name("xOverflowCount")
	.dwattr $C$DW$34, DW_AT_TI_symbol_name("xOverflowCount")
	.dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$34, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include/task.h")
	.dwattr $C$DW$34, DW_AT_decl_line(0x71)
	.dwattr $C$DW$34, DW_AT_decl_column(0x10)
$C$DW$35	.dwtag  DW_TAG_member
	.dwattr $C$DW$35, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$35, DW_AT_name("xTimeOnEntering")
	.dwattr $C$DW$35, DW_AT_TI_symbol_name("xTimeOnEntering")
	.dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$35, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include/task.h")
	.dwattr $C$DW$35, DW_AT_decl_line(0x72)
	.dwattr $C$DW$35, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$42

	.dwattr $C$DW$T$42, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include/task.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
$C$DW$T$63	.dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
	.dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$63, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include/task.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0x73)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
	.dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

$C$DW$CIE	.dwcie 14
	.dwcfi	cfa_register, 13
	.dwcfi	cfa_offset, 0
	.dwcfi	undefined, 0
	.dwcfi	undefined, 1
	.dwcfi	undefined, 2
	.dwcfi	undefined, 3
	.dwcfi	undefined, 4
	.dwcfi	undefined, 5
	.dwcfi	undefined, 6
	.dwcfi	undefined, 7
	.dwcfi	undefined, 8
	.dwcfi	undefined, 9
	.dwcfi	undefined, 10
	.dwcfi	undefined, 11
	.dwcfi	undefined, 12
	.dwcfi	undefined, 13
	.dwcfi	undefined, 14
	.dwcfi	undefined, 14
	.dwcfi	undefined, 7
	.dwendentry
	.dwendtag $C$DW$CU

