TI ARM Assembler PC v5.0.4 Mon Apr 28 11:29:07 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
croutine.asm                                                         PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.0.4 *
       3                    ;* Date/Time created: Mon Apr 28 11:29:07 2014                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --e
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Source/croutine.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.0.4 Copyright (c) 1996-2013 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("ulPortSetInterruptMask")

    1808                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1809                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    1810                    $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    1811                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$11)
    1812                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1813                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    1814                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x35)
    1815                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x19)
    1816                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    1817                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1818                            .dwattr $C$DW$T$12, DW_AT_name("long")
    1819                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    1820                    
    1821                    $C$DW$T$77      .dwtag  DW_TAG_subroutine_type
    1822                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$12)
    1823                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1824                    $C$DW$136       .dwtag  DW_TAG_formal_parameter
    1825                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$3)
    1826                            .dwendtag $C$DW$T$77
    1827                    
    1828                    $C$DW$T$78      .dwtag  DW_TAG_pointer_type
    1829                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
    1830                            .dwattr $C$DW$T$78, DW_AT_address_class(0x20)
    1831                    $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_HOOK_CODE")
    1832                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    1833                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1834                            .dwattr $C$DW$T$79, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/inclu
    1835                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x66)
    1836                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x19)
    1837                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    1838                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1839                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1840                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    1841                    $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    1842                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$13)
    1843                    $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    1844                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$13)
    1845                            .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    1846                    $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    1847                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$13)
    1848                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1849                            .dwattr $C$DW$T$31, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\inclu
    1850                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x6a)
    1851                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x1c)
    1852                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    1853                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1854                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    1855                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    1856                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    1857                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1858                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1859                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    1860                    $C$DW$T$16      .dwtag  DW_TAG_base_type
TI ARM Assembler PC v5.0.4 Mon Apr 28 11:29:07 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
croutine.asm                                                         PAGE   35

    1861                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1862                            .dwattr $C$DW$T$16, DW_AT_name("float")
    1863                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    1864                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    1865                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1866                            .dwattr $C$DW$T$17, DW_AT_name("double")
    1867                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    1868                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    1869                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1870                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    1871                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    1872                    
    1873                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1874                            .dwattr $C$DW$T$24, DW_AT_name("corCoRoutineControlBlock")
    1875                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x38)
    1876                    $C$DW$137       .dwtag  DW_TAG_member
    1877                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$22)
    1878                            .dwattr $C$DW$137, DW_AT_name("pxCoRoutineFunction")
    1879                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("pxCoRoutineFunction")
    1880                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1881                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1882                            .dwattr $C$DW$137, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/includ
    1883                            .dwattr $C$DW$137, DW_AT_decl_line(0x62)
    1884                            .dwattr $C$DW$137, DW_AT_decl_column(0x15)
    1885                    $C$DW$138       .dwtag  DW_TAG_member
    1886                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$23)
    1887                            .dwattr $C$DW$138, DW_AT_name("xGenericListItem")
    1888                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("xGenericListItem")
    1889                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1890                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1891                            .dwattr $C$DW$138, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/includ
    1892                            .dwattr $C$DW$138, DW_AT_decl_line(0x63)
    1893                            .dwattr $C$DW$138, DW_AT_decl_column(0x0f)
    1894                    $C$DW$139       .dwtag  DW_TAG_member
    1895                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$23)
    1896                            .dwattr $C$DW$139, DW_AT_name("xEventListItem")
    1897                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("xEventListItem")
    1898                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1899                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1900                            .dwattr $C$DW$139, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/includ
    1901                            .dwattr $C$DW$139, DW_AT_decl_line(0x64)
    1902                            .dwattr $C$DW$139, DW_AT_decl_column(0x0f)
    1903                    $C$DW$140       .dwtag  DW_TAG_member
    1904                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$13)
    1905                            .dwattr $C$DW$140, DW_AT_name("uxPriority")
    1906                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("uxPriority")
    1907                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1908                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1909                            .dwattr $C$DW$140, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/includ
    1910                            .dwattr $C$DW$140, DW_AT_decl_line(0x65)
    1911                            .dwattr $C$DW$140, DW_AT_decl_column(0x1a)
    1912                    $C$DW$141       .dwtag  DW_TAG_member
    1913                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$13)
    1914                            .dwattr $C$DW$141, DW_AT_name("uxIndex")
    1915                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("uxIndex")
TI ARM Assembler PC v5.0.4 Mon Apr 28 11:29:07 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
croutine.asm                                                         PAGE   36

    1916                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1917                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1918                            .dwattr $C$DW$141, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/includ
    1919                            .dwattr $C$DW$141, DW_AT_decl_line(0x66)
    1920                            .dwattr $C$DW$141, DW_AT_decl_column(0x1a)
    1921                    $C$DW$142       .dwtag  DW_TAG_member
    1922                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$9)
    1923                            .dwattr $C$DW$142, DW_AT_name("uxState")
    1924                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("uxState")
    1925                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1926                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1927                            .dwattr $C$DW$142, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/includ
    1928                            .dwattr $C$DW$142, DW_AT_decl_line(0x67)
    1929                            .dwattr $C$DW$142, DW_AT_decl_column(0x13)
    1930                            .dwendtag $C$DW$T$24
    1931                    
    1932                            .dwattr $C$DW$T$24, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/inclu
    1933                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x60)
    1934                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    1935                    $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("corCRCB")
    1936                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$24)
    1937                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1938                            .dwattr $C$DW$T$86, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/inclu
    1939                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x68)
    1940                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x03)
    1941                    $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    1942                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    1943                            .dwattr $C$DW$T$87, DW_AT_address_class(0x20)
    1944                    
    1945                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1946                            .dwattr $C$DW$T$30, DW_AT_name("xLIST")
    1947                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x14)
    1948                    $C$DW$143       .dwtag  DW_TAG_member
    1949                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$25)
    1950                            .dwattr $C$DW$143, DW_AT_name("uxNumberOfItems")
    1951                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("uxNumberOfItems")
    1952                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1953                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1954                            .dwattr $C$DW$143, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\includ
    1955                            .dwattr $C$DW$143, DW_AT_decl_line(0x88)
    1956                            .dwattr $C$DW$143, DW_AT_decl_column(0x22)
    1957                    $C$DW$144       .dwtag  DW_TAG_member
    1958                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$27)
    1959                            .dwattr $C$DW$144, DW_AT_name("pxIndex")
    1960                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("pxIndex")
    1961                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1962                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1963                            .dwattr $C$DW$144, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\includ
    1964                            .dwattr $C$DW$144, DW_AT_decl_line(0x89)
    1965                            .dwattr $C$DW$144, DW_AT_decl_column(0x17)
    1966                    $C$DW$145       .dwtag  DW_TAG_member
    1967                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$29)
    1968                            .dwattr $C$DW$145, DW_AT_name("xListEnd")
    1969                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("xListEnd")
    1970                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TI ARM Assembler PC v5.0.4 Mon Apr 28 11:29:07 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
croutine.asm                                                         PAGE   37

    1971                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1972                            .dwattr $C$DW$145, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\includ
    1973                            .dwattr $C$DW$145, DW_AT_decl_line(0x8a)
    1974                            .dwattr $C$DW$145, DW_AT_decl_column(0x19)
    1975                            .dwendtag $C$DW$T$30
    1976                    
    1977                            .dwattr $C$DW$T$30, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\inclu
    1978                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x86)
    1979                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    1980                    $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    1981                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$30)
    1982                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1983                            .dwattr $C$DW$T$59, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\inclu
    1984                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x8b)
    1985                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x03)
    1986                    $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    1987                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    1988                            .dwattr $C$DW$T$60, DW_AT_address_class(0x20)
    1989                    $C$DW$T$88      .dwtag  DW_TAG_const_type
    1990                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$60)
    1991                    
    1992                    $C$DW$T$89      .dwtag  DW_TAG_array_type
    1993                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$59)
    1994                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    1995                            .dwattr $C$DW$T$89, DW_AT_byte_size(0x28)
    1996                    $C$DW$146       .dwtag  DW_TAG_subrange_type
    1997                            .dwattr $C$DW$146, DW_AT_upper_bound(0x01)
    1998                            .dwendtag $C$DW$T$89
    1999                    
    2000                    $C$DW$T$74      .dwtag  DW_TAG_const_type
    2001                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$59)
    2002                    $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    2003                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    2004                            .dwattr $C$DW$T$75, DW_AT_address_class(0x20)
    2005                    
    2006                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2007                            .dwattr $C$DW$T$34, DW_AT_name("xLIST_ITEM")
    2008                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x14)
    2009                    $C$DW$147       .dwtag  DW_TAG_member
    2010                            .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$31)
    2011                            .dwattr $C$DW$147, DW_AT_name("xItemValue")
    2012                            .dwattr $C$DW$147, DW_AT_TI_symbol_name("xItemValue")
    2013                            .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2014                            .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2015                            .dwattr $C$DW$147, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\includ
    2016                            .dwattr $C$DW$147, DW_AT_decl_line(0x73)
    2017                            .dwattr $C$DW$147, DW_AT_decl_column(0x0f)
    2018                    $C$DW$148       .dwtag  DW_TAG_member
    2019                            .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$33)
    2020                            .dwattr $C$DW$148, DW_AT_name("pxNext")
    2021                            .dwattr $C$DW$148, DW_AT_TI_symbol_name("pxNext")
    2022                            .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2023                            .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2024                            .dwattr $C$DW$148, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\includ
    2025                            .dwattr $C$DW$148, DW_AT_decl_line(0x74)
TI ARM Assembler PC v5.0.4 Mon Apr 28 11:29:07 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
croutine.asm                                                         PAGE   38

    2026                            .dwattr $C$DW$148, DW_AT_decl_column(0x1f)
    2027                    $C$DW$149       .dwtag  DW_TAG_member
    2028                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$33)
    2029                            .dwattr $C$DW$149, DW_AT_name("pxPrevious")
    2030                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("pxPrevious")
    2031                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2032                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2033                            .dwattr $C$DW$149, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\includ
    2034                            .dwattr $C$DW$149, DW_AT_decl_line(0x75)
    2035                            .dwattr $C$DW$149, DW_AT_decl_column(0x1f)
    2036                    $C$DW$150       .dwtag  DW_TAG_member
    2037                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$3)
    2038                            .dwattr $C$DW$150, DW_AT_name("pvOwner")
    2039                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("pvOwner")
    2040                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2041                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2042                            .dwattr $C$DW$150, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\includ
    2043                            .dwattr $C$DW$150, DW_AT_decl_line(0x76)
    2044                            .dwattr $C$DW$150, DW_AT_decl_column(0x09)
    2045                    $C$DW$151       .dwtag  DW_TAG_member
    2046                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$3)
    2047                            .dwattr $C$DW$151, DW_AT_name("pvContainer")
    2048                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("pvContainer")
    2049                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2050                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2051                            .dwattr $C$DW$151, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\includ
    2052                            .dwattr $C$DW$151, DW_AT_decl_line(0x77)
    2053                            .dwattr $C$DW$151, DW_AT_decl_column(0x09)
    2054                            .dwendtag $C$DW$T$34
    2055                    
    2056                            .dwattr $C$DW$T$34, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\inclu
    2057                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x71)
    2058                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x08)
    2059                    $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    2060                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$34)
    2061                    $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    2062                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2063                            .dwattr $C$DW$T$33, DW_AT_address_class(0x20)
    2064                    $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    2065                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$34)
    2066                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    2067                            .dwattr $C$DW$T$23, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\inclu
    2068                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x79)
    2069                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x1b)
    2070                    $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    2071                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$23)
    2072                            .dwattr $C$DW$T$63, DW_AT_address_class(0x20)
    2073                    $C$DW$T$26      .dwtag  DW_TAG_volatile_type
    2074                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$23)
    2075                    $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    2076                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    2077                            .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    2078                    
    2079                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2080                            .dwattr $C$DW$T$35, DW_AT_name("xMEMORY_REGION")
TI ARM Assembler PC v5.0.4 Mon Apr 28 11:29:07 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
croutine.asm                                                         PAGE   39

    2081                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    2082                    $C$DW$152       .dwtag  DW_TAG_member
    2083                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$3)
    2084                            .dwattr $C$DW$152, DW_AT_name("pvBaseAddress")
    2085                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("pvBaseAddress")
    2086                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2087                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2088                            .dwattr $C$DW$152, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/includ
    2089                            .dwattr $C$DW$152, DW_AT_decl_line(0x7a)
    2090                            .dwattr $C$DW$152, DW_AT_decl_column(0x08)
    2091                    $C$DW$153       .dwtag  DW_TAG_member
    2092                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$13)
    2093                            .dwattr $C$DW$153, DW_AT_name("ulLengthInBytes")
    2094                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("ulLengthInBytes")
    2095                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2096                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2097                            .dwattr $C$DW$153, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/includ
    2098                            .dwattr $C$DW$153, DW_AT_decl_line(0x7b)
    2099                            .dwattr $C$DW$153, DW_AT_decl_column(0x10)
    2100                    $C$DW$154       .dwtag  DW_TAG_member
    2101                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$13)
    2102                            .dwattr $C$DW$154, DW_AT_name("ulParameters")
    2103                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("ulParameters")
    2104                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2105                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2106                            .dwattr $C$DW$154, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/includ
    2107                            .dwattr $C$DW$154, DW_AT_decl_line(0x7c)
    2108                            .dwattr $C$DW$154, DW_AT_decl_column(0x10)
    2109                            .dwendtag $C$DW$T$35
    2110                    
    2111                            .dwattr $C$DW$T$35, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/inclu
    2112                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x78)
    2113                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2114                    $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    2115                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$35)
    2116                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2117                            .dwattr $C$DW$T$44, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/inclu
    2118                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x7d)
    2119                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x03)
    2120                    
    2121                    $C$DW$T$45      .dwtag  DW_TAG_array_type
    2122                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    2123                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2124                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x0c)
    2125                    $C$DW$155       .dwtag  DW_TAG_subrange_type
    2126                            .dwattr $C$DW$155, DW_AT_upper_bound(0x00)
    2127                            .dwendtag $C$DW$T$45
    2128                    
    2129                    
    2130                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2131                            .dwattr $C$DW$T$36, DW_AT_name("xMINI_LIST_ITEM")
    2132                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x0c)
    2133                    $C$DW$156       .dwtag  DW_TAG_member
    2134                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$31)
    2135                            .dwattr $C$DW$156, DW_AT_name("xItemValue")
TI ARM Assembler PC v5.0.4 Mon Apr 28 11:29:07 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
croutine.asm                                                         PAGE   40

    2136                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("xItemValue")
    2137                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2138                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2139                            .dwattr $C$DW$156, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\includ
    2140                            .dwattr $C$DW$156, DW_AT_decl_line(0x7d)
    2141                            .dwattr $C$DW$156, DW_AT_decl_column(0x0f)
    2142                    $C$DW$157       .dwtag  DW_TAG_member
    2143                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$33)
    2144                            .dwattr $C$DW$157, DW_AT_name("pxNext")
    2145                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("pxNext")
    2146                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2147                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2148                            .dwattr $C$DW$157, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\includ
    2149                            .dwattr $C$DW$157, DW_AT_decl_line(0x7e)
    2150                            .dwattr $C$DW$157, DW_AT_decl_column(0x1e)
    2151                    $C$DW$158       .dwtag  DW_TAG_member
    2152                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$33)
    2153                            .dwattr $C$DW$158, DW_AT_name("pxPrevious")
    2154                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("pxPrevious")
    2155                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2156                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2157                            .dwattr $C$DW$158, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\includ
    2158                            .dwattr $C$DW$158, DW_AT_decl_line(0x7f)
    2159                            .dwattr $C$DW$158, DW_AT_decl_column(0x1e)
    2160                            .dwendtag $C$DW$T$36
    2161                    
    2162                            .dwattr $C$DW$T$36, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\inclu
    2163                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x7b)
    2164                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x08)
    2165                    $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    2166                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$36)
    2167                            .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    2168                            .dwattr $C$DW$T$28, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\inclu
    2169                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x81)
    2170                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x20)
    2171                    $C$DW$T$29      .dwtag  DW_TAG_volatile_type
    2172                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    2173                    
    2174                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2175                            .dwattr $C$DW$T$46, DW_AT_name("xTASK_PARAMTERS")
    2176                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x24)
    2177                    $C$DW$159       .dwtag  DW_TAG_member
    2178                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$39)
    2179                            .dwattr $C$DW$159, DW_AT_name("pvTaskCode")
    2180                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("pvTaskCode")
    2181                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2182                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2183                            .dwattr $C$DW$159, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/includ
    2184                            .dwattr $C$DW$159, DW_AT_decl_line(0x84)
    2185                            .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    2186                    $C$DW$160       .dwtag  DW_TAG_member
    2187                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$42)
    2188                            .dwattr $C$DW$160, DW_AT_name("pcName")
    2189                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("pcName")
    2190                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TI ARM Assembler PC v5.0.4 Mon Apr 28 11:29:07 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
croutine.asm                                                         PAGE   41

    2191                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2192                            .dwattr $C$DW$160, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/includ
    2193                            .dwattr $C$DW$160, DW_AT_decl_line(0x85)
    2194                            .dwattr $C$DW$160, DW_AT_decl_column(0x1c)
    2195                    $C$DW$161       .dwtag  DW_TAG_member
    2196                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$9)
    2197                            .dwattr $C$DW$161, DW_AT_name("usStackDepth")
    2198                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("usStackDepth")
    2199                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2200                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2201                            .dwattr $C$DW$161, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/includ
    2202                            .dwattr $C$DW$161, DW_AT_decl_line(0x86)
    2203                            .dwattr $C$DW$161, DW_AT_decl_column(0x11)
    2204                    $C$DW$162       .dwtag  DW_TAG_member
    2205                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$3)
    2206                            .dwattr $C$DW$162, DW_AT_name("pvParameters")
    2207                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("pvParameters")
    2208                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2209                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2210                            .dwattr $C$DW$162, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/includ
    2211                            .dwattr $C$DW$162, DW_AT_decl_line(0x87)
    2212                            .dwattr $C$DW$162, DW_AT_decl_column(0x08)
    2213                    $C$DW$163       .dwtag  DW_TAG_member
    2214                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$13)
    2215                            .dwattr $C$DW$163, DW_AT_name("uxPriority")
    2216                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("uxPriority")
    2217                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2218                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2219                            .dwattr $C$DW$163, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/includ
    2220                            .dwattr $C$DW$163, DW_AT_decl_line(0x88)
    2221                            .dwattr $C$DW$163, DW_AT_decl_column(0x19)
    2222                    $C$DW$164       .dwtag  DW_TAG_member
    2223                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$43)
    2224                            .dwattr $C$DW$164, DW_AT_name("puxStackBuffer")
    2225                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("puxStackBuffer")
    2226                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2227                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2228                            .dwattr $C$DW$164, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/includ
    2229                            .dwattr $C$DW$164, DW_AT_decl_line(0x89)
    2230                            .dwattr $C$DW$164, DW_AT_decl_column(0x12)
    2231                    $C$DW$165       .dwtag  DW_TAG_member
    2232                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$45)
    2233                            .dwattr $C$DW$165, DW_AT_name("xRegions")
    2234                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("xRegions")
    2235                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2236                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2237                            .dwattr $C$DW$165, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/includ
    2238                            .dwattr $C$DW$165, DW_AT_decl_line(0x8a)
    2239                            .dwattr $C$DW$165, DW_AT_decl_column(0x10)
    2240                            .dwendtag $C$DW$T$46
    2241                    
    2242                            .dwattr $C$DW$T$46, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/inclu
    2243                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x82)
    2244                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x10)
    2245                    $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
TI ARM Assembler PC v5.0.4 Mon Apr 28 11:29:07 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
croutine.asm                                                         PAGE   42

    2246                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$46)
    2247                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    2248                            .dwattr $C$DW$T$94, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/inclu
    2249                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x8b)
    2250                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x03)
    2251                    
    2252                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2253                            .dwattr $C$DW$T$47, DW_AT_name("xTIME_OUT")
    2254                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x08)
    2255                    $C$DW$166       .dwtag  DW_TAG_member
    2256                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$12)
    2257                            .dwattr $C$DW$166, DW_AT_name("xOverflowCount")
    2258                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("xOverflowCount")
    2259                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2260                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2261                            .dwattr $C$DW$166, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/includ
    2262                            .dwattr $C$DW$166, DW_AT_decl_line(0x71)
    2263                            .dwattr $C$DW$166, DW_AT_decl_column(0x10)
    2264                    $C$DW$167       .dwtag  DW_TAG_member
    2265                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$31)
    2266                            .dwattr $C$DW$167, DW_AT_name("xTimeOnEntering")
    2267                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("xTimeOnEntering")
    2268                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2269                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2270                            .dwattr $C$DW$167, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/includ
    2271                            .dwattr $C$DW$167, DW_AT_decl_line(0x72)
    2272                            .dwattr $C$DW$167, DW_AT_decl_column(0x10)
    2273                            .dwendtag $C$DW$T$47
    2274                    
    2275                            .dwattr $C$DW$T$47, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/inclu
    2276                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x6f)
    2277                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
    2278                    $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    2279                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$47)
    2280                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    2281                            .dwattr $C$DW$T$95, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/inclu
    2282                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x73)
    2283                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
    2284                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    2285                    
    2286                    ;***************************************************************
    2287                    ;* DWARF CIE ENTRIES                                           *
    2288                    ;***************************************************************
    2289                    
    2290                    $C$DW$CIE       .dwcie 14
    2291                            .dwcfi  cfa_register, 13
    2292                            .dwcfi  cfa_offset, 0
    2293                            .dwcfi  undefined, 0
    2294                            .dwcfi  undefined, 1
    2295                            .dwcfi  undefined, 2
    2296                            .dwcfi  undefined, 3
    2297                            .dwcfi  same_value, 4
    2298                            .dwcfi  same_value, 5
    2299                            .dwcfi  same_value, 6
    2300                            .dwcfi  same_value, 7
TI ARM Assembler PC v5.0.4 Mon Apr 28 11:29:07 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
croutine.asm                                                         PAGE   43

    2301                            .dwcfi  same_value, 8
    2302                            .dwcfi  same_value, 9
    2303                            .dwcfi  same_value, 10
    2304                            .dwcfi  same_value, 11
    2305                            .dwcfi  undefined, 12
    2306                            .dwcfi  undefined, 13
    2307                            .dwcfi  undefined, 14
    2308                            .dwcfi  undefined, 14
    2309                            .dwcfi  undefined, 7
    2310                            .dwendentry
    2311                            .dwendtag $C$DW$CU
    2312                    

--------------------------
Thumb2 Statistics
--------------------------
Number of Thumb2 ins converted to Thumb = 0 (0%)
Number of Thumb ins in input = 339 (90%)
Number of Thumb2 ins encoded as Thumb2 = 37 (100%)
Number of Thumb2 ins converted to 2 OPND Thumb = 73


No Assembly Errors, No Assembly Warnings
