TI ARM Assembler PC v5.0.4 Mon Apr 07 10:00:28 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
queue.asm                                                            PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.0.4 *
       3                    ;* Date/Time created: Mon Apr 07 10:00:27 2014                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --e
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Source/queue.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.0.4 Copyright (c) 1996-2013 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")

    3211                    $C$DW$282       .dwtag  DW_TAG_enumerator, DW_AT_name("eRunning"), DW_AT_const_value(0x00)
    3212                            .dwattr $C$DW$282, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/includ
    3213                            .dwattr $C$DW$282, DW_AT_decl_line(0x90)
    3214                            .dwattr $C$DW$282, DW_AT_decl_column(0x02)
    3215                    $C$DW$283       .dwtag  DW_TAG_enumerator, DW_AT_name("eReady"), DW_AT_const_value(0x01)
    3216                            .dwattr $C$DW$283, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/includ
    3217                            .dwattr $C$DW$283, DW_AT_decl_line(0x91)
    3218                            .dwattr $C$DW$283, DW_AT_decl_column(0x02)
    3219                    $C$DW$284       .dwtag  DW_TAG_enumerator, DW_AT_name("eBlocked"), DW_AT_const_value(0x02)
    3220                            .dwattr $C$DW$284, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/includ
    3221                            .dwattr $C$DW$284, DW_AT_decl_line(0x92)
    3222                            .dwattr $C$DW$284, DW_AT_decl_column(0x02)
    3223                    $C$DW$285       .dwtag  DW_TAG_enumerator, DW_AT_name("eSuspended"), DW_AT_const_value(0x03)
    3224                            .dwattr $C$DW$285, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/includ
    3225                            .dwattr $C$DW$285, DW_AT_decl_line(0x93)
    3226                            .dwattr $C$DW$285, DW_AT_decl_column(0x02)
    3227                    $C$DW$286       .dwtag  DW_TAG_enumerator, DW_AT_name("eDeleted"), DW_AT_const_value(0x04)
    3228                            .dwattr $C$DW$286, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/includ
    3229                            .dwattr $C$DW$286, DW_AT_decl_line(0x94)
    3230                            .dwattr $C$DW$286, DW_AT_decl_column(0x02)
    3231                            .dwendtag $C$DW$T$50
    3232                    
    3233                            .dwattr $C$DW$T$50, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/inclu
    3234                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x8f)
    3235                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    3236                    $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("eTaskState")
    3237                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    3238                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    3239                            .dwattr $C$DW$T$51, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/inclu
    3240                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x95)
    3241                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
    3242                    
    3243                    $C$DW$T$52      .dwtag  DW_TAG_enumeration_type
    3244                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    3245                    $C$DW$287       .dwtag  DW_TAG_enumerator, DW_AT_name("eAbortSleep"), DW_AT_const_value(0x00)
TI ARM Assembler PC v5.0.4 Mon Apr 07 10:00:28 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
queue.asm                                                            PAGE   60

    3246                            .dwattr $C$DW$287, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/includ
    3247                            .dwattr $C$DW$287, DW_AT_decl_line(0x9a)
    3248                            .dwattr $C$DW$287, DW_AT_decl_column(0x02)
    3249                    $C$DW$288       .dwtag  DW_TAG_enumerator, DW_AT_name("eStandardSleep"), DW_AT_const_value(0x01)
    3250                            .dwattr $C$DW$288, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/includ
    3251                            .dwattr $C$DW$288, DW_AT_decl_line(0x9b)
    3252                            .dwattr $C$DW$288, DW_AT_decl_column(0x02)
    3253                    $C$DW$289       .dwtag  DW_TAG_enumerator, DW_AT_name("eNoTasksWaitingTimeout"), DW_AT_const_value(0x0
    3254                            .dwattr $C$DW$289, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/includ
    3255                            .dwattr $C$DW$289, DW_AT_decl_line(0x9c)
    3256                            .dwattr $C$DW$289, DW_AT_decl_column(0x02)
    3257                            .dwendtag $C$DW$T$52
    3258                    
    3259                            .dwattr $C$DW$T$52, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/inclu
    3260                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x99)
    3261                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
    3262                    $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("eSleepModeStatus")
    3263                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    3264                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    3265                            .dwattr $C$DW$T$53, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/inclu
    3266                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x9d)
    3267                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x03)
    3268                    
    3269                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3270                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x08)
    3271                    $C$DW$290       .dwtag  DW_TAG_member
    3272                            .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$10)
    3273                            .dwattr $C$DW$290, DW_AT_name("quot")
    3274                            .dwattr $C$DW$290, DW_AT_TI_symbol_name("quot")
    3275                            .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3276                            .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3277                            .dwattr $C$DW$290, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    3278                            .dwattr $C$DW$290, DW_AT_decl_line(0x50)
    3279                            .dwattr $C$DW$290, DW_AT_decl_column(0x16)
    3280                    $C$DW$291       .dwtag  DW_TAG_member
    3281                            .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$10)
    3282                            .dwattr $C$DW$291, DW_AT_name("rem")
    3283                            .dwattr $C$DW$291, DW_AT_TI_symbol_name("rem")
    3284                            .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3285                            .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3286                            .dwattr $C$DW$291, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    3287                            .dwattr $C$DW$291, DW_AT_decl_line(0x50)
    3288                            .dwattr $C$DW$291, DW_AT_decl_column(0x1c)
    3289                            .dwendtag $C$DW$T$19
    3290                    
    3291                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    3292                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x50)
    3293                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    3294                    $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    3295                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$19)
    3296                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    3297                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    3298                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x50)
    3299                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x23)
    3300                    
TI ARM Assembler PC v5.0.4 Mon Apr 07 10:00:28 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
queue.asm                                                            PAGE   61

    3301                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    3302                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
    3303                    $C$DW$292       .dwtag  DW_TAG_member
    3304                            .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$10)
    3305                            .dwattr $C$DW$292, DW_AT_name("quot")
    3306                            .dwattr $C$DW$292, DW_AT_TI_symbol_name("quot")
    3307                            .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3308                            .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3309                            .dwattr $C$DW$292, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    3310                            .dwattr $C$DW$292, DW_AT_decl_line(0x52)
    3311                            .dwattr $C$DW$292, DW_AT_decl_column(0x16)
    3312                    $C$DW$293       .dwtag  DW_TAG_member
    3313                            .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$10)
    3314                            .dwattr $C$DW$293, DW_AT_name("rem")
    3315                            .dwattr $C$DW$293, DW_AT_TI_symbol_name("rem")
    3316                            .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3317                            .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3318                            .dwattr $C$DW$293, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    3319                            .dwattr $C$DW$293, DW_AT_decl_line(0x52)
    3320                            .dwattr $C$DW$293, DW_AT_decl_column(0x1c)
    3321                            .dwendtag $C$DW$T$20
    3322                    
    3323                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    3324                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x52)
    3325                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    3326                    $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    3327                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$20)
    3328                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3329                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    3330                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x52)
    3331                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x23)
    3332                    
    3333                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    3334                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
    3335                    $C$DW$294       .dwtag  DW_TAG_member
    3336                            .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$14)
    3337                            .dwattr $C$DW$294, DW_AT_name("quot")
    3338                            .dwattr $C$DW$294, DW_AT_TI_symbol_name("quot")
    3339                            .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3340                            .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3341                            .dwattr $C$DW$294, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    3342                            .dwattr $C$DW$294, DW_AT_decl_line(0x55)
    3343                            .dwattr $C$DW$294, DW_AT_decl_column(0x1c)
    3344                    $C$DW$295       .dwtag  DW_TAG_member
    3345                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$14)
    3346                            .dwattr $C$DW$295, DW_AT_name("rem")
    3347                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("rem")
    3348                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3349                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3350                            .dwattr $C$DW$295, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    3351                            .dwattr $C$DW$295, DW_AT_decl_line(0x55)
    3352                            .dwattr $C$DW$295, DW_AT_decl_column(0x22)
    3353                            .dwendtag $C$DW$T$21
    3354                    
    3355                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
TI ARM Assembler PC v5.0.4 Mon Apr 07 10:00:28 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
queue.asm                                                            PAGE   62

    3356                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x55)
    3357                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    3358                    $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    3359                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$21)
    3360                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3361                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    3362                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x55)
    3363                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x29)
    3364                    
    3365                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3366                            .dwattr $C$DW$T$26, DW_AT_name("QueueDefinition")
    3367                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x4c)
    3368                    $C$DW$296       .dwtag  DW_TAG_member
    3369                            .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$22)
    3370                            .dwattr $C$DW$296, DW_AT_name("pcHead")
    3371                            .dwattr $C$DW$296, DW_AT_TI_symbol_name("pcHead")
    3372                            .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3373                            .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3374                            .dwattr $C$DW$296, DW_AT_decl_file("../Source/queue.c")
    3375                            .dwattr $C$DW$296, DW_AT_decl_line(0x76)
    3376                            .dwattr $C$DW$296, DW_AT_decl_column(0x0f)
    3377                    $C$DW$297       .dwtag  DW_TAG_member
    3378                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$22)
    3379                            .dwattr $C$DW$297, DW_AT_name("pcTail")
    3380                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("pcTail")
    3381                            .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3382                            .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3383                            .dwattr $C$DW$297, DW_AT_decl_file("../Source/queue.c")
    3384                            .dwattr $C$DW$297, DW_AT_decl_line(0x77)
    3385                            .dwattr $C$DW$297, DW_AT_decl_column(0x0f)
    3386                    $C$DW$298       .dwtag  DW_TAG_member
    3387                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$22)
    3388                            .dwattr $C$DW$298, DW_AT_name("pcWriteTo")
    3389                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("pcWriteTo")
    3390                            .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3391                            .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3392                            .dwattr $C$DW$298, DW_AT_decl_file("../Source/queue.c")
    3393                            .dwattr $C$DW$298, DW_AT_decl_line(0x79)
    3394                            .dwattr $C$DW$298, DW_AT_decl_column(0x0f)
    3395                    $C$DW$299       .dwtag  DW_TAG_member
    3396                            .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$22)
    3397                            .dwattr $C$DW$299, DW_AT_name("pcReadFrom")
    3398                            .dwattr $C$DW$299, DW_AT_TI_symbol_name("pcReadFrom")
    3399                            .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3400                            .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3401                            .dwattr $C$DW$299, DW_AT_decl_file("../Source/queue.c")
    3402                            .dwattr $C$DW$299, DW_AT_decl_line(0x7a)
    3403                            .dwattr $C$DW$299, DW_AT_decl_column(0x0f)
    3404                    $C$DW$300       .dwtag  DW_TAG_member
    3405                            .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$23)
    3406                            .dwattr $C$DW$300, DW_AT_name("xTasksWaitingToSend")
    3407                            .dwattr $C$DW$300, DW_AT_TI_symbol_name("xTasksWaitingToSend")
    3408                            .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3409                            .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3410                            .dwattr $C$DW$300, DW_AT_decl_file("../Source/queue.c")
TI ARM Assembler PC v5.0.4 Mon Apr 07 10:00:28 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
queue.asm                                                            PAGE   63

    3411                            .dwattr $C$DW$300, DW_AT_decl_line(0x7c)
    3412                            .dwattr $C$DW$300, DW_AT_decl_column(0x08)
    3413                    $C$DW$301       .dwtag  DW_TAG_member
    3414                            .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$23)
    3415                            .dwattr $C$DW$301, DW_AT_name("xTasksWaitingToReceive")
    3416                            .dwattr $C$DW$301, DW_AT_TI_symbol_name("xTasksWaitingToReceive")
    3417                            .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3418                            .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3419                            .dwattr $C$DW$301, DW_AT_decl_file("../Source/queue.c")
    3420                            .dwattr $C$DW$301, DW_AT_decl_line(0x7d)
    3421                            .dwattr $C$DW$301, DW_AT_decl_column(0x08)
    3422                    $C$DW$302       .dwtag  DW_TAG_member
    3423                            .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$24)
    3424                            .dwattr $C$DW$302, DW_AT_name("uxMessagesWaiting")
    3425                            .dwattr $C$DW$302, DW_AT_TI_symbol_name("uxMessagesWaiting")
    3426                            .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3427                            .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3428                            .dwattr $C$DW$302, DW_AT_decl_file("../Source/queue.c")
    3429                            .dwattr $C$DW$302, DW_AT_decl_line(0x7f)
    3430                            .dwattr $C$DW$302, DW_AT_decl_column(0x22)
    3431                    $C$DW$303       .dwtag  DW_TAG_member
    3432                            .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$13)
    3433                            .dwattr $C$DW$303, DW_AT_name("uxLength")
    3434                            .dwattr $C$DW$303, DW_AT_TI_symbol_name("uxLength")
    3435                            .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3436                            .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3437                            .dwattr $C$DW$303, DW_AT_decl_file("../Source/queue.c")
    3438                            .dwattr $C$DW$303, DW_AT_decl_line(0x80)
    3439                            .dwattr $C$DW$303, DW_AT_decl_column(0x19)
    3440                    $C$DW$304       .dwtag  DW_TAG_member
    3441                            .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$13)
    3442                            .dwattr $C$DW$304, DW_AT_name("uxItemSize")
    3443                            .dwattr $C$DW$304, DW_AT_TI_symbol_name("uxItemSize")
    3444                            .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3445                            .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3446                            .dwattr $C$DW$304, DW_AT_decl_file("../Source/queue.c")
    3447                            .dwattr $C$DW$304, DW_AT_decl_line(0x81)
    3448                            .dwattr $C$DW$304, DW_AT_decl_column(0x19)
    3449                    $C$DW$305       .dwtag  DW_TAG_member
    3450                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$25)
    3451                            .dwattr $C$DW$305, DW_AT_name("xRxLock")
    3452                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("xRxLock")
    3453                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3454                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3455                            .dwattr $C$DW$305, DW_AT_decl_file("../Source/queue.c")
    3456                            .dwattr $C$DW$305, DW_AT_decl_line(0x83)
    3457                            .dwattr $C$DW$305, DW_AT_decl_column(0x20)
    3458                    $C$DW$306       .dwtag  DW_TAG_member
    3459                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$25)
    3460                            .dwattr $C$DW$306, DW_AT_name("xTxLock")
    3461                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("xTxLock")
    3462                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3463                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3464                            .dwattr $C$DW$306, DW_AT_decl_file("../Source/queue.c")
    3465                            .dwattr $C$DW$306, DW_AT_decl_line(0x84)
TI ARM Assembler PC v5.0.4 Mon Apr 07 10:00:28 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
queue.asm                                                            PAGE   64

    3466                            .dwattr $C$DW$306, DW_AT_decl_column(0x20)
    3467                            .dwendtag $C$DW$T$26
    3468                    
    3469                            .dwattr $C$DW$T$26, DW_AT_decl_file("../Source/queue.c")
    3470                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x74)
    3471                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    3472                    $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("xQUEUE")
    3473                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$26)
    3474                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    3475                            .dwattr $C$DW$T$57, DW_AT_decl_file("../Source/queue.c")
    3476                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x8f)
    3477                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x03)
    3478                    $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    3479                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    3480                            .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    3481                    $C$DW$T$59      .dwtag  DW_TAG_const_type
    3482                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    3483                    $C$DW$T$60      .dwtag  DW_TAG_const_type
    3484                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$57)
    3485                    $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    3486                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    3487                            .dwattr $C$DW$T$61, DW_AT_address_class(0x20)
    3488                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3489                            .dwattr $C$DW$T$2, DW_AT_name("void")
    3490                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3491                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3492                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3493                    $C$DW$T$68      .dwtag  DW_TAG_const_type
    3494                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$3)
    3495                    $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("xQueueHandle")
    3496                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$3)
    3497                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    3498                            .dwattr $C$DW$T$69, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/inclu
    3499                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x5f)
    3500                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x10)
    3501                    $C$DW$T$71      .dwtag  DW_TAG_const_type
    3502                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$69)
    3503                    $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("xQueueSetHandle")
    3504                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$3)
    3505                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    3506                            .dwattr $C$DW$T$72, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/inclu
    3507                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x66)
    3508                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x10)
    3509                    $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("xQueueSetMemberHandle")
    3510                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$3)
    3511                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    3512                            .dwattr $C$DW$T$73, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/inclu
    3513                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x6d)
    3514                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x10)
    3515                    $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskHandle")
    3516                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$3)
    3517                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3518                            .dwattr $C$DW$T$74, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/inclu
    3519                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x6a)
    3520                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x10)
TI ARM Assembler PC v5.0.4 Mon Apr 07 10:00:28 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
queue.asm                                                            PAGE   65

    3521                    
    3522                    $C$DW$T$39      .dwtag  DW_TAG_subroutine_type
    3523                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3524                    $C$DW$307       .dwtag  DW_TAG_formal_parameter
    3525                            .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$3)
    3526                            .dwendtag $C$DW$T$39
    3527                    
    3528                    $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    3529                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    3530                            .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    3531                    $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_CODE")
    3532                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3533                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3534                            .dwattr $C$DW$T$41, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\inclu
    3535                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x4f)
    3536                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    3537                    $C$DW$T$62      .dwtag  DW_TAG_const_type
    3538                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$2)
    3539                    $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    3540                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    3541                            .dwattr $C$DW$T$63, DW_AT_address_class(0x20)
    3542                    $C$DW$T$75      .dwtag  DW_TAG_const_type
    3543                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$63)
    3544                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    3545                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3546                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    3547                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3548                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    3549                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3550                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3551                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3552                    $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    3553                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$5)
    3554                            .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
    3555                    $C$DW$T$42      .dwtag  DW_TAG_const_type
    3556                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$5)
    3557                    $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3558                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    3559                            .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    3560                    $C$DW$T$44      .dwtag  DW_TAG_const_type
    3561                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3562                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    3563                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3564                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3565                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3566                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    3567                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3568                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3569                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    3570                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    3571                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3572                            .dwattr $C$DW$T$8, DW_AT_name("short")
    3573                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    3574                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    3575                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
TI ARM Assembler PC v5.0.4 Mon Apr 07 10:00:28 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
queue.asm                                                            PAGE   66

    3576                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3577                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    3578                    $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    3579                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$9)
    3580                            .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    3581                            .dwattr $C$DW$T$100, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/includ
    3582                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x6a)
    3583                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x1a)
    3584                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    3585                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3586                            .dwattr $C$DW$T$10, DW_AT_name("int")
    3587                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    3588                    $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
    3589                            .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$10)
    3590                            .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    3591                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/includ
    3592                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x31)
    3593                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x1c)
    3594                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    3595                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3596                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    3597                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    3598                    $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    3599                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$11)
    3600                            .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    3601                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    3602                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x64)
    3603                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x19)
    3604                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    3605                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    3606                            .dwattr $C$DW$T$12, DW_AT_name("long")
    3607                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    3608                    $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    3609                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$12)
    3610                    $C$DW$T$113     .dwtag  DW_TAG_pointer_type
    3611                            .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$12)
    3612                            .dwattr $C$DW$T$113, DW_AT_address_class(0x20)
    3613                    
    3614                    $C$DW$T$120     .dwtag  DW_TAG_subroutine_type
    3615                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$12)
    3616                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    3617                    $C$DW$308       .dwtag  DW_TAG_formal_parameter
    3618                            .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$3)
    3619                            .dwendtag $C$DW$T$120
    3620                    
    3621                    $C$DW$T$121     .dwtag  DW_TAG_pointer_type
    3622                            .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    3623                            .dwattr $C$DW$T$121, DW_AT_address_class(0x20)
    3624                    $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_HOOK_CODE")
    3625                            .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
    3626                            .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    3627                            .dwattr $C$DW$T$122, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/incl
    3628                            .dwattr $C$DW$T$122, DW_AT_decl_line(0x66)
    3629                            .dwattr $C$DW$T$122, DW_AT_decl_column(0x19)
    3630                    $C$DW$T$13      .dwtag  DW_TAG_base_type
TI ARM Assembler PC v5.0.4 Mon Apr 07 10:00:28 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
queue.asm                                                            PAGE   67

    3631                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    3632                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    3633                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    3634                    $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    3635                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$13)
    3636                    $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    3637                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$13)
    3638                            .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    3639                    $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    3640                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$13)
    3641                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3642                            .dwattr $C$DW$T$33, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\inclu
    3643                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x6a)
    3644                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x1c)
    3645                    $C$DW$T$106     .dwtag  DW_TAG_pointer_type
    3646                            .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$33)
    3647                            .dwattr $C$DW$T$106, DW_AT_address_class(0x20)
    3648                    $C$DW$T$107     .dwtag  DW_TAG_const_type
    3649                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
    3650                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    3651                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    3652                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    3653                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    3654                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    3655                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    3656                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    3657                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    3658                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    3659                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    3660                            .dwattr $C$DW$T$16, DW_AT_name("float")
    3661                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    3662                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    3663                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    3664                            .dwattr $C$DW$T$17, DW_AT_name("double")
    3665                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    3666                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    3667                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    3668                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    3669                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    3670                    
    3671                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3672                            .dwattr $C$DW$T$32, DW_AT_name("xLIST")
    3673                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x14)
    3674                    $C$DW$309       .dwtag  DW_TAG_member
    3675                            .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$24)
    3676                            .dwattr $C$DW$309, DW_AT_name("uxNumberOfItems")
    3677                            .dwattr $C$DW$309, DW_AT_TI_symbol_name("uxNumberOfItems")
    3678                            .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3679                            .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3680                            .dwattr $C$DW$309, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\includ
    3681                            .dwattr $C$DW$309, DW_AT_decl_line(0x88)
    3682                            .dwattr $C$DW$309, DW_AT_decl_column(0x22)
    3683                    $C$DW$310       .dwtag  DW_TAG_member
    3684                            .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$29)
    3685                            .dwattr $C$DW$310, DW_AT_name("pxIndex")
TI ARM Assembler PC v5.0.4 Mon Apr 07 10:00:28 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
queue.asm                                                            PAGE   68

    3686                            .dwattr $C$DW$310, DW_AT_TI_symbol_name("pxIndex")
    3687                            .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3688                            .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3689                            .dwattr $C$DW$310, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\includ
    3690                            .dwattr $C$DW$310, DW_AT_decl_line(0x89)
    3691                            .dwattr $C$DW$310, DW_AT_decl_column(0x17)
    3692                    $C$DW$311       .dwtag  DW_TAG_member
    3693                            .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$31)
    3694                            .dwattr $C$DW$311, DW_AT_name("xListEnd")
    3695                            .dwattr $C$DW$311, DW_AT_TI_symbol_name("xListEnd")
    3696                            .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3697                            .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3698                            .dwattr $C$DW$311, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\includ
    3699                            .dwattr $C$DW$311, DW_AT_decl_line(0x8a)
    3700                            .dwattr $C$DW$311, DW_AT_decl_column(0x19)
    3701                            .dwendtag $C$DW$T$32
    3702                    
    3703                            .dwattr $C$DW$T$32, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\inclu
    3704                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x86)
    3705                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    3706                    $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    3707                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$32)
    3708                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    3709                            .dwattr $C$DW$T$23, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\inclu
    3710                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x8b)
    3711                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x03)
    3712                    $C$DW$T$80      .dwtag  DW_TAG_pointer_type
    3713                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$23)
    3714                            .dwattr $C$DW$T$80, DW_AT_address_class(0x20)
    3715                    $C$DW$T$83      .dwtag  DW_TAG_const_type
    3716                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$23)
    3717                    $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    3718                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    3719                            .dwattr $C$DW$T$84, DW_AT_address_class(0x20)
    3720                    $C$DW$T$85      .dwtag  DW_TAG_const_type
    3721                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    3722                    
    3723                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3724                            .dwattr $C$DW$T$36, DW_AT_name("xLIST_ITEM")
    3725                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x14)
    3726                    $C$DW$312       .dwtag  DW_TAG_member
    3727                            .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$33)
    3728                            .dwattr $C$DW$312, DW_AT_name("xItemValue")
    3729                            .dwattr $C$DW$312, DW_AT_TI_symbol_name("xItemValue")
    3730                            .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3731                            .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3732                            .dwattr $C$DW$312, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\includ
    3733                            .dwattr $C$DW$312, DW_AT_decl_line(0x73)
    3734                            .dwattr $C$DW$312, DW_AT_decl_column(0x0f)
    3735                    $C$DW$313       .dwtag  DW_TAG_member
    3736                            .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$35)
    3737                            .dwattr $C$DW$313, DW_AT_name("pxNext")
    3738                            .dwattr $C$DW$313, DW_AT_TI_symbol_name("pxNext")
    3739                            .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3740                            .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v5.0.4 Mon Apr 07 10:00:28 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
queue.asm                                                            PAGE   69

    3741                            .dwattr $C$DW$313, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\includ
    3742                            .dwattr $C$DW$313, DW_AT_decl_line(0x74)
    3743                            .dwattr $C$DW$313, DW_AT_decl_column(0x1f)
    3744                    $C$DW$314       .dwtag  DW_TAG_member
    3745                            .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$35)
    3746                            .dwattr $C$DW$314, DW_AT_name("pxPrevious")
    3747                            .dwattr $C$DW$314, DW_AT_TI_symbol_name("pxPrevious")
    3748                            .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3749                            .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3750                            .dwattr $C$DW$314, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\includ
    3751                            .dwattr $C$DW$314, DW_AT_decl_line(0x75)
    3752                            .dwattr $C$DW$314, DW_AT_decl_column(0x1f)
    3753                    $C$DW$315       .dwtag  DW_TAG_member
    3754                            .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$3)
    3755                            .dwattr $C$DW$315, DW_AT_name("pvOwner")
    3756                            .dwattr $C$DW$315, DW_AT_TI_symbol_name("pvOwner")
    3757                            .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3758                            .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3759                            .dwattr $C$DW$315, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\includ
    3760                            .dwattr $C$DW$315, DW_AT_decl_line(0x76)
    3761                            .dwattr $C$DW$315, DW_AT_decl_column(0x09)
    3762                    $C$DW$316       .dwtag  DW_TAG_member
    3763                            .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$3)
    3764                            .dwattr $C$DW$316, DW_AT_name("pvContainer")
    3765                            .dwattr $C$DW$316, DW_AT_TI_symbol_name("pvContainer")
    3766                            .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3767                            .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3768                            .dwattr $C$DW$316, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\includ
    3769                            .dwattr $C$DW$316, DW_AT_decl_line(0x77)
    3770                            .dwattr $C$DW$316, DW_AT_decl_column(0x09)
    3771                            .dwendtag $C$DW$T$36
    3772                    
    3773                            .dwattr $C$DW$T$36, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\inclu
    3774                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x71)
    3775                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x08)
    3776                    $C$DW$T$34      .dwtag  DW_TAG_volatile_type
    3777                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$36)
    3778                    $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    3779                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    3780                            .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
    3781                    $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    3782                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$36)
    3783                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    3784                            .dwattr $C$DW$T$27, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\inclu
    3785                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x79)
    3786                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x1b)
    3787                    $C$DW$T$28      .dwtag  DW_TAG_volatile_type
    3788                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    3789                    $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3790                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    3791                            .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    3792                    
    3793                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3794                            .dwattr $C$DW$T$37, DW_AT_name("xMEMORY_REGION")
    3795                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x0c)
TI ARM Assembler PC v5.0.4 Mon Apr 07 10:00:28 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
queue.asm                                                            PAGE   70

    3796                    $C$DW$317       .dwtag  DW_TAG_member
    3797                            .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$3)
    3798                            .dwattr $C$DW$317, DW_AT_name("pvBaseAddress")
    3799                            .dwattr $C$DW$317, DW_AT_TI_symbol_name("pvBaseAddress")
    3800                            .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3801                            .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3802                            .dwattr $C$DW$317, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/includ
    3803                            .dwattr $C$DW$317, DW_AT_decl_line(0x7a)
    3804                            .dwattr $C$DW$317, DW_AT_decl_column(0x08)
    3805                    $C$DW$318       .dwtag  DW_TAG_member
    3806                            .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$13)
    3807                            .dwattr $C$DW$318, DW_AT_name("ulLengthInBytes")
    3808                            .dwattr $C$DW$318, DW_AT_TI_symbol_name("ulLengthInBytes")
    3809                            .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3810                            .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3811                            .dwattr $C$DW$318, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/includ
    3812                            .dwattr $C$DW$318, DW_AT_decl_line(0x7b)
    3813                            .dwattr $C$DW$318, DW_AT_decl_column(0x10)
    3814                    $C$DW$319       .dwtag  DW_TAG_member
    3815                            .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$13)
    3816                            .dwattr $C$DW$319, DW_AT_name("ulParameters")
    3817                            .dwattr $C$DW$319, DW_AT_TI_symbol_name("ulParameters")
    3818                            .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3819                            .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3820                            .dwattr $C$DW$319, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/includ
    3821                            .dwattr $C$DW$319, DW_AT_decl_line(0x7c)
    3822                            .dwattr $C$DW$319, DW_AT_decl_column(0x10)
    3823                            .dwendtag $C$DW$T$37
    3824                    
    3825                            .dwattr $C$DW$T$37, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/inclu
    3826                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x78)
    3827                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    3828                    $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    3829                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$37)
    3830                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    3831                            .dwattr $C$DW$T$46, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/inclu
    3832                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x7d)
    3833                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
    3834                    
    3835                    $C$DW$T$47      .dwtag  DW_TAG_array_type
    3836                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3837                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3838                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x0c)
    3839                    $C$DW$320       .dwtag  DW_TAG_subrange_type
    3840                            .dwattr $C$DW$320, DW_AT_upper_bound(0x00)
    3841                            .dwendtag $C$DW$T$47
    3842                    
    3843                    
    3844                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3845                            .dwattr $C$DW$T$38, DW_AT_name("xMINI_LIST_ITEM")
    3846                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x0c)
    3847                    $C$DW$321       .dwtag  DW_TAG_member
    3848                            .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$33)
    3849                            .dwattr $C$DW$321, DW_AT_name("xItemValue")
    3850                            .dwattr $C$DW$321, DW_AT_TI_symbol_name("xItemValue")
TI ARM Assembler PC v5.0.4 Mon Apr 07 10:00:28 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
queue.asm                                                            PAGE   71

    3851                            .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3852                            .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3853                            .dwattr $C$DW$321, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\includ
    3854                            .dwattr $C$DW$321, DW_AT_decl_line(0x7d)
    3855                            .dwattr $C$DW$321, DW_AT_decl_column(0x0f)
    3856                    $C$DW$322       .dwtag  DW_TAG_member
    3857                            .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$35)
    3858                            .dwattr $C$DW$322, DW_AT_name("pxNext")
    3859                            .dwattr $C$DW$322, DW_AT_TI_symbol_name("pxNext")
    3860                            .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3861                            .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3862                            .dwattr $C$DW$322, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\includ
    3863                            .dwattr $C$DW$322, DW_AT_decl_line(0x7e)
    3864                            .dwattr $C$DW$322, DW_AT_decl_column(0x1e)
    3865                    $C$DW$323       .dwtag  DW_TAG_member
    3866                            .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$35)
    3867                            .dwattr $C$DW$323, DW_AT_name("pxPrevious")
    3868                            .dwattr $C$DW$323, DW_AT_TI_symbol_name("pxPrevious")
    3869                            .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3870                            .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3871                            .dwattr $C$DW$323, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\includ
    3872                            .dwattr $C$DW$323, DW_AT_decl_line(0x7f)
    3873                            .dwattr $C$DW$323, DW_AT_decl_column(0x1e)
    3874                            .dwendtag $C$DW$T$38
    3875                    
    3876                            .dwattr $C$DW$T$38, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\inclu
    3877                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x7b)
    3878                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x08)
    3879                    $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    3880                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$38)
    3881                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3882                            .dwattr $C$DW$T$30, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\inclu
    3883                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x81)
    3884                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x20)
    3885                    $C$DW$T$31      .dwtag  DW_TAG_volatile_type
    3886                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    3887                    
    3888                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    3889                            .dwattr $C$DW$T$48, DW_AT_name("xTASK_PARAMTERS")
    3890                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x24)
    3891                    $C$DW$324       .dwtag  DW_TAG_member
    3892                            .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$41)
    3893                            .dwattr $C$DW$324, DW_AT_name("pvTaskCode")
    3894                            .dwattr $C$DW$324, DW_AT_TI_symbol_name("pvTaskCode")
    3895                            .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3896                            .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3897                            .dwattr $C$DW$324, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/includ
    3898                            .dwattr $C$DW$324, DW_AT_decl_line(0x84)
    3899                            .dwattr $C$DW$324, DW_AT_decl_column(0x0e)
    3900                    $C$DW$325       .dwtag  DW_TAG_member
    3901                            .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$44)
    3902                            .dwattr $C$DW$325, DW_AT_name("pcName")
    3903                            .dwattr $C$DW$325, DW_AT_TI_symbol_name("pcName")
    3904                            .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3905                            .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v5.0.4 Mon Apr 07 10:00:28 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
queue.asm                                                            PAGE   72

    3906                            .dwattr $C$DW$325, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/includ
    3907                            .dwattr $C$DW$325, DW_AT_decl_line(0x85)
    3908                            .dwattr $C$DW$325, DW_AT_decl_column(0x1c)
    3909                    $C$DW$326       .dwtag  DW_TAG_member
    3910                            .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$9)
    3911                            .dwattr $C$DW$326, DW_AT_name("usStackDepth")
    3912                            .dwattr $C$DW$326, DW_AT_TI_symbol_name("usStackDepth")
    3913                            .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3914                            .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3915                            .dwattr $C$DW$326, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/includ
    3916                            .dwattr $C$DW$326, DW_AT_decl_line(0x86)
    3917                            .dwattr $C$DW$326, DW_AT_decl_column(0x11)
    3918                    $C$DW$327       .dwtag  DW_TAG_member
    3919                            .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$3)
    3920                            .dwattr $C$DW$327, DW_AT_name("pvParameters")
    3921                            .dwattr $C$DW$327, DW_AT_TI_symbol_name("pvParameters")
    3922                            .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3923                            .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3924                            .dwattr $C$DW$327, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/includ
    3925                            .dwattr $C$DW$327, DW_AT_decl_line(0x87)
    3926                            .dwattr $C$DW$327, DW_AT_decl_column(0x08)
    3927                    $C$DW$328       .dwtag  DW_TAG_member
    3928                            .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$13)
    3929                            .dwattr $C$DW$328, DW_AT_name("uxPriority")
    3930                            .dwattr $C$DW$328, DW_AT_TI_symbol_name("uxPriority")
    3931                            .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3932                            .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3933                            .dwattr $C$DW$328, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/includ
    3934                            .dwattr $C$DW$328, DW_AT_decl_line(0x88)
    3935                            .dwattr $C$DW$328, DW_AT_decl_column(0x19)
    3936                    $C$DW$329       .dwtag  DW_TAG_member
    3937                            .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$45)
    3938                            .dwattr $C$DW$329, DW_AT_name("puxStackBuffer")
    3939                            .dwattr $C$DW$329, DW_AT_TI_symbol_name("puxStackBuffer")
    3940                            .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3941                            .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3942                            .dwattr $C$DW$329, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/includ
    3943                            .dwattr $C$DW$329, DW_AT_decl_line(0x89)
    3944                            .dwattr $C$DW$329, DW_AT_decl_column(0x12)
    3945                    $C$DW$330       .dwtag  DW_TAG_member
    3946                            .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$47)
    3947                            .dwattr $C$DW$330, DW_AT_name("xRegions")
    3948                            .dwattr $C$DW$330, DW_AT_TI_symbol_name("xRegions")
    3949                            .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3950                            .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3951                            .dwattr $C$DW$330, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/includ
    3952                            .dwattr $C$DW$330, DW_AT_decl_line(0x8a)
    3953                            .dwattr $C$DW$330, DW_AT_decl_column(0x10)
    3954                            .dwendtag $C$DW$T$48
    3955                    
    3956                            .dwattr $C$DW$T$48, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/inclu
    3957                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x82)
    3958                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x10)
    3959                    $C$DW$T$128     .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    3960                            .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$48)
TI ARM Assembler PC v5.0.4 Mon Apr 07 10:00:28 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
queue.asm                                                            PAGE   73

    3961                            .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    3962                            .dwattr $C$DW$T$128, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/incl
    3963                            .dwattr $C$DW$T$128, DW_AT_decl_line(0x8b)
    3964                            .dwattr $C$DW$T$128, DW_AT_decl_column(0x03)
    3965                    
    3966                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3967                            .dwattr $C$DW$T$49, DW_AT_name("xTIME_OUT")
    3968                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x08)
    3969                    $C$DW$331       .dwtag  DW_TAG_member
    3970                            .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$12)
    3971                            .dwattr $C$DW$331, DW_AT_name("xOverflowCount")
    3972                            .dwattr $C$DW$331, DW_AT_TI_symbol_name("xOverflowCount")
    3973                            .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3974                            .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3975                            .dwattr $C$DW$331, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/includ
    3976                            .dwattr $C$DW$331, DW_AT_decl_line(0x71)
    3977                            .dwattr $C$DW$331, DW_AT_decl_column(0x10)
    3978                    $C$DW$332       .dwtag  DW_TAG_member
    3979                            .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$33)
    3980                            .dwattr $C$DW$332, DW_AT_name("xTimeOnEntering")
    3981                            .dwattr $C$DW$332, DW_AT_TI_symbol_name("xTimeOnEntering")
    3982                            .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3983                            .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3984                            .dwattr $C$DW$332, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/includ
    3985                            .dwattr $C$DW$332, DW_AT_decl_line(0x72)
    3986                            .dwattr $C$DW$332, DW_AT_decl_column(0x10)
    3987                            .dwendtag $C$DW$T$49
    3988                    
    3989                            .dwattr $C$DW$T$49, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/inclu
    3990                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x6f)
    3991                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x10)
    3992                    $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    3993                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$49)
    3994                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    3995                            .dwattr $C$DW$T$88, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/inclu
    3996                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x73)
    3997                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x03)
    3998                    $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    3999                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    4000                            .dwattr $C$DW$T$89, DW_AT_address_class(0x20)
    4001                    $C$DW$T$90      .dwtag  DW_TAG_const_type
    4002                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    4003                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    4004                    
    4005                    ;***************************************************************
    4006                    ;* DWARF CIE ENTRIES                                           *
    4007                    ;***************************************************************
    4008                    
    4009                    $C$DW$CIE       .dwcie 14
    4010                            .dwcfi  cfa_register, 13
    4011                            .dwcfi  cfa_offset, 0
    4012                            .dwcfi  undefined, 0
    4013                            .dwcfi  undefined, 1
    4014                            .dwcfi  undefined, 2
    4015                            .dwcfi  undefined, 3
TI ARM Assembler PC v5.0.4 Mon Apr 07 10:00:28 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
queue.asm                                                            PAGE   74

    4016                            .dwcfi  same_value, 4
    4017                            .dwcfi  same_value, 5
    4018                            .dwcfi  same_value, 6
    4019                            .dwcfi  same_value, 7
    4020                            .dwcfi  same_value, 8
    4021                            .dwcfi  same_value, 9
    4022                            .dwcfi  same_value, 10
    4023                            .dwcfi  same_value, 11
    4024                            .dwcfi  undefined, 12
    4025                            .dwcfi  undefined, 13
    4026                            .dwcfi  undefined, 14
    4027                            .dwcfi  undefined, 14
    4028                            .dwcfi  undefined, 7
    4029                            .dwendentry
    4030                            .dwendtag $C$DW$CU
    4031                    

--------------------------
Thumb2 Statistics
--------------------------
Number of Thumb2 ins converted to Thumb = 0 (0%)
Number of Thumb ins in input = 599 (85%)
Number of Thumb2 ins encoded as Thumb2 = 102 (100%)
Number of Thumb2 ins converted to 2 OPND Thumb = 129


