TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
tasks.asm                                                            PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.0.4 *
       3                    ;* Date/Time created: Mon Apr 21 10:17:50 2014                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --e
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Source/tasks.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.0.4 Copyright (c) 1996-2013 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("strncpy")

    3775                            .dwattr $C$DW$267, DW_AT_decl_line(0x90)
    3776                            .dwattr $C$DW$267, DW_AT_decl_column(0x02)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
tasks.asm                                                            PAGE   70

    3777                    $C$DW$268       .dwtag  DW_TAG_enumerator, DW_AT_name("eReady"), DW_AT_const_value(0x01)
    3778                            .dwattr $C$DW$268, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/includ
    3779                            .dwattr $C$DW$268, DW_AT_decl_line(0x91)
    3780                            .dwattr $C$DW$268, DW_AT_decl_column(0x02)
    3781                    $C$DW$269       .dwtag  DW_TAG_enumerator, DW_AT_name("eBlocked"), DW_AT_const_value(0x02)
    3782                            .dwattr $C$DW$269, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/includ
    3783                            .dwattr $C$DW$269, DW_AT_decl_line(0x92)
    3784                            .dwattr $C$DW$269, DW_AT_decl_column(0x02)
    3785                    $C$DW$270       .dwtag  DW_TAG_enumerator, DW_AT_name("eSuspended"), DW_AT_const_value(0x03)
    3786                            .dwattr $C$DW$270, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/includ
    3787                            .dwattr $C$DW$270, DW_AT_decl_line(0x93)
    3788                            .dwattr $C$DW$270, DW_AT_decl_column(0x02)
    3789                    $C$DW$271       .dwtag  DW_TAG_enumerator, DW_AT_name("eDeleted"), DW_AT_const_value(0x04)
    3790                            .dwattr $C$DW$271, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/includ
    3791                            .dwattr $C$DW$271, DW_AT_decl_line(0x94)
    3792                            .dwattr $C$DW$271, DW_AT_decl_column(0x02)
    3793                            .dwendtag $C$DW$T$52
    3794                    
    3795                            .dwattr $C$DW$T$52, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    3796                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x8f)
    3797                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
    3798                    $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("eTaskState")
    3799                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    3800                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    3801                            .dwattr $C$DW$T$53, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    3802                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x95)
    3803                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x03)
    3804                    
    3805                    $C$DW$T$54      .dwtag  DW_TAG_enumeration_type
    3806                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
    3807                    $C$DW$272       .dwtag  DW_TAG_enumerator, DW_AT_name("eAbortSleep"), DW_AT_const_value(0x00)
    3808                            .dwattr $C$DW$272, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/includ
    3809                            .dwattr $C$DW$272, DW_AT_decl_line(0x9a)
    3810                            .dwattr $C$DW$272, DW_AT_decl_column(0x02)
    3811                    $C$DW$273       .dwtag  DW_TAG_enumerator, DW_AT_name("eStandardSleep"), DW_AT_const_value(0x01)
    3812                            .dwattr $C$DW$273, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/includ
    3813                            .dwattr $C$DW$273, DW_AT_decl_line(0x9b)
    3814                            .dwattr $C$DW$273, DW_AT_decl_column(0x02)
    3815                    $C$DW$274       .dwtag  DW_TAG_enumerator, DW_AT_name("eNoTasksWaitingTimeout"), DW_AT_const_value(0x0
    3816                            .dwattr $C$DW$274, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/includ
    3817                            .dwattr $C$DW$274, DW_AT_decl_line(0x9c)
    3818                            .dwattr $C$DW$274, DW_AT_decl_column(0x02)
    3819                            .dwendtag $C$DW$T$54
    3820                    
    3821                            .dwattr $C$DW$T$54, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    3822                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x99)
    3823                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
    3824                    $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("eSleepModeStatus")
    3825                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    3826                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3827                            .dwattr $C$DW$T$55, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    3828                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x9d)
    3829                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x03)
    3830                    
    3831                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
tasks.asm                                                            PAGE   71

    3832                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x18)
    3833                    $C$DW$275       .dwtag  DW_TAG_member
    3834                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$10)
    3835                            .dwattr $C$DW$275, DW_AT_name("fd")
    3836                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("fd")
    3837                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3838                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3839                            .dwattr $C$DW$275, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    3840                            .dwattr $C$DW$275, DW_AT_decl_line(0x5b)
    3841                            .dwattr $C$DW$275, DW_AT_decl_column(0x0b)
    3842                    $C$DW$276       .dwtag  DW_TAG_member
    3843                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    3844                            .dwattr $C$DW$276, DW_AT_name("buf")
    3845                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("buf")
    3846                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3847                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3848                            .dwattr $C$DW$276, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    3849                            .dwattr $C$DW$276, DW_AT_decl_line(0x5c)
    3850                            .dwattr $C$DW$276, DW_AT_decl_column(0x16)
    3851                    $C$DW$277       .dwtag  DW_TAG_member
    3852                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    3853                            .dwattr $C$DW$277, DW_AT_name("pos")
    3854                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("pos")
    3855                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3856                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3857                            .dwattr $C$DW$277, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    3858                            .dwattr $C$DW$277, DW_AT_decl_line(0x5d)
    3859                            .dwattr $C$DW$277, DW_AT_decl_column(0x16)
    3860                    $C$DW$278       .dwtag  DW_TAG_member
    3861                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    3862                            .dwattr $C$DW$278, DW_AT_name("bufend")
    3863                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("bufend")
    3864                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3865                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3866                            .dwattr $C$DW$278, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    3867                            .dwattr $C$DW$278, DW_AT_decl_line(0x5e)
    3868                            .dwattr $C$DW$278, DW_AT_decl_column(0x16)
    3869                    $C$DW$279       .dwtag  DW_TAG_member
    3870                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$19)
    3871                            .dwattr $C$DW$279, DW_AT_name("buff_stop")
    3872                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("buff_stop")
    3873                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3874                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3875                            .dwattr $C$DW$279, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    3876                            .dwattr $C$DW$279, DW_AT_decl_line(0x5f)
    3877                            .dwattr $C$DW$279, DW_AT_decl_column(0x16)
    3878                    $C$DW$280       .dwtag  DW_TAG_member
    3879                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$11)
    3880                            .dwattr $C$DW$280, DW_AT_name("flags")
    3881                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("flags")
    3882                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3883                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3884                            .dwattr $C$DW$280, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    3885                            .dwattr $C$DW$280, DW_AT_decl_line(0x60)
    3886                            .dwattr $C$DW$280, DW_AT_decl_column(0x16)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
tasks.asm                                                            PAGE   72

    3887                            .dwendtag $C$DW$T$20
    3888                    
    3889                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    3890                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x5a)
    3891                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    3892                    $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    3893                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$20)
    3894                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3895                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    3896                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x61)
    3897                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x03)
    3898                    
    3899                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    3900                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x08)
    3901                    $C$DW$281       .dwtag  DW_TAG_member
    3902                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$10)
    3903                            .dwattr $C$DW$281, DW_AT_name("quot")
    3904                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("quot")
    3905                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3906                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3907                            .dwattr $C$DW$281, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    3908                            .dwattr $C$DW$281, DW_AT_decl_line(0x50)
    3909                            .dwattr $C$DW$281, DW_AT_decl_column(0x16)
    3910                    $C$DW$282       .dwtag  DW_TAG_member
    3911                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$10)
    3912                            .dwattr $C$DW$282, DW_AT_name("rem")
    3913                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("rem")
    3914                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3915                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3916                            .dwattr $C$DW$282, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    3917                            .dwattr $C$DW$282, DW_AT_decl_line(0x50)
    3918                            .dwattr $C$DW$282, DW_AT_decl_column(0x1c)
    3919                            .dwendtag $C$DW$T$21
    3920                    
    3921                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    3922                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x50)
    3923                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    3924                    $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    3925                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$21)
    3926                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    3927                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    3928                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x50)
    3929                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x23)
    3930                    
    3931                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3932                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
    3933                    $C$DW$283       .dwtag  DW_TAG_member
    3934                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$10)
    3935                            .dwattr $C$DW$283, DW_AT_name("quot")
    3936                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("quot")
    3937                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3938                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3939                            .dwattr $C$DW$283, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    3940                            .dwattr $C$DW$283, DW_AT_decl_line(0x52)
    3941                            .dwattr $C$DW$283, DW_AT_decl_column(0x16)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
tasks.asm                                                            PAGE   73

    3942                    $C$DW$284       .dwtag  DW_TAG_member
    3943                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$10)
    3944                            .dwattr $C$DW$284, DW_AT_name("rem")
    3945                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("rem")
    3946                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3947                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3948                            .dwattr $C$DW$284, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    3949                            .dwattr $C$DW$284, DW_AT_decl_line(0x52)
    3950                            .dwattr $C$DW$284, DW_AT_decl_column(0x1c)
    3951                            .dwendtag $C$DW$T$22
    3952                    
    3953                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    3954                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x52)
    3955                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    3956                    $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    3957                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$22)
    3958                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    3959                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    3960                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x52)
    3961                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x23)
    3962                    
    3963                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3964                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x10)
    3965                    $C$DW$285       .dwtag  DW_TAG_member
    3966                            .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$14)
    3967                            .dwattr $C$DW$285, DW_AT_name("quot")
    3968                            .dwattr $C$DW$285, DW_AT_TI_symbol_name("quot")
    3969                            .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3970                            .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3971                            .dwattr $C$DW$285, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    3972                            .dwattr $C$DW$285, DW_AT_decl_line(0x55)
    3973                            .dwattr $C$DW$285, DW_AT_decl_column(0x1c)
    3974                    $C$DW$286       .dwtag  DW_TAG_member
    3975                            .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$14)
    3976                            .dwattr $C$DW$286, DW_AT_name("rem")
    3977                            .dwattr $C$DW$286, DW_AT_TI_symbol_name("rem")
    3978                            .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3979                            .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3980                            .dwattr $C$DW$286, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    3981                            .dwattr $C$DW$286, DW_AT_decl_line(0x55)
    3982                            .dwattr $C$DW$286, DW_AT_decl_column(0x22)
    3983                            .dwendtag $C$DW$T$23
    3984                    
    3985                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    3986                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x55)
    3987                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
    3988                    $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    3989                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$23)
    3990                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    3991                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    3992                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x55)
    3993                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x29)
    3994                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3995                            .dwattr $C$DW$T$2, DW_AT_name("void")
    3996                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
tasks.asm                                                            PAGE   74

    3997                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3998                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3999                    $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskHandle")
    4000                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$3)
    4001                            .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    4002                            .dwattr $C$DW$T$66, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    4003                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x6a)
    4004                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x10)
    4005                    $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    4006                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    4007                            .dwattr $C$DW$T$67, DW_AT_address_class(0x20)
    4008                    $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("xTimerHandle")
    4009                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$3)
    4010                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    4011                            .dwattr $C$DW$T$68, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    4012                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x6d)
    4013                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x10)
    4014                    
    4015                    $C$DW$T$42      .dwtag  DW_TAG_subroutine_type
    4016                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4017                    $C$DW$287       .dwtag  DW_TAG_formal_parameter
    4018                            .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$3)
    4019                            .dwendtag $C$DW$T$42
    4020                    
    4021                    $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    4022                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4023                            .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    4024                    $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_CODE")
    4025                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    4026                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4027                            .dwattr $C$DW$T$44, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
    4028                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x4f)
    4029                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    4030                    
    4031                    $C$DW$T$103     .dwtag  DW_TAG_subroutine_type
    4032                            .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    4033                    $C$DW$288       .dwtag  DW_TAG_formal_parameter
    4034                            .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$68)
    4035                            .dwendtag $C$DW$T$103
    4036                    
    4037                    $C$DW$T$104     .dwtag  DW_TAG_pointer_type
    4038                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
    4039                            .dwattr $C$DW$T$104, DW_AT_address_class(0x20)
    4040                    $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("tmrTIMER_CALLBACK")
    4041                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
    4042                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    4043                            .dwattr $C$DW$T$105, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/incl
    4044                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x70)
    4045                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x10)
    4046                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    4047                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4048                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    4049                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4050                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    4051                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
tasks.asm                                                            PAGE   75

    4052                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4053                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4054                    
    4055                    $C$DW$T$29      .dwtag  DW_TAG_array_type
    4056                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$5)
    4057                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    4058                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x10)
    4059                    $C$DW$289       .dwtag  DW_TAG_subrange_type
    4060                            .dwattr $C$DW$289, DW_AT_upper_bound(0x0f)
    4061                            .dwendtag $C$DW$T$29
    4062                    
    4063                    $C$DW$T$45      .dwtag  DW_TAG_const_type
    4064                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$5)
    4065                    $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    4066                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    4067                            .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    4068                    $C$DW$T$47      .dwtag  DW_TAG_const_type
    4069                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4070                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    4071                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4072                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4073                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4074                    $C$DW$T$19      .dwtag  DW_TAG_pointer_type
    4075                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
    4076                            .dwattr $C$DW$T$19, DW_AT_address_class(0x20)
    4077                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    4078                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4079                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4080                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    4081                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    4082                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4083                            .dwattr $C$DW$T$8, DW_AT_name("short")
    4084                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    4085                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    4086                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4087                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4088                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    4089                    $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    4090                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$9)
    4091                            .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    4092                            .dwattr $C$DW$T$108, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/includ
    4093                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x6a)
    4094                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x1a)
    4095                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    4096                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4097                            .dwattr $C$DW$T$10, DW_AT_name("int")
    4098                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    4099                    $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
    4100                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$10)
    4101                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    4102                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/includ
    4103                            .dwattr $C$DW$T$109, DW_AT_decl_line(0x31)
    4104                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x1c)
    4105                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    4106                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
tasks.asm                                                            PAGE   76

    4107                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    4108                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    4109                    $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    4110                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$11)
    4111                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    4112                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    4113                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x57)
    4114                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x19)
    4115                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    4116                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    4117                            .dwattr $C$DW$T$12, DW_AT_name("long")
    4118                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    4119                    $C$DW$T$116     .dwtag  DW_TAG_volatile_type
    4120                            .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$12)
    4121                    
    4122                    $C$DW$T$117     .dwtag  DW_TAG_subroutine_type
    4123                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$12)
    4124                            .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    4125                    $C$DW$290       .dwtag  DW_TAG_formal_parameter
    4126                            .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$3)
    4127                            .dwendtag $C$DW$T$117
    4128                    
    4129                    $C$DW$T$118     .dwtag  DW_TAG_pointer_type
    4130                            .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$117)
    4131                            .dwattr $C$DW$T$118, DW_AT_address_class(0x20)
    4132                    $C$DW$T$119     .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_HOOK_CODE")
    4133                            .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    4134                            .dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
    4135                            .dwattr $C$DW$T$119, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/incl
    4136                            .dwattr $C$DW$T$119, DW_AT_decl_line(0x66)
    4137                            .dwattr $C$DW$T$119, DW_AT_decl_column(0x19)
    4138                    $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    4139                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$12)
    4140                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    4141                            .dwattr $C$DW$T$120, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/includ
    4142                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x6d)
    4143                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x0e)
    4144                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    4145                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    4146                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    4147                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    4148                    $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    4149                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$13)
    4150                    $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    4151                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    4152                            .dwattr $C$DW$T$26, DW_AT_address_class(0x20)
    4153                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    4154                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$13)
    4155                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    4156                    $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    4157                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$13)
    4158                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4159                            .dwattr $C$DW$T$36, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
    4160                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x6a)
    4161                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x1c)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
tasks.asm                                                            PAGE   77

    4162                    $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    4163                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$36)
    4164                            .dwattr $C$DW$T$82, DW_AT_address_class(0x20)
    4165                    $C$DW$T$83      .dwtag  DW_TAG_const_type
    4166                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    4167                    $C$DW$T$128     .dwtag  DW_TAG_volatile_type
    4168                            .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$36)
    4169                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    4170                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    4171                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    4172                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    4173                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    4174                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    4175                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    4176                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    4177                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    4178                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    4179                            .dwattr $C$DW$T$16, DW_AT_name("float")
    4180                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    4181                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    4182                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    4183                            .dwattr $C$DW$T$17, DW_AT_name("double")
    4184                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    4185                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    4186                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    4187                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    4188                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    4189                    $C$DW$T$129     .dwtag  DW_TAG_base_type
    4190                            .dwattr $C$DW$T$129, DW_AT_encoding(DW_ATE_unsigned_char)
    4191                            .dwattr $C$DW$T$129, DW_AT_name("unsigned char")
    4192                            .dwattr $C$DW$T$129, DW_AT_byte_size(0x01)
    4193                    $C$DW$T$130     .dwtag  DW_TAG_pointer_type
    4194                            .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$129)
    4195                            .dwattr $C$DW$T$130, DW_AT_address_class(0x20)
    4196                    $C$DW$T$131     .dwtag  DW_TAG_const_type
    4197                            .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$129)
    4198                    $C$DW$T$132     .dwtag  DW_TAG_pointer_type
    4199                            .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$131)
    4200                            .dwattr $C$DW$T$132, DW_AT_address_class(0x20)
    4201                    
    4202                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    4203                            .dwattr $C$DW$T$24, DW_AT_name("__va_list")
    4204                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    4205                    $C$DW$291       .dwtag  DW_TAG_member
    4206                            .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$3)
    4207                            .dwattr $C$DW$291, DW_AT_name("__ap")
    4208                            .dwattr $C$DW$291, DW_AT_TI_symbol_name("__ap")
    4209                            .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4210                            .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    4211                            .dwattr $C$DW$291, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/
    4212                            .dwattr $C$DW$291, DW_AT_decl_line(0x32)
    4213                            .dwattr $C$DW$291, DW_AT_decl_column(0x0c)
    4214                            .dwendtag $C$DW$T$24
    4215                    
    4216                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
tasks.asm                                                            PAGE   78

    4217                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x31)
    4218                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    4219                    $C$DW$T$135     .dwtag  DW_TAG_typedef, DW_AT_name("va_list")
    4220                            .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$24)
    4221                            .dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
    4222                            .dwattr $C$DW$T$135, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/includ
    4223                            .dwattr $C$DW$T$135, DW_AT_decl_line(0x33)
    4224                            .dwattr $C$DW$T$135, DW_AT_decl_column(0x03)
    4225                    
    4226                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    4227                            .dwattr $C$DW$T$30, DW_AT_name("tskTaskControlBlock")
    4228                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x44)
    4229                    $C$DW$292       .dwtag  DW_TAG_member
    4230                            .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$26)
    4231                            .dwattr $C$DW$292, DW_AT_name("pxTopOfStack")
    4232                            .dwattr $C$DW$292, DW_AT_TI_symbol_name("pxTopOfStack")
    4233                            .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4234                            .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    4235                            .dwattr $C$DW$292, DW_AT_decl_file("../Source/tasks.c")
    4236                            .dwattr $C$DW$292, DW_AT_decl_line(0x70)
    4237                            .dwattr $C$DW$292, DW_AT_decl_column(0x1b)
    4238                    $C$DW$293       .dwtag  DW_TAG_member
    4239                            .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$27)
    4240                            .dwattr $C$DW$293, DW_AT_name("xGenericListItem")
    4241                            .dwattr $C$DW$293, DW_AT_TI_symbol_name("xGenericListItem")
    4242                            .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4243                            .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    4244                            .dwattr $C$DW$293, DW_AT_decl_file("../Source/tasks.c")
    4245                            .dwattr $C$DW$293, DW_AT_decl_line(0x76)
    4246                            .dwattr $C$DW$293, DW_AT_decl_column(0x0f)
    4247                    $C$DW$294       .dwtag  DW_TAG_member
    4248                            .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$27)
    4249                            .dwattr $C$DW$294, DW_AT_name("xEventListItem")
    4250                            .dwattr $C$DW$294, DW_AT_TI_symbol_name("xEventListItem")
    4251                            .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4252                            .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    4253                            .dwattr $C$DW$294, DW_AT_decl_file("../Source/tasks.c")
    4254                            .dwattr $C$DW$294, DW_AT_decl_line(0x77)
    4255                            .dwattr $C$DW$294, DW_AT_decl_column(0x0f)
    4256                    $C$DW$295       .dwtag  DW_TAG_member
    4257                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$13)
    4258                            .dwattr $C$DW$295, DW_AT_name("uxPriority")
    4259                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("uxPriority")
    4260                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4261                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    4262                            .dwattr $C$DW$295, DW_AT_decl_file("../Source/tasks.c")
    4263                            .dwattr $C$DW$295, DW_AT_decl_line(0x78)
    4264                            .dwattr $C$DW$295, DW_AT_decl_column(0x19)
    4265                    $C$DW$296       .dwtag  DW_TAG_member
    4266                            .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$28)
    4267                            .dwattr $C$DW$296, DW_AT_name("pxStack")
    4268                            .dwattr $C$DW$296, DW_AT_TI_symbol_name("pxStack")
    4269                            .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4270                            .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    4271                            .dwattr $C$DW$296, DW_AT_decl_file("../Source/tasks.c")
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
tasks.asm                                                            PAGE   79

    4272                            .dwattr $C$DW$296, DW_AT_decl_line(0x79)
    4273                            .dwattr $C$DW$296, DW_AT_decl_column(0x14)
    4274                    $C$DW$297       .dwtag  DW_TAG_member
    4275                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$29)
    4276                            .dwattr $C$DW$297, DW_AT_name("pcTaskName")
    4277                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("pcTaskName")
    4278                            .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4279                            .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    4280                            .dwattr $C$DW$297, DW_AT_decl_file("../Source/tasks.c")
    4281                            .dwattr $C$DW$297, DW_AT_decl_line(0x7a)
    4282                            .dwattr $C$DW$297, DW_AT_decl_column(0x11)
    4283                            .dwendtag $C$DW$T$30
    4284                    
    4285                            .dwattr $C$DW$T$30, DW_AT_decl_file("../Source/tasks.c")
    4286                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x6e)
    4287                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    4288                    $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("tskTCB")
    4289                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$30)
    4290                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    4291                            .dwattr $C$DW$T$96, DW_AT_decl_file("../Source/tasks.c")
    4292                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x95)
    4293                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x03)
    4294                    $C$DW$T$97      .dwtag  DW_TAG_pointer_type
    4295                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    4296                            .dwattr $C$DW$T$97, DW_AT_address_class(0x20)
    4297                    $C$DW$T$138     .dwtag  DW_TAG_volatile_type
    4298                            .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$97)
    4299                    
    4300                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4301                            .dwattr $C$DW$T$35, DW_AT_name("xLIST")
    4302                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x14)
    4303                    $C$DW$298       .dwtag  DW_TAG_member
    4304                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$25)
    4305                            .dwattr $C$DW$298, DW_AT_name("uxNumberOfItems")
    4306                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("uxNumberOfItems")
    4307                            .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4308                            .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    4309                            .dwattr $C$DW$298, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\includ
    4310                            .dwattr $C$DW$298, DW_AT_decl_line(0x88)
    4311                            .dwattr $C$DW$298, DW_AT_decl_column(0x22)
    4312                    $C$DW$299       .dwtag  DW_TAG_member
    4313                            .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$32)
    4314                            .dwattr $C$DW$299, DW_AT_name("pxIndex")
    4315                            .dwattr $C$DW$299, DW_AT_TI_symbol_name("pxIndex")
    4316                            .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4317                            .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4318                            .dwattr $C$DW$299, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\includ
    4319                            .dwattr $C$DW$299, DW_AT_decl_line(0x89)
    4320                            .dwattr $C$DW$299, DW_AT_decl_column(0x17)
    4321                    $C$DW$300       .dwtag  DW_TAG_member
    4322                            .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$34)
    4323                            .dwattr $C$DW$300, DW_AT_name("xListEnd")
    4324                            .dwattr $C$DW$300, DW_AT_TI_symbol_name("xListEnd")
    4325                            .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4326                            .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
tasks.asm                                                            PAGE   80

    4327                            .dwattr $C$DW$300, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\includ
    4328                            .dwattr $C$DW$300, DW_AT_decl_line(0x8a)
    4329                            .dwattr $C$DW$300, DW_AT_decl_column(0x19)
    4330                            .dwendtag $C$DW$T$35
    4331                    
    4332                            .dwattr $C$DW$T$35, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
    4333                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x86)
    4334                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    4335                    $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    4336                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$35)
    4337                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    4338                            .dwattr $C$DW$T$73, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
    4339                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x8b)
    4340                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    4341                    $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    4342                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    4343                            .dwattr $C$DW$T$74, DW_AT_address_class(0x20)
    4344                    $C$DW$T$139     .dwtag  DW_TAG_volatile_type
    4345                            .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$74)
    4346                    $C$DW$T$140     .dwtag  DW_TAG_const_type
    4347                            .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$74)
    4348                    
    4349                    $C$DW$T$141     .dwtag  DW_TAG_array_type
    4350                            .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$73)
    4351                            .dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
    4352                            .dwattr $C$DW$T$141, DW_AT_byte_size(0x28)
    4353                    $C$DW$301       .dwtag  DW_TAG_subrange_type
    4354                            .dwattr $C$DW$301, DW_AT_upper_bound(0x01)
    4355                            .dwendtag $C$DW$T$141
    4356                    
    4357                    $C$DW$T$87      .dwtag  DW_TAG_const_type
    4358                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$73)
    4359                    $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    4360                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    4361                            .dwattr $C$DW$T$88, DW_AT_address_class(0x20)
    4362                    $C$DW$T$89      .dwtag  DW_TAG_const_type
    4363                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    4364                    
    4365                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4366                            .dwattr $C$DW$T$39, DW_AT_name("xLIST_ITEM")
    4367                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    4368                    $C$DW$302       .dwtag  DW_TAG_member
    4369                            .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$36)
    4370                            .dwattr $C$DW$302, DW_AT_name("xItemValue")
    4371                            .dwattr $C$DW$302, DW_AT_TI_symbol_name("xItemValue")
    4372                            .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4373                            .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    4374                            .dwattr $C$DW$302, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\includ
    4375                            .dwattr $C$DW$302, DW_AT_decl_line(0x73)
    4376                            .dwattr $C$DW$302, DW_AT_decl_column(0x0f)
    4377                    $C$DW$303       .dwtag  DW_TAG_member
    4378                            .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$38)
    4379                            .dwattr $C$DW$303, DW_AT_name("pxNext")
    4380                            .dwattr $C$DW$303, DW_AT_TI_symbol_name("pxNext")
    4381                            .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
tasks.asm                                                            PAGE   81

    4382                            .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    4383                            .dwattr $C$DW$303, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\includ
    4384                            .dwattr $C$DW$303, DW_AT_decl_line(0x74)
    4385                            .dwattr $C$DW$303, DW_AT_decl_column(0x1f)
    4386                    $C$DW$304       .dwtag  DW_TAG_member
    4387                            .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$38)
    4388                            .dwattr $C$DW$304, DW_AT_name("pxPrevious")
    4389                            .dwattr $C$DW$304, DW_AT_TI_symbol_name("pxPrevious")
    4390                            .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4391                            .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    4392                            .dwattr $C$DW$304, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\includ
    4393                            .dwattr $C$DW$304, DW_AT_decl_line(0x75)
    4394                            .dwattr $C$DW$304, DW_AT_decl_column(0x1f)
    4395                    $C$DW$305       .dwtag  DW_TAG_member
    4396                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$3)
    4397                            .dwattr $C$DW$305, DW_AT_name("pvOwner")
    4398                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("pvOwner")
    4399                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4400                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    4401                            .dwattr $C$DW$305, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\includ
    4402                            .dwattr $C$DW$305, DW_AT_decl_line(0x76)
    4403                            .dwattr $C$DW$305, DW_AT_decl_column(0x09)
    4404                    $C$DW$306       .dwtag  DW_TAG_member
    4405                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$3)
    4406                            .dwattr $C$DW$306, DW_AT_name("pvContainer")
    4407                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("pvContainer")
    4408                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4409                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    4410                            .dwattr $C$DW$306, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\includ
    4411                            .dwattr $C$DW$306, DW_AT_decl_line(0x77)
    4412                            .dwattr $C$DW$306, DW_AT_decl_column(0x09)
    4413                            .dwendtag $C$DW$T$39
    4414                    
    4415                            .dwattr $C$DW$T$39, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
    4416                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x71)
    4417                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x08)
    4418                    $C$DW$T$37      .dwtag  DW_TAG_volatile_type
    4419                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$39)
    4420                    $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    4421                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4422                            .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
    4423                    $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    4424                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$39)
    4425                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    4426                            .dwattr $C$DW$T$27, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
    4427                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x79)
    4428                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x1b)
    4429                    $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    4430                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$27)
    4431                            .dwattr $C$DW$T$77, DW_AT_address_class(0x20)
    4432                    $C$DW$T$31      .dwtag  DW_TAG_volatile_type
    4433                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$27)
    4434                    $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    4435                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    4436                            .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
tasks.asm                                                            PAGE   82

    4437                    
    4438                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4439                            .dwattr $C$DW$T$40, DW_AT_name("xMEMORY_REGION")
    4440                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    4441                    $C$DW$307       .dwtag  DW_TAG_member
    4442                            .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$3)
    4443                            .dwattr $C$DW$307, DW_AT_name("pvBaseAddress")
    4444                            .dwattr $C$DW$307, DW_AT_TI_symbol_name("pvBaseAddress")
    4445                            .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4446                            .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    4447                            .dwattr $C$DW$307, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/includ
    4448                            .dwattr $C$DW$307, DW_AT_decl_line(0x7a)
    4449                            .dwattr $C$DW$307, DW_AT_decl_column(0x08)
    4450                    $C$DW$308       .dwtag  DW_TAG_member
    4451                            .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$13)
    4452                            .dwattr $C$DW$308, DW_AT_name("ulLengthInBytes")
    4453                            .dwattr $C$DW$308, DW_AT_TI_symbol_name("ulLengthInBytes")
    4454                            .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4455                            .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    4456                            .dwattr $C$DW$308, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/includ
    4457                            .dwattr $C$DW$308, DW_AT_decl_line(0x7b)
    4458                            .dwattr $C$DW$308, DW_AT_decl_column(0x10)
    4459                    $C$DW$309       .dwtag  DW_TAG_member
    4460                            .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$13)
    4461                            .dwattr $C$DW$309, DW_AT_name("ulParameters")
    4462                            .dwattr $C$DW$309, DW_AT_TI_symbol_name("ulParameters")
    4463                            .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4464                            .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    4465                            .dwattr $C$DW$309, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/includ
    4466                            .dwattr $C$DW$309, DW_AT_decl_line(0x7c)
    4467                            .dwattr $C$DW$309, DW_AT_decl_column(0x10)
    4468                            .dwendtag $C$DW$T$40
    4469                    
    4470                            .dwattr $C$DW$T$40, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    4471                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x78)
    4472                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    4473                    $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    4474                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$40)
    4475                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4476                            .dwattr $C$DW$T$48, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    4477                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x7d)
    4478                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x03)
    4479                    
    4480                    $C$DW$T$49      .dwtag  DW_TAG_array_type
    4481                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    4482                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4483                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x0c)
    4484                    $C$DW$310       .dwtag  DW_TAG_subrange_type
    4485                            .dwattr $C$DW$310, DW_AT_upper_bound(0x00)
    4486                            .dwendtag $C$DW$T$49
    4487                    
    4488                    $C$DW$T$98      .dwtag  DW_TAG_const_type
    4489                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$48)
    4490                    $C$DW$T$99      .dwtag  DW_TAG_pointer_type
    4491                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
tasks.asm                                                            PAGE   83

    4492                            .dwattr $C$DW$T$99, DW_AT_address_class(0x20)
    4493                    $C$DW$T$100     .dwtag  DW_TAG_const_type
    4494                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    4495                    
    4496                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4497                            .dwattr $C$DW$T$41, DW_AT_name("xMINI_LIST_ITEM")
    4498                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    4499                    $C$DW$311       .dwtag  DW_TAG_member
    4500                            .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$36)
    4501                            .dwattr $C$DW$311, DW_AT_name("xItemValue")
    4502                            .dwattr $C$DW$311, DW_AT_TI_symbol_name("xItemValue")
    4503                            .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4504                            .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    4505                            .dwattr $C$DW$311, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\includ
    4506                            .dwattr $C$DW$311, DW_AT_decl_line(0x7d)
    4507                            .dwattr $C$DW$311, DW_AT_decl_column(0x0f)
    4508                    $C$DW$312       .dwtag  DW_TAG_member
    4509                            .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$38)
    4510                            .dwattr $C$DW$312, DW_AT_name("pxNext")
    4511                            .dwattr $C$DW$312, DW_AT_TI_symbol_name("pxNext")
    4512                            .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4513                            .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    4514                            .dwattr $C$DW$312, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\includ
    4515                            .dwattr $C$DW$312, DW_AT_decl_line(0x7e)
    4516                            .dwattr $C$DW$312, DW_AT_decl_column(0x1e)
    4517                    $C$DW$313       .dwtag  DW_TAG_member
    4518                            .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$38)
    4519                            .dwattr $C$DW$313, DW_AT_name("pxPrevious")
    4520                            .dwattr $C$DW$313, DW_AT_TI_symbol_name("pxPrevious")
    4521                            .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4522                            .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    4523                            .dwattr $C$DW$313, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\includ
    4524                            .dwattr $C$DW$313, DW_AT_decl_line(0x7f)
    4525                            .dwattr $C$DW$313, DW_AT_decl_column(0x1e)
    4526                            .dwendtag $C$DW$T$41
    4527                    
    4528                            .dwattr $C$DW$T$41, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
    4529                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x7b)
    4530                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x08)
    4531                    $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    4532                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$41)
    4533                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4534                            .dwattr $C$DW$T$33, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
    4535                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x81)
    4536                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x20)
    4537                    $C$DW$T$34      .dwtag  DW_TAG_volatile_type
    4538                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4539                    
    4540                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    4541                            .dwattr $C$DW$T$50, DW_AT_name("xTASK_PARAMTERS")
    4542                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x24)
    4543                    $C$DW$314       .dwtag  DW_TAG_member
    4544                            .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$44)
    4545                            .dwattr $C$DW$314, DW_AT_name("pvTaskCode")
    4546                            .dwattr $C$DW$314, DW_AT_TI_symbol_name("pvTaskCode")
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
tasks.asm                                                            PAGE   84

    4547                            .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4548                            .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    4549                            .dwattr $C$DW$314, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/includ
    4550                            .dwattr $C$DW$314, DW_AT_decl_line(0x84)
    4551                            .dwattr $C$DW$314, DW_AT_decl_column(0x0e)
    4552                    $C$DW$315       .dwtag  DW_TAG_member
    4553                            .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$47)
    4554                            .dwattr $C$DW$315, DW_AT_name("pcName")
    4555                            .dwattr $C$DW$315, DW_AT_TI_symbol_name("pcName")
    4556                            .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4557                            .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    4558                            .dwattr $C$DW$315, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/includ
    4559                            .dwattr $C$DW$315, DW_AT_decl_line(0x85)
    4560                            .dwattr $C$DW$315, DW_AT_decl_column(0x1c)
    4561                    $C$DW$316       .dwtag  DW_TAG_member
    4562                            .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$9)
    4563                            .dwattr $C$DW$316, DW_AT_name("usStackDepth")
    4564                            .dwattr $C$DW$316, DW_AT_TI_symbol_name("usStackDepth")
    4565                            .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4566                            .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    4567                            .dwattr $C$DW$316, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/includ
    4568                            .dwattr $C$DW$316, DW_AT_decl_line(0x86)
    4569                            .dwattr $C$DW$316, DW_AT_decl_column(0x11)
    4570                    $C$DW$317       .dwtag  DW_TAG_member
    4571                            .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$3)
    4572                            .dwattr $C$DW$317, DW_AT_name("pvParameters")
    4573                            .dwattr $C$DW$317, DW_AT_TI_symbol_name("pvParameters")
    4574                            .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4575                            .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    4576                            .dwattr $C$DW$317, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/includ
    4577                            .dwattr $C$DW$317, DW_AT_decl_line(0x87)
    4578                            .dwattr $C$DW$317, DW_AT_decl_column(0x08)
    4579                    $C$DW$318       .dwtag  DW_TAG_member
    4580                            .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$13)
    4581                            .dwattr $C$DW$318, DW_AT_name("uxPriority")
    4582                            .dwattr $C$DW$318, DW_AT_TI_symbol_name("uxPriority")
    4583                            .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4584                            .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    4585                            .dwattr $C$DW$318, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/includ
    4586                            .dwattr $C$DW$318, DW_AT_decl_line(0x88)
    4587                            .dwattr $C$DW$318, DW_AT_decl_column(0x19)
    4588                    $C$DW$319       .dwtag  DW_TAG_member
    4589                            .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$28)
    4590                            .dwattr $C$DW$319, DW_AT_name("puxStackBuffer")
    4591                            .dwattr $C$DW$319, DW_AT_TI_symbol_name("puxStackBuffer")
    4592                            .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4593                            .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    4594                            .dwattr $C$DW$319, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/includ
    4595                            .dwattr $C$DW$319, DW_AT_decl_line(0x89)
    4596                            .dwattr $C$DW$319, DW_AT_decl_column(0x12)
    4597                    $C$DW$320       .dwtag  DW_TAG_member
    4598                            .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$49)
    4599                            .dwattr $C$DW$320, DW_AT_name("xRegions")
    4600                            .dwattr $C$DW$320, DW_AT_TI_symbol_name("xRegions")
    4601                            .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
tasks.asm                                                            PAGE   85

    4602                            .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    4603                            .dwattr $C$DW$320, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/includ
    4604                            .dwattr $C$DW$320, DW_AT_decl_line(0x8a)
    4605                            .dwattr $C$DW$320, DW_AT_decl_column(0x10)
    4606                            .dwendtag $C$DW$T$50
    4607                    
    4608                            .dwattr $C$DW$T$50, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    4609                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x82)
    4610                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    4611                    $C$DW$T$146     .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    4612                            .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$50)
    4613                            .dwattr $C$DW$T$146, DW_AT_language(DW_LANG_C)
    4614                            .dwattr $C$DW$T$146, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/incl
    4615                            .dwattr $C$DW$T$146, DW_AT_decl_line(0x8b)
    4616                            .dwattr $C$DW$T$146, DW_AT_decl_column(0x03)
    4617                    
    4618                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    4619                            .dwattr $C$DW$T$51, DW_AT_name("xTIME_OUT")
    4620                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x08)
    4621                    $C$DW$321       .dwtag  DW_TAG_member
    4622                            .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$12)
    4623                            .dwattr $C$DW$321, DW_AT_name("xOverflowCount")
    4624                            .dwattr $C$DW$321, DW_AT_TI_symbol_name("xOverflowCount")
    4625                            .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4626                            .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    4627                            .dwattr $C$DW$321, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/includ
    4628                            .dwattr $C$DW$321, DW_AT_decl_line(0x71)
    4629                            .dwattr $C$DW$321, DW_AT_decl_column(0x10)
    4630                    $C$DW$322       .dwtag  DW_TAG_member
    4631                            .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$36)
    4632                            .dwattr $C$DW$322, DW_AT_name("xTimeOnEntering")
    4633                            .dwattr $C$DW$322, DW_AT_TI_symbol_name("xTimeOnEntering")
    4634                            .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4635                            .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    4636                            .dwattr $C$DW$322, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/includ
    4637                            .dwattr $C$DW$322, DW_AT_decl_line(0x72)
    4638                            .dwattr $C$DW$322, DW_AT_decl_column(0x10)
    4639                            .dwendtag $C$DW$T$51
    4640                    
    4641                            .dwattr $C$DW$T$51, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    4642                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x6f)
    4643                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
    4644                    $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    4645                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$51)
    4646                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    4647                            .dwattr $C$DW$T$91, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    4648                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x73)
    4649                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x03)
    4650                    $C$DW$T$92      .dwtag  DW_TAG_pointer_type
    4651                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    4652                            .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
    4653                    $C$DW$T$93      .dwtag  DW_TAG_const_type
    4654                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    4655                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    4656                    
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
tasks.asm                                                            PAGE   86

    4657                    ;***************************************************************
    4658                    ;* DWARF CIE ENTRIES                                           *
    4659                    ;***************************************************************
    4660                    
    4661                    $C$DW$CIE       .dwcie 14
    4662                            .dwcfi  cfa_register, 13
    4663                            .dwcfi  cfa_offset, 0
    4664                            .dwcfi  undefined, 0
    4665                            .dwcfi  undefined, 1
    4666                            .dwcfi  undefined, 2
    4667                            .dwcfi  undefined, 3
    4668                            .dwcfi  same_value, 4
    4669                            .dwcfi  same_value, 5
    4670                            .dwcfi  same_value, 6
    4671                            .dwcfi  same_value, 7
    4672                            .dwcfi  same_value, 8
    4673                            .dwcfi  same_value, 9
    4674                            .dwcfi  same_value, 10
    4675                            .dwcfi  same_value, 11
    4676                            .dwcfi  undefined, 12
    4677                            .dwcfi  undefined, 13
    4678                            .dwcfi  undefined, 14
    4679                            .dwcfi  undefined, 14
    4680                            .dwcfi  undefined, 7
    4681                            .dwendentry
    4682                            .dwendtag $C$DW$CU
    4683                    

--------------------------
Thumb2 Statistics
--------------------------
Number of Thumb2 ins converted to Thumb = 0 (0%)
Number of Thumb ins in input = 740 (89%)
Number of Thumb2 ins encoded as Thumb2 = 90 (100%)
Number of Thumb2 ins converted to 2 OPND Thumb = 155


