TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
timers.asm                                                           PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.0.4 *
       3                    ;* Date/Time created: Mon Apr 21 10:17:51 2014                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --e
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Source/timers.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.0.4 Copyright (c) 1996-2013 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Debug")
      13                    ;       C:\TI_CodeComposer\ccsv5\tools\compiler\arm_5.0.4\bin\armacpia.exe -@C:\\Users\\llammers\\AppD
      14                    

     210                    $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
     211                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$11)
     212                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
     213                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
     214                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x35)
     215                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x19)
     216                    $C$DW$T$12      .dwtag  DW_TAG_base_type
     217                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     218                            .dwattr $C$DW$T$12, DW_AT_name("long")
     219                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
     220                    
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
timers.asm                                                           PAGE    5

     221                    $C$DW$T$58      .dwtag  DW_TAG_subroutine_type
     222                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$12)
     223                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
     224                    $C$DW$11        .dwtag  DW_TAG_formal_parameter
     225                            .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$3)
     226                            .dwendtag $C$DW$T$58
     227                    
     228                    $C$DW$T$59      .dwtag  DW_TAG_pointer_type
     229                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
     230                            .dwattr $C$DW$T$59, DW_AT_address_class(0x20)
     231                    $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_HOOK_CODE")
     232                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
     233                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
     234                            .dwattr $C$DW$T$60, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
     235                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x66)
     236                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x19)
     237                    $C$DW$T$13      .dwtag  DW_TAG_base_type
     238                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     239                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
     240                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
     241                    $C$DW$T$19      .dwtag  DW_TAG_volatile_type
     242                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$13)
     243                    $C$DW$T$38      .dwtag  DW_TAG_pointer_type
     244                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$13)
     245                            .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
     246                    $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
     247                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$13)
     248                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
     249                            .dwattr $C$DW$T$26, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
     250                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x6a)
     251                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x1c)
     252                    $C$DW$T$14      .dwtag  DW_TAG_base_type
     253                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
     254                            .dwattr $C$DW$T$14, DW_AT_name("long long")
     255                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
     256                    $C$DW$T$15      .dwtag  DW_TAG_base_type
     257                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
     258                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
     259                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
     260                    $C$DW$T$16      .dwtag  DW_TAG_base_type
     261                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
     262                            .dwattr $C$DW$T$16, DW_AT_name("float")
     263                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
     264                    $C$DW$T$17      .dwtag  DW_TAG_base_type
     265                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
     266                            .dwattr $C$DW$T$17, DW_AT_name("double")
     267                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
     268                    $C$DW$T$18      .dwtag  DW_TAG_base_type
     269                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
     270                            .dwattr $C$DW$T$18, DW_AT_name("long double")
     271                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
     272                    
     273                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
     274                            .dwattr $C$DW$T$25, DW_AT_name("xLIST")
     275                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x14)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
timers.asm                                                           PAGE    6

     276                    $C$DW$12        .dwtag  DW_TAG_member
     277                            .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     278                            .dwattr $C$DW$12, DW_AT_name("uxNumberOfItems")
     279                            .dwattr $C$DW$12, DW_AT_TI_symbol_name("uxNumberOfItems")
     280                            .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     281                            .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     282                            .dwattr $C$DW$12, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     283                            .dwattr $C$DW$12, DW_AT_decl_line(0x88)
     284                            .dwattr $C$DW$12, DW_AT_decl_column(0x22)
     285                    $C$DW$13        .dwtag  DW_TAG_member
     286                            .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$22)
     287                            .dwattr $C$DW$13, DW_AT_name("pxIndex")
     288                            .dwattr $C$DW$13, DW_AT_TI_symbol_name("pxIndex")
     289                            .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     290                            .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     291                            .dwattr $C$DW$13, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     292                            .dwattr $C$DW$13, DW_AT_decl_line(0x89)
     293                            .dwattr $C$DW$13, DW_AT_decl_column(0x17)
     294                    $C$DW$14        .dwtag  DW_TAG_member
     295                            .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$24)
     296                            .dwattr $C$DW$14, DW_AT_name("xListEnd")
     297                            .dwattr $C$DW$14, DW_AT_TI_symbol_name("xListEnd")
     298                            .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     299                            .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     300                            .dwattr $C$DW$14, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     301                            .dwattr $C$DW$14, DW_AT_decl_line(0x8a)
     302                            .dwattr $C$DW$14, DW_AT_decl_column(0x19)
     303                            .dwendtag $C$DW$T$25
     304                    
     305                            .dwattr $C$DW$T$25, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
     306                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x86)
     307                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
     308                    $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
     309                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$25)
     310                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
     311                            .dwattr $C$DW$T$61, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
     312                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x8b)
     313                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
     314                    
     315                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
     316                            .dwattr $C$DW$T$29, DW_AT_name("xLIST_ITEM")
     317                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x14)
     318                    $C$DW$15        .dwtag  DW_TAG_member
     319                            .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$26)
     320                            .dwattr $C$DW$15, DW_AT_name("xItemValue")
     321                            .dwattr $C$DW$15, DW_AT_TI_symbol_name("xItemValue")
     322                            .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     323                            .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     324                            .dwattr $C$DW$15, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     325                            .dwattr $C$DW$15, DW_AT_decl_line(0x73)
     326                            .dwattr $C$DW$15, DW_AT_decl_column(0x0f)
     327                    $C$DW$16        .dwtag  DW_TAG_member
     328                            .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$28)
     329                            .dwattr $C$DW$16, DW_AT_name("pxNext")
     330                            .dwattr $C$DW$16, DW_AT_TI_symbol_name("pxNext")
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
timers.asm                                                           PAGE    7

     331                            .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     332                            .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     333                            .dwattr $C$DW$16, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     334                            .dwattr $C$DW$16, DW_AT_decl_line(0x74)
     335                            .dwattr $C$DW$16, DW_AT_decl_column(0x1f)
     336                    $C$DW$17        .dwtag  DW_TAG_member
     337                            .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$28)
     338                            .dwattr $C$DW$17, DW_AT_name("pxPrevious")
     339                            .dwattr $C$DW$17, DW_AT_TI_symbol_name("pxPrevious")
     340                            .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     341                            .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     342                            .dwattr $C$DW$17, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     343                            .dwattr $C$DW$17, DW_AT_decl_line(0x75)
     344                            .dwattr $C$DW$17, DW_AT_decl_column(0x1f)
     345                    $C$DW$18        .dwtag  DW_TAG_member
     346                            .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$3)
     347                            .dwattr $C$DW$18, DW_AT_name("pvOwner")
     348                            .dwattr $C$DW$18, DW_AT_TI_symbol_name("pvOwner")
     349                            .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     350                            .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     351                            .dwattr $C$DW$18, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     352                            .dwattr $C$DW$18, DW_AT_decl_line(0x76)
     353                            .dwattr $C$DW$18, DW_AT_decl_column(0x09)
     354                    $C$DW$19        .dwtag  DW_TAG_member
     355                            .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$3)
     356                            .dwattr $C$DW$19, DW_AT_name("pvContainer")
     357                            .dwattr $C$DW$19, DW_AT_TI_symbol_name("pvContainer")
     358                            .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     359                            .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     360                            .dwattr $C$DW$19, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     361                            .dwattr $C$DW$19, DW_AT_decl_line(0x77)
     362                            .dwattr $C$DW$19, DW_AT_decl_column(0x09)
     363                            .dwendtag $C$DW$T$29
     364                    
     365                            .dwattr $C$DW$T$29, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
     366                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x71)
     367                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x08)
     368                    $C$DW$T$27      .dwtag  DW_TAG_volatile_type
     369                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$29)
     370                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
     371                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
     372                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
     373                    $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
     374                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$29)
     375                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
     376                            .dwattr $C$DW$T$20, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
     377                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x79)
     378                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x1b)
     379                    $C$DW$T$21      .dwtag  DW_TAG_volatile_type
     380                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
     381                    $C$DW$T$22      .dwtag  DW_TAG_pointer_type
     382                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     383                            .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
     384                    
     385                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
timers.asm                                                           PAGE    8

     386                            .dwattr $C$DW$T$30, DW_AT_name("xMEMORY_REGION")
     387                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x0c)
     388                    $C$DW$20        .dwtag  DW_TAG_member
     389                            .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$3)
     390                            .dwattr $C$DW$20, DW_AT_name("pvBaseAddress")
     391                            .dwattr $C$DW$20, DW_AT_TI_symbol_name("pvBaseAddress")
     392                            .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     393                            .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     394                            .dwattr $C$DW$20, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     395                            .dwattr $C$DW$20, DW_AT_decl_line(0x7a)
     396                            .dwattr $C$DW$20, DW_AT_decl_column(0x08)
     397                    $C$DW$21        .dwtag  DW_TAG_member
     398                            .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$13)
     399                            .dwattr $C$DW$21, DW_AT_name("ulLengthInBytes")
     400                            .dwattr $C$DW$21, DW_AT_TI_symbol_name("ulLengthInBytes")
     401                            .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     402                            .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     403                            .dwattr $C$DW$21, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     404                            .dwattr $C$DW$21, DW_AT_decl_line(0x7b)
     405                            .dwattr $C$DW$21, DW_AT_decl_column(0x10)
     406                    $C$DW$22        .dwtag  DW_TAG_member
     407                            .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$13)
     408                            .dwattr $C$DW$22, DW_AT_name("ulParameters")
     409                            .dwattr $C$DW$22, DW_AT_TI_symbol_name("ulParameters")
     410                            .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     411                            .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     412                            .dwattr $C$DW$22, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     413                            .dwattr $C$DW$22, DW_AT_decl_line(0x7c)
     414                            .dwattr $C$DW$22, DW_AT_decl_column(0x10)
     415                            .dwendtag $C$DW$T$30
     416                    
     417                            .dwattr $C$DW$T$30, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
     418                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x78)
     419                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
     420                    $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
     421                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$30)
     422                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
     423                            .dwattr $C$DW$T$39, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
     424                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x7d)
     425                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x03)
     426                    
     427                    $C$DW$T$40      .dwtag  DW_TAG_array_type
     428                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
     429                            .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
     430                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
     431                    $C$DW$23        .dwtag  DW_TAG_subrange_type
     432                            .dwattr $C$DW$23, DW_AT_upper_bound(0x00)
     433                            .dwendtag $C$DW$T$40
     434                    
     435                    
     436                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
     437                            .dwattr $C$DW$T$31, DW_AT_name("xMINI_LIST_ITEM")
     438                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x0c)
     439                    $C$DW$24        .dwtag  DW_TAG_member
     440                            .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$26)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
timers.asm                                                           PAGE    9

     441                            .dwattr $C$DW$24, DW_AT_name("xItemValue")
     442                            .dwattr $C$DW$24, DW_AT_TI_symbol_name("xItemValue")
     443                            .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     444                            .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     445                            .dwattr $C$DW$24, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     446                            .dwattr $C$DW$24, DW_AT_decl_line(0x7d)
     447                            .dwattr $C$DW$24, DW_AT_decl_column(0x0f)
     448                    $C$DW$25        .dwtag  DW_TAG_member
     449                            .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$28)
     450                            .dwattr $C$DW$25, DW_AT_name("pxNext")
     451                            .dwattr $C$DW$25, DW_AT_TI_symbol_name("pxNext")
     452                            .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     453                            .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     454                            .dwattr $C$DW$25, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     455                            .dwattr $C$DW$25, DW_AT_decl_line(0x7e)
     456                            .dwattr $C$DW$25, DW_AT_decl_column(0x1e)
     457                    $C$DW$26        .dwtag  DW_TAG_member
     458                            .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$28)
     459                            .dwattr $C$DW$26, DW_AT_name("pxPrevious")
     460                            .dwattr $C$DW$26, DW_AT_TI_symbol_name("pxPrevious")
     461                            .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     462                            .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     463                            .dwattr $C$DW$26, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     464                            .dwattr $C$DW$26, DW_AT_decl_line(0x7f)
     465                            .dwattr $C$DW$26, DW_AT_decl_column(0x1e)
     466                            .dwendtag $C$DW$T$31
     467                    
     468                            .dwattr $C$DW$T$31, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
     469                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x7b)
     470                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x08)
     471                    $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
     472                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$31)
     473                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     474                            .dwattr $C$DW$T$23, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
     475                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x81)
     476                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x20)
     477                    $C$DW$T$24      .dwtag  DW_TAG_volatile_type
     478                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     479                    
     480                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
     481                            .dwattr $C$DW$T$41, DW_AT_name("xTASK_PARAMTERS")
     482                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x24)
     483                    $C$DW$27        .dwtag  DW_TAG_member
     484                            .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$34)
     485                            .dwattr $C$DW$27, DW_AT_name("pvTaskCode")
     486                            .dwattr $C$DW$27, DW_AT_TI_symbol_name("pvTaskCode")
     487                            .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     488                            .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     489                            .dwattr $C$DW$27, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     490                            .dwattr $C$DW$27, DW_AT_decl_line(0x84)
     491                            .dwattr $C$DW$27, DW_AT_decl_column(0x0e)
     492                    $C$DW$28        .dwtag  DW_TAG_member
     493                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$37)
     494                            .dwattr $C$DW$28, DW_AT_name("pcName")
     495                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("pcName")
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
timers.asm                                                           PAGE   10

     496                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     497                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     498                            .dwattr $C$DW$28, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     499                            .dwattr $C$DW$28, DW_AT_decl_line(0x85)
     500                            .dwattr $C$DW$28, DW_AT_decl_column(0x1c)
     501                    $C$DW$29        .dwtag  DW_TAG_member
     502                            .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$9)
     503                            .dwattr $C$DW$29, DW_AT_name("usStackDepth")
     504                            .dwattr $C$DW$29, DW_AT_TI_symbol_name("usStackDepth")
     505                            .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     506                            .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     507                            .dwattr $C$DW$29, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     508                            .dwattr $C$DW$29, DW_AT_decl_line(0x86)
     509                            .dwattr $C$DW$29, DW_AT_decl_column(0x11)
     510                    $C$DW$30        .dwtag  DW_TAG_member
     511                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$3)
     512                            .dwattr $C$DW$30, DW_AT_name("pvParameters")
     513                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("pvParameters")
     514                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     515                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     516                            .dwattr $C$DW$30, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     517                            .dwattr $C$DW$30, DW_AT_decl_line(0x87)
     518                            .dwattr $C$DW$30, DW_AT_decl_column(0x08)
     519                    $C$DW$31        .dwtag  DW_TAG_member
     520                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$13)
     521                            .dwattr $C$DW$31, DW_AT_name("uxPriority")
     522                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("uxPriority")
     523                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     524                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     525                            .dwattr $C$DW$31, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     526                            .dwattr $C$DW$31, DW_AT_decl_line(0x88)
     527                            .dwattr $C$DW$31, DW_AT_decl_column(0x19)
     528                    $C$DW$32        .dwtag  DW_TAG_member
     529                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$38)
     530                            .dwattr $C$DW$32, DW_AT_name("puxStackBuffer")
     531                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("puxStackBuffer")
     532                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     533                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     534                            .dwattr $C$DW$32, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     535                            .dwattr $C$DW$32, DW_AT_decl_line(0x89)
     536                            .dwattr $C$DW$32, DW_AT_decl_column(0x12)
     537                    $C$DW$33        .dwtag  DW_TAG_member
     538                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$40)
     539                            .dwattr $C$DW$33, DW_AT_name("xRegions")
     540                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("xRegions")
     541                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     542                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     543                            .dwattr $C$DW$33, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     544                            .dwattr $C$DW$33, DW_AT_decl_line(0x8a)
     545                            .dwattr $C$DW$33, DW_AT_decl_column(0x10)
     546                            .dwendtag $C$DW$T$41
     547                    
     548                            .dwattr $C$DW$T$41, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
     549                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x82)
     550                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
timers.asm                                                           PAGE   11

     551                    $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
     552                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$41)
     553                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
     554                            .dwattr $C$DW$T$62, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
     555                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x8b)
     556                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
     557                    
     558                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
     559                            .dwattr $C$DW$T$42, DW_AT_name("xTIME_OUT")
     560                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x08)
     561                    $C$DW$34        .dwtag  DW_TAG_member
     562                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$12)
     563                            .dwattr $C$DW$34, DW_AT_name("xOverflowCount")
     564                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("xOverflowCount")
     565                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     566                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     567                            .dwattr $C$DW$34, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     568                            .dwattr $C$DW$34, DW_AT_decl_line(0x71)
     569                            .dwattr $C$DW$34, DW_AT_decl_column(0x10)
     570                    $C$DW$35        .dwtag  DW_TAG_member
     571                            .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$26)
     572                            .dwattr $C$DW$35, DW_AT_name("xTimeOnEntering")
     573                            .dwattr $C$DW$35, DW_AT_TI_symbol_name("xTimeOnEntering")
     574                            .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     575                            .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     576                            .dwattr $C$DW$35, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     577                            .dwattr $C$DW$35, DW_AT_decl_line(0x72)
     578                            .dwattr $C$DW$35, DW_AT_decl_column(0x10)
     579                            .dwendtag $C$DW$T$42
     580                    
     581                            .dwattr $C$DW$T$42, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
     582                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x6f)
     583                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
     584                    $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
     585                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$42)
     586                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
     587                            .dwattr $C$DW$T$63, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
     588                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x73)
     589                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
     590                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
     591                    
     592                    ;***************************************************************
     593                    ;* DWARF CIE ENTRIES                                           *
     594                    ;***************************************************************
     595                    
     596                    $C$DW$CIE       .dwcie 14
     597                            .dwcfi  cfa_register, 13
     598                            .dwcfi  cfa_offset, 0
     599                            .dwcfi  undefined, 0
     600                            .dwcfi  undefined, 1
     601                            .dwcfi  undefined, 2
     602                            .dwcfi  undefined, 3
     603                            .dwcfi  undefined, 4
     604                            .dwcfi  undefined, 5
     605                            .dwcfi  undefined, 6
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:51 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
timers.asm                                                           PAGE   12

     606                            .dwcfi  undefined, 7
     607                            .dwcfi  undefined, 8
     608                            .dwcfi  undefined, 9
     609                            .dwcfi  undefined, 10
     610                            .dwcfi  undefined, 11
     611                            .dwcfi  undefined, 12
     612                            .dwcfi  undefined, 13
     613                            .dwcfi  undefined, 14
     614                            .dwcfi  undefined, 14
     615                            .dwcfi  undefined, 7
     616                            .dwendentry
     617                            .dwendtag $C$DW$CU
     618                    

No Assembly Errors, No Assembly Warnings
