TI ARM Assembler PC v5.0.4 Mon Apr 28 11:29:11 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
port.asm                                                             PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.0.4 *
       3                    ;* Date/Time created: Mon Apr 28 11:29:11 2014                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --e
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Source/portable/CCS5/ARM_CM3/port.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.0.4 Copyright (c) 1996-2013 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("ulPortSetInterruptMask")

     811                    $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
     812                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$11)
     813                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
     814                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
     815                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x35)
     816                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x19)
     817                    $C$DW$T$12      .dwtag  DW_TAG_base_type
     818                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     819                            .dwattr $C$DW$T$12, DW_AT_name("long")
TI ARM Assembler PC v5.0.4 Mon Apr 28 11:29:11 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
port.asm                                                             PAGE   16

     820                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
     821                    
     822                    $C$DW$T$56      .dwtag  DW_TAG_subroutine_type
     823                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$12)
     824                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
     825                    $C$DW$46        .dwtag  DW_TAG_formal_parameter
     826                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$3)
     827                            .dwendtag $C$DW$T$56
     828                    
     829                    $C$DW$T$57      .dwtag  DW_TAG_pointer_type
     830                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
     831                            .dwattr $C$DW$T$57, DW_AT_address_class(0x20)
     832                    $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_HOOK_CODE")
     833                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
     834                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
     835                            .dwattr $C$DW$T$58, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/inclu
     836                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x66)
     837                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x19)
     838                    $C$DW$T$13      .dwtag  DW_TAG_base_type
     839                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     840                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
     841                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
     842                    $C$DW$T$19      .dwtag  DW_TAG_volatile_type
     843                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$13)
     844                    $C$DW$T$38      .dwtag  DW_TAG_pointer_type
     845                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$13)
     846                            .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
     847                    $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
     848                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$13)
     849                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
     850                            .dwattr $C$DW$T$26, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\inclu
     851                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x6a)
     852                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x1c)
     853                    $C$DW$T$14      .dwtag  DW_TAG_base_type
     854                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
     855                            .dwattr $C$DW$T$14, DW_AT_name("long long")
     856                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
     857                    $C$DW$T$15      .dwtag  DW_TAG_base_type
     858                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
     859                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
     860                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
     861                    $C$DW$T$16      .dwtag  DW_TAG_base_type
     862                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
     863                            .dwattr $C$DW$T$16, DW_AT_name("float")
     864                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
     865                    $C$DW$T$17      .dwtag  DW_TAG_base_type
     866                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
     867                            .dwattr $C$DW$T$17, DW_AT_name("double")
     868                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
     869                    $C$DW$T$18      .dwtag  DW_TAG_base_type
     870                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
     871                            .dwattr $C$DW$T$18, DW_AT_name("long double")
     872                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
     873                    
     874                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v5.0.4 Mon Apr 28 11:29:11 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
port.asm                                                             PAGE   17

     875                            .dwattr $C$DW$T$25, DW_AT_name("xLIST")
     876                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x14)
     877                    $C$DW$47        .dwtag  DW_TAG_member
     878                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     879                            .dwattr $C$DW$47, DW_AT_name("uxNumberOfItems")
     880                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("uxNumberOfItems")
     881                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     882                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     883                            .dwattr $C$DW$47, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include
     884                            .dwattr $C$DW$47, DW_AT_decl_line(0x88)
     885                            .dwattr $C$DW$47, DW_AT_decl_column(0x22)
     886                    $C$DW$48        .dwtag  DW_TAG_member
     887                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$22)
     888                            .dwattr $C$DW$48, DW_AT_name("pxIndex")
     889                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("pxIndex")
     890                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     891                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     892                            .dwattr $C$DW$48, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include
     893                            .dwattr $C$DW$48, DW_AT_decl_line(0x89)
     894                            .dwattr $C$DW$48, DW_AT_decl_column(0x17)
     895                    $C$DW$49        .dwtag  DW_TAG_member
     896                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$24)
     897                            .dwattr $C$DW$49, DW_AT_name("xListEnd")
     898                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("xListEnd")
     899                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     900                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     901                            .dwattr $C$DW$49, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include
     902                            .dwattr $C$DW$49, DW_AT_decl_line(0x8a)
     903                            .dwattr $C$DW$49, DW_AT_decl_column(0x19)
     904                            .dwendtag $C$DW$T$25
     905                    
     906                            .dwattr $C$DW$T$25, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\inclu
     907                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x86)
     908                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
     909                    $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
     910                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$25)
     911                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
     912                            .dwattr $C$DW$T$63, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\inclu
     913                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x8b)
     914                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
     915                    
     916                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
     917                            .dwattr $C$DW$T$29, DW_AT_name("xLIST_ITEM")
     918                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x14)
     919                    $C$DW$50        .dwtag  DW_TAG_member
     920                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$26)
     921                            .dwattr $C$DW$50, DW_AT_name("xItemValue")
     922                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("xItemValue")
     923                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     924                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     925                            .dwattr $C$DW$50, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include
     926                            .dwattr $C$DW$50, DW_AT_decl_line(0x73)
     927                            .dwattr $C$DW$50, DW_AT_decl_column(0x0f)
     928                    $C$DW$51        .dwtag  DW_TAG_member
     929                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$28)
TI ARM Assembler PC v5.0.4 Mon Apr 28 11:29:11 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
port.asm                                                             PAGE   18

     930                            .dwattr $C$DW$51, DW_AT_name("pxNext")
     931                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("pxNext")
     932                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     933                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     934                            .dwattr $C$DW$51, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include
     935                            .dwattr $C$DW$51, DW_AT_decl_line(0x74)
     936                            .dwattr $C$DW$51, DW_AT_decl_column(0x1f)
     937                    $C$DW$52        .dwtag  DW_TAG_member
     938                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$28)
     939                            .dwattr $C$DW$52, DW_AT_name("pxPrevious")
     940                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("pxPrevious")
     941                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     942                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     943                            .dwattr $C$DW$52, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include
     944                            .dwattr $C$DW$52, DW_AT_decl_line(0x75)
     945                            .dwattr $C$DW$52, DW_AT_decl_column(0x1f)
     946                    $C$DW$53        .dwtag  DW_TAG_member
     947                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$3)
     948                            .dwattr $C$DW$53, DW_AT_name("pvOwner")
     949                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("pvOwner")
     950                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     951                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     952                            .dwattr $C$DW$53, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include
     953                            .dwattr $C$DW$53, DW_AT_decl_line(0x76)
     954                            .dwattr $C$DW$53, DW_AT_decl_column(0x09)
     955                    $C$DW$54        .dwtag  DW_TAG_member
     956                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$3)
     957                            .dwattr $C$DW$54, DW_AT_name("pvContainer")
     958                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("pvContainer")
     959                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     960                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     961                            .dwattr $C$DW$54, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include
     962                            .dwattr $C$DW$54, DW_AT_decl_line(0x77)
     963                            .dwattr $C$DW$54, DW_AT_decl_column(0x09)
     964                            .dwendtag $C$DW$T$29
     965                    
     966                            .dwattr $C$DW$T$29, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\inclu
     967                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x71)
     968                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x08)
     969                    $C$DW$T$27      .dwtag  DW_TAG_volatile_type
     970                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$29)
     971                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
     972                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
     973                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
     974                    $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
     975                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$29)
     976                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
     977                            .dwattr $C$DW$T$20, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\inclu
     978                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x79)
     979                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x1b)
     980                    $C$DW$T$21      .dwtag  DW_TAG_volatile_type
     981                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
     982                    $C$DW$T$22      .dwtag  DW_TAG_pointer_type
     983                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     984                            .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
TI ARM Assembler PC v5.0.4 Mon Apr 28 11:29:11 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
port.asm                                                             PAGE   19

     985                    
     986                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
     987                            .dwattr $C$DW$T$30, DW_AT_name("xMEMORY_REGION")
     988                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x0c)
     989                    $C$DW$55        .dwtag  DW_TAG_member
     990                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$3)
     991                            .dwattr $C$DW$55, DW_AT_name("pvBaseAddress")
     992                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("pvBaseAddress")
     993                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     994                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     995                            .dwattr $C$DW$55, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include
     996                            .dwattr $C$DW$55, DW_AT_decl_line(0x7a)
     997                            .dwattr $C$DW$55, DW_AT_decl_column(0x08)
     998                    $C$DW$56        .dwtag  DW_TAG_member
     999                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$13)
    1000                            .dwattr $C$DW$56, DW_AT_name("ulLengthInBytes")
    1001                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("ulLengthInBytes")
    1002                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1003                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1004                            .dwattr $C$DW$56, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include
    1005                            .dwattr $C$DW$56, DW_AT_decl_line(0x7b)
    1006                            .dwattr $C$DW$56, DW_AT_decl_column(0x10)
    1007                    $C$DW$57        .dwtag  DW_TAG_member
    1008                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$13)
    1009                            .dwattr $C$DW$57, DW_AT_name("ulParameters")
    1010                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("ulParameters")
    1011                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1012                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1013                            .dwattr $C$DW$57, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include
    1014                            .dwattr $C$DW$57, DW_AT_decl_line(0x7c)
    1015                            .dwattr $C$DW$57, DW_AT_decl_column(0x10)
    1016                            .dwendtag $C$DW$T$30
    1017                    
    1018                            .dwattr $C$DW$T$30, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/inclu
    1019                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x78)
    1020                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    1021                    $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    1022                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$30)
    1023                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1024                            .dwattr $C$DW$T$39, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/inclu
    1025                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x7d)
    1026                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x03)
    1027                    
    1028                    $C$DW$T$40      .dwtag  DW_TAG_array_type
    1029                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    1030                            .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    1031                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    1032                    $C$DW$58        .dwtag  DW_TAG_subrange_type
    1033                            .dwattr $C$DW$58, DW_AT_upper_bound(0x00)
    1034                            .dwendtag $C$DW$T$40
    1035                    
    1036                    
    1037                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1038                            .dwattr $C$DW$T$31, DW_AT_name("xMINI_LIST_ITEM")
    1039                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x0c)
TI ARM Assembler PC v5.0.4 Mon Apr 28 11:29:11 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
port.asm                                                             PAGE   20

    1040                    $C$DW$59        .dwtag  DW_TAG_member
    1041                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$26)
    1042                            .dwattr $C$DW$59, DW_AT_name("xItemValue")
    1043                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("xItemValue")
    1044                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1045                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1046                            .dwattr $C$DW$59, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include
    1047                            .dwattr $C$DW$59, DW_AT_decl_line(0x7d)
    1048                            .dwattr $C$DW$59, DW_AT_decl_column(0x0f)
    1049                    $C$DW$60        .dwtag  DW_TAG_member
    1050                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$28)
    1051                            .dwattr $C$DW$60, DW_AT_name("pxNext")
    1052                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("pxNext")
    1053                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1054                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1055                            .dwattr $C$DW$60, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include
    1056                            .dwattr $C$DW$60, DW_AT_decl_line(0x7e)
    1057                            .dwattr $C$DW$60, DW_AT_decl_column(0x1e)
    1058                    $C$DW$61        .dwtag  DW_TAG_member
    1059                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$28)
    1060                            .dwattr $C$DW$61, DW_AT_name("pxPrevious")
    1061                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("pxPrevious")
    1062                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1063                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1064                            .dwattr $C$DW$61, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\include
    1065                            .dwattr $C$DW$61, DW_AT_decl_line(0x7f)
    1066                            .dwattr $C$DW$61, DW_AT_decl_column(0x1e)
    1067                            .dwendtag $C$DW$T$31
    1068                    
    1069                            .dwattr $C$DW$T$31, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\inclu
    1070                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x7b)
    1071                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x08)
    1072                    $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    1073                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$31)
    1074                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1075                            .dwattr $C$DW$T$23, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_IntTimer\Source\inclu
    1076                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x81)
    1077                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x20)
    1078                    $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    1079                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    1080                    
    1081                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1082                            .dwattr $C$DW$T$41, DW_AT_name("xTASK_PARAMTERS")
    1083                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x24)
    1084                    $C$DW$62        .dwtag  DW_TAG_member
    1085                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$34)
    1086                            .dwattr $C$DW$62, DW_AT_name("pvTaskCode")
    1087                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("pvTaskCode")
    1088                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1089                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1090                            .dwattr $C$DW$62, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include
    1091                            .dwattr $C$DW$62, DW_AT_decl_line(0x84)
    1092                            .dwattr $C$DW$62, DW_AT_decl_column(0x0e)
    1093                    $C$DW$63        .dwtag  DW_TAG_member
    1094                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$37)
TI ARM Assembler PC v5.0.4 Mon Apr 28 11:29:11 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
port.asm                                                             PAGE   21

    1095                            .dwattr $C$DW$63, DW_AT_name("pcName")
    1096                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("pcName")
    1097                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1098                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1099                            .dwattr $C$DW$63, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include
    1100                            .dwattr $C$DW$63, DW_AT_decl_line(0x85)
    1101                            .dwattr $C$DW$63, DW_AT_decl_column(0x1c)
    1102                    $C$DW$64        .dwtag  DW_TAG_member
    1103                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$9)
    1104                            .dwattr $C$DW$64, DW_AT_name("usStackDepth")
    1105                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("usStackDepth")
    1106                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1107                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1108                            .dwattr $C$DW$64, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include
    1109                            .dwattr $C$DW$64, DW_AT_decl_line(0x86)
    1110                            .dwattr $C$DW$64, DW_AT_decl_column(0x11)
    1111                    $C$DW$65        .dwtag  DW_TAG_member
    1112                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$3)
    1113                            .dwattr $C$DW$65, DW_AT_name("pvParameters")
    1114                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("pvParameters")
    1115                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1116                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1117                            .dwattr $C$DW$65, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include
    1118                            .dwattr $C$DW$65, DW_AT_decl_line(0x87)
    1119                            .dwattr $C$DW$65, DW_AT_decl_column(0x08)
    1120                    $C$DW$66        .dwtag  DW_TAG_member
    1121                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$13)
    1122                            .dwattr $C$DW$66, DW_AT_name("uxPriority")
    1123                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("uxPriority")
    1124                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1125                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1126                            .dwattr $C$DW$66, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include
    1127                            .dwattr $C$DW$66, DW_AT_decl_line(0x88)
    1128                            .dwattr $C$DW$66, DW_AT_decl_column(0x19)
    1129                    $C$DW$67        .dwtag  DW_TAG_member
    1130                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$38)
    1131                            .dwattr $C$DW$67, DW_AT_name("puxStackBuffer")
    1132                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("puxStackBuffer")
    1133                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1134                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1135                            .dwattr $C$DW$67, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include
    1136                            .dwattr $C$DW$67, DW_AT_decl_line(0x89)
    1137                            .dwattr $C$DW$67, DW_AT_decl_column(0x12)
    1138                    $C$DW$68        .dwtag  DW_TAG_member
    1139                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$40)
    1140                            .dwattr $C$DW$68, DW_AT_name("xRegions")
    1141                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("xRegions")
    1142                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1143                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1144                            .dwattr $C$DW$68, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include
    1145                            .dwattr $C$DW$68, DW_AT_decl_line(0x8a)
    1146                            .dwattr $C$DW$68, DW_AT_decl_column(0x10)
    1147                            .dwendtag $C$DW$T$41
    1148                    
    1149                            .dwattr $C$DW$T$41, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/inclu
TI ARM Assembler PC v5.0.4 Mon Apr 28 11:29:11 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
port.asm                                                             PAGE   22

    1150                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x82)
    1151                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    1152                    $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    1153                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$41)
    1154                            .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    1155                            .dwattr $C$DW$T$64, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/inclu
    1156                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x8b)
    1157                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    1158                    
    1159                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1160                            .dwattr $C$DW$T$42, DW_AT_name("xTIME_OUT")
    1161                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x08)
    1162                    $C$DW$69        .dwtag  DW_TAG_member
    1163                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$12)
    1164                            .dwattr $C$DW$69, DW_AT_name("xOverflowCount")
    1165                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("xOverflowCount")
    1166                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1167                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1168                            .dwattr $C$DW$69, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include
    1169                            .dwattr $C$DW$69, DW_AT_decl_line(0x71)
    1170                            .dwattr $C$DW$69, DW_AT_decl_column(0x10)
    1171                    $C$DW$70        .dwtag  DW_TAG_member
    1172                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$26)
    1173                            .dwattr $C$DW$70, DW_AT_name("xTimeOnEntering")
    1174                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("xTimeOnEntering")
    1175                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1176                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1177                            .dwattr $C$DW$70, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/include
    1178                            .dwattr $C$DW$70, DW_AT_decl_line(0x72)
    1179                            .dwattr $C$DW$70, DW_AT_decl_column(0x10)
    1180                            .dwendtag $C$DW$T$42
    1181                    
    1182                            .dwattr $C$DW$T$42, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/inclu
    1183                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x6f)
    1184                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    1185                    $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    1186                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$42)
    1187                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    1188                            .dwattr $C$DW$T$65, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_IntTimer/Source/inclu
    1189                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x73)
    1190                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    1191                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1192                    
    1193                    ;***************************************************************
    1194                    ;* DWARF CIE ENTRIES                                           *
    1195                    ;***************************************************************
    1196                    
    1197                    $C$DW$CIE       .dwcie 14
    1198                            .dwcfi  cfa_register, 13
    1199                            .dwcfi  cfa_offset, 0
    1200                            .dwcfi  undefined, 0
    1201                            .dwcfi  undefined, 1
    1202                            .dwcfi  undefined, 2
    1203                            .dwcfi  undefined, 3
    1204                            .dwcfi  same_value, 4
TI ARM Assembler PC v5.0.4 Mon Apr 28 11:29:11 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
port.asm                                                             PAGE   23

    1205                            .dwcfi  same_value, 5
    1206                            .dwcfi  same_value, 6
    1207                            .dwcfi  same_value, 7
    1208                            .dwcfi  same_value, 8
    1209                            .dwcfi  same_value, 9
    1210                            .dwcfi  same_value, 10
    1211                            .dwcfi  same_value, 11
    1212                            .dwcfi  undefined, 12
    1213                            .dwcfi  undefined, 13
    1214                            .dwcfi  undefined, 14
    1215                            .dwcfi  undefined, 14
    1216                            .dwcfi  undefined, 7
    1217                            .dwendentry
    1218                            .dwendtag $C$DW$CU
    1219                    

--------------------------
Thumb2 Statistics
--------------------------
Number of Thumb2 ins converted to Thumb = 0 (0%)
Number of Thumb ins in input = 82 (86%)
Number of Thumb2 ins encoded as Thumb2 = 13 (100%)
Number of Thumb2 ins converted to 2 OPND Thumb = 23


No Assembly Errors, No Assembly Warnings
