TI ARM Assembler PC v5.0.4 Mon Apr 21 10:37:13 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.0.4 *
       3                    ;* Date/Time created: Mon Apr 21 10:37:13 2014                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --e
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Task_AsmCompute.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.0.4 Copyright (c) 1996-2013 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("UARTprintf")

     491                    $C$DW$44        .dwtag  DW_TAG_enumerator, DW_AT_name("eRunning"), DW_AT_const_value(0x00)
     492                            .dwattr $C$DW$44, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     493                            .dwattr $C$DW$44, DW_AT_decl_line(0x90)
     494                            .dwattr $C$DW$44, DW_AT_decl_column(0x02)
     495                    $C$DW$45        .dwtag  DW_TAG_enumerator, DW_AT_name("eReady"), DW_AT_const_value(0x01)
     496                            .dwattr $C$DW$45, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     497                            .dwattr $C$DW$45, DW_AT_decl_line(0x91)
     498                            .dwattr $C$DW$45, DW_AT_decl_column(0x02)
     499                    $C$DW$46        .dwtag  DW_TAG_enumerator, DW_AT_name("eBlocked"), DW_AT_const_value(0x02)
     500                            .dwattr $C$DW$46, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     501                            .dwattr $C$DW$46, DW_AT_decl_line(0x92)
     502                            .dwattr $C$DW$46, DW_AT_decl_column(0x02)
     503                    $C$DW$47        .dwtag  DW_TAG_enumerator, DW_AT_name("eSuspended"), DW_AT_const_value(0x03)
     504                            .dwattr $C$DW$47, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     505                            .dwattr $C$DW$47, DW_AT_decl_line(0x93)
     506                            .dwattr $C$DW$47, DW_AT_decl_column(0x02)
     507                    $C$DW$48        .dwtag  DW_TAG_enumerator, DW_AT_name("eDeleted"), DW_AT_const_value(0x04)
     508                            .dwattr $C$DW$48, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     509                            .dwattr $C$DW$48, DW_AT_decl_line(0x94)
     510                            .dwattr $C$DW$48, DW_AT_decl_column(0x02)
     511                            .dwendtag $C$DW$T$46
     512                    
     513                            .dwattr $C$DW$T$46, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
     514                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x8f)
     515                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
     516                    $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("eTaskState")
     517                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
     518                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
     519                            .dwattr $C$DW$T$47, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
     520                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x95)
     521                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
     522                    
     523                    $C$DW$T$48      .dwtag  DW_TAG_enumeration_type
     524                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
     525                    $C$DW$49        .dwtag  DW_TAG_enumerator, DW_AT_name("eAbortSleep"), DW_AT_const_value(0x00)
     526                            .dwattr $C$DW$49, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     527                            .dwattr $C$DW$49, DW_AT_decl_line(0x9a)
     528                            .dwattr $C$DW$49, DW_AT_decl_column(0x02)
     529                    $C$DW$50        .dwtag  DW_TAG_enumerator, DW_AT_name("eStandardSleep"), DW_AT_const_value(0x01)
     530                            .dwattr $C$DW$50, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     531                            .dwattr $C$DW$50, DW_AT_decl_line(0x9b)
     532                            .dwattr $C$DW$50, DW_AT_decl_column(0x02)
     533                    $C$DW$51        .dwtag  DW_TAG_enumerator, DW_AT_name("eNoTasksWaitingTimeout"), DW_AT_const_value(0x0
     534                            .dwattr $C$DW$51, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     535                            .dwattr $C$DW$51, DW_AT_decl_line(0x9c)
     536                            .dwattr $C$DW$51, DW_AT_decl_column(0x02)
     537                            .dwendtag $C$DW$T$48
     538                    
     539                            .dwattr $C$DW$T$48, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:37:13 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   12

     540                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x99)
     541                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
     542                    $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("eSleepModeStatus")
     543                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
     544                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
     545                            .dwattr $C$DW$T$49, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
     546                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x9d)
     547                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x03)
     548                    
     549                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
     550                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x18)
     551                    $C$DW$52        .dwtag  DW_TAG_member
     552                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$10)
     553                            .dwattr $C$DW$52, DW_AT_name("fd")
     554                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("fd")
     555                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     556                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     557                            .dwattr $C$DW$52, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/s
     558                            .dwattr $C$DW$52, DW_AT_decl_line(0x5b)
     559                            .dwattr $C$DW$52, DW_AT_decl_column(0x0b)
     560                    $C$DW$53        .dwtag  DW_TAG_member
     561                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     562                            .dwattr $C$DW$53, DW_AT_name("buf")
     563                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("buf")
     564                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     565                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     566                            .dwattr $C$DW$53, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/s
     567                            .dwattr $C$DW$53, DW_AT_decl_line(0x5c)
     568                            .dwattr $C$DW$53, DW_AT_decl_column(0x16)
     569                    $C$DW$54        .dwtag  DW_TAG_member
     570                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     571                            .dwattr $C$DW$54, DW_AT_name("pos")
     572                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("pos")
     573                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     574                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     575                            .dwattr $C$DW$54, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/s
     576                            .dwattr $C$DW$54, DW_AT_decl_line(0x5d)
     577                            .dwattr $C$DW$54, DW_AT_decl_column(0x16)
     578                    $C$DW$55        .dwtag  DW_TAG_member
     579                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     580                            .dwattr $C$DW$55, DW_AT_name("bufend")
     581                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("bufend")
     582                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     583                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     584                            .dwattr $C$DW$55, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/s
     585                            .dwattr $C$DW$55, DW_AT_decl_line(0x5e)
     586                            .dwattr $C$DW$55, DW_AT_decl_column(0x16)
     587                    $C$DW$56        .dwtag  DW_TAG_member
     588                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     589                            .dwattr $C$DW$56, DW_AT_name("buff_stop")
     590                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("buff_stop")
     591                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     592                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     593                            .dwattr $C$DW$56, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/s
     594                            .dwattr $C$DW$56, DW_AT_decl_line(0x5f)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:37:13 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   13

     595                            .dwattr $C$DW$56, DW_AT_decl_column(0x16)
     596                    $C$DW$57        .dwtag  DW_TAG_member
     597                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
     598                            .dwattr $C$DW$57, DW_AT_name("flags")
     599                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("flags")
     600                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     601                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     602                            .dwattr $C$DW$57, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/s
     603                            .dwattr $C$DW$57, DW_AT_decl_line(0x60)
     604                            .dwattr $C$DW$57, DW_AT_decl_column(0x16)
     605                            .dwendtag $C$DW$T$20
     606                    
     607                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
     608                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x5a)
     609                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
     610                    $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
     611                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$20)
     612                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
     613                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
     614                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x61)
     615                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x03)
     616                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     617                            .dwattr $C$DW$T$2, DW_AT_name("void")
     618                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     619                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
     620                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
     621                    $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskHandle")
     622                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$3)
     623                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
     624                            .dwattr $C$DW$T$51, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
     625                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x6a)
     626                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
     627                    
     628                    $C$DW$T$35      .dwtag  DW_TAG_subroutine_type
     629                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
     630                    $C$DW$58        .dwtag  DW_TAG_formal_parameter
     631                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$3)
     632                            .dwendtag $C$DW$T$35
     633                    
     634                    $C$DW$T$36      .dwtag  DW_TAG_pointer_type
     635                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
     636                            .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
     637                    $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_CODE")
     638                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
     639                            .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
     640                            .dwattr $C$DW$T$37, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
     641                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x4f)
     642                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
     643                    $C$DW$T$4       .dwtag  DW_TAG_base_type
     644                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     645                            .dwattr $C$DW$T$4, DW_AT_name("bool")
     646                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     647                    $C$DW$T$5       .dwtag  DW_TAG_base_type
     648                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     649                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:37:13 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   14

     650                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     651                    $C$DW$T$38      .dwtag  DW_TAG_const_type
     652                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$5)
     653                    $C$DW$T$39      .dwtag  DW_TAG_pointer_type
     654                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
     655                            .dwattr $C$DW$T$39, DW_AT_address_class(0x20)
     656                    $C$DW$T$40      .dwtag  DW_TAG_const_type
     657                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
     658                    $C$DW$T$6       .dwtag  DW_TAG_base_type
     659                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     660                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     661                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     662                    $C$DW$T$19      .dwtag  DW_TAG_pointer_type
     663                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
     664                            .dwattr $C$DW$T$19, DW_AT_address_class(0x20)
     665                    $C$DW$T$7       .dwtag  DW_TAG_base_type
     666                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     667                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     668                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
     669                    $C$DW$T$8       .dwtag  DW_TAG_base_type
     670                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     671                            .dwattr $C$DW$T$8, DW_AT_name("short")
     672                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
     673                    $C$DW$T$9       .dwtag  DW_TAG_base_type
     674                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     675                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     676                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
     677                    $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
     678                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$9)
     679                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
     680                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
     681                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x3c)
     682                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x1a)
     683                    $C$DW$T$10      .dwtag  DW_TAG_base_type
     684                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     685                            .dwattr $C$DW$T$10, DW_AT_name("int")
     686                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
     687                    $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
     688                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$10)
     689                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
     690                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
     691                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x31)
     692                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x1c)
     693                    $C$DW$T$11      .dwtag  DW_TAG_base_type
     694                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     695                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     696                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
     697                    $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
     698                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$11)
     699                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
     700                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
     701                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x35)
     702                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x19)
     703                    $C$DW$T$12      .dwtag  DW_TAG_base_type
     704                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:37:13 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   15

     705                            .dwattr $C$DW$T$12, DW_AT_name("long")
     706                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
     707                    
     708                    $C$DW$T$64      .dwtag  DW_TAG_subroutine_type
     709                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$12)
     710                            .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
     711                    $C$DW$59        .dwtag  DW_TAG_formal_parameter
     712                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$3)
     713                            .dwendtag $C$DW$T$64
     714                    
     715                    $C$DW$T$65      .dwtag  DW_TAG_pointer_type
     716                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
     717                            .dwattr $C$DW$T$65, DW_AT_address_class(0x20)
     718                    $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_HOOK_CODE")
     719                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
     720                            .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
     721                            .dwattr $C$DW$T$66, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
     722                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x66)
     723                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x19)
     724                    $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
     725                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$12)
     726                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     727                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
     728                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x6d)
     729                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x0e)
     730                    $C$DW$T$13      .dwtag  DW_TAG_base_type
     731                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     732                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
     733                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
     734                    $C$DW$T$22      .dwtag  DW_TAG_volatile_type
     735                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$13)
     736                    $C$DW$T$41      .dwtag  DW_TAG_pointer_type
     737                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$13)
     738                            .dwattr $C$DW$T$41, DW_AT_address_class(0x20)
     739                    $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
     740                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$13)
     741                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
     742                            .dwattr $C$DW$T$29, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
     743                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x6a)
     744                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x1c)
     745                    $C$DW$T$14      .dwtag  DW_TAG_base_type
     746                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
     747                            .dwattr $C$DW$T$14, DW_AT_name("long long")
     748                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
     749                    $C$DW$T$15      .dwtag  DW_TAG_base_type
     750                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
     751                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
     752                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
     753                    $C$DW$T$16      .dwtag  DW_TAG_base_type
     754                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
     755                            .dwattr $C$DW$T$16, DW_AT_name("float")
     756                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
     757                    $C$DW$T$17      .dwtag  DW_TAG_base_type
     758                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
     759                            .dwattr $C$DW$T$17, DW_AT_name("double")
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:37:13 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   16

     760                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
     761                    $C$DW$T$18      .dwtag  DW_TAG_base_type
     762                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
     763                            .dwattr $C$DW$T$18, DW_AT_name("long double")
     764                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
     765                    $C$DW$T$52      .dwtag  DW_TAG_base_type
     766                            .dwattr $C$DW$T$52, DW_AT_encoding(DW_ATE_unsigned_char)
     767                            .dwattr $C$DW$T$52, DW_AT_name("unsigned char")
     768                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
     769                    $C$DW$T$53      .dwtag  DW_TAG_const_type
     770                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
     771                    $C$DW$T$54      .dwtag  DW_TAG_pointer_type
     772                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
     773                            .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
     774                    
     775                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
     776                            .dwattr $C$DW$T$21, DW_AT_name("__va_list")
     777                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     778                    $C$DW$60        .dwtag  DW_TAG_member
     779                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$3)
     780                            .dwattr $C$DW$60, DW_AT_name("__ap")
     781                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("__ap")
     782                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     783                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     784                            .dwattr $C$DW$60, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/s
     785                            .dwattr $C$DW$60, DW_AT_decl_line(0x32)
     786                            .dwattr $C$DW$60, DW_AT_decl_column(0x0c)
     787                            .dwendtag $C$DW$T$21
     788                    
     789                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
     790                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x31)
     791                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
     792                    $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("va_list")
     793                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$21)
     794                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
     795                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
     796                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x33)
     797                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
     798                    
     799                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
     800                            .dwattr $C$DW$T$28, DW_AT_name("xLIST")
     801                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x14)
     802                    $C$DW$61        .dwtag  DW_TAG_member
     803                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$22)
     804                            .dwattr $C$DW$61, DW_AT_name("uxNumberOfItems")
     805                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("uxNumberOfItems")
     806                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     807                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     808                            .dwattr $C$DW$61, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     809                            .dwattr $C$DW$61, DW_AT_decl_line(0x88)
     810                            .dwattr $C$DW$61, DW_AT_decl_column(0x22)
     811                    $C$DW$62        .dwtag  DW_TAG_member
     812                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$25)
     813                            .dwattr $C$DW$62, DW_AT_name("pxIndex")
     814                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("pxIndex")
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:37:13 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   17

     815                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     816                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     817                            .dwattr $C$DW$62, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     818                            .dwattr $C$DW$62, DW_AT_decl_line(0x89)
     819                            .dwattr $C$DW$62, DW_AT_decl_column(0x17)
     820                    $C$DW$63        .dwtag  DW_TAG_member
     821                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$27)
     822                            .dwattr $C$DW$63, DW_AT_name("xListEnd")
     823                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("xListEnd")
     824                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     825                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     826                            .dwattr $C$DW$63, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     827                            .dwattr $C$DW$63, DW_AT_decl_line(0x8a)
     828                            .dwattr $C$DW$63, DW_AT_decl_column(0x19)
     829                            .dwendtag $C$DW$T$28
     830                    
     831                            .dwattr $C$DW$T$28, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
     832                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x86)
     833                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
     834                    $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
     835                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$28)
     836                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
     837                            .dwattr $C$DW$T$73, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
     838                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x8b)
     839                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
     840                    
     841                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
     842                            .dwattr $C$DW$T$32, DW_AT_name("xLIST_ITEM")
     843                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x14)
     844                    $C$DW$64        .dwtag  DW_TAG_member
     845                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$29)
     846                            .dwattr $C$DW$64, DW_AT_name("xItemValue")
     847                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("xItemValue")
     848                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     849                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     850                            .dwattr $C$DW$64, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     851                            .dwattr $C$DW$64, DW_AT_decl_line(0x73)
     852                            .dwattr $C$DW$64, DW_AT_decl_column(0x0f)
     853                    $C$DW$65        .dwtag  DW_TAG_member
     854                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$31)
     855                            .dwattr $C$DW$65, DW_AT_name("pxNext")
     856                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("pxNext")
     857                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     858                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     859                            .dwattr $C$DW$65, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     860                            .dwattr $C$DW$65, DW_AT_decl_line(0x74)
     861                            .dwattr $C$DW$65, DW_AT_decl_column(0x1f)
     862                    $C$DW$66        .dwtag  DW_TAG_member
     863                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$31)
     864                            .dwattr $C$DW$66, DW_AT_name("pxPrevious")
     865                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("pxPrevious")
     866                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     867                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     868                            .dwattr $C$DW$66, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     869                            .dwattr $C$DW$66, DW_AT_decl_line(0x75)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:37:13 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   18

     870                            .dwattr $C$DW$66, DW_AT_decl_column(0x1f)
     871                    $C$DW$67        .dwtag  DW_TAG_member
     872                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$3)
     873                            .dwattr $C$DW$67, DW_AT_name("pvOwner")
     874                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("pvOwner")
     875                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     876                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     877                            .dwattr $C$DW$67, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     878                            .dwattr $C$DW$67, DW_AT_decl_line(0x76)
     879                            .dwattr $C$DW$67, DW_AT_decl_column(0x09)
     880                    $C$DW$68        .dwtag  DW_TAG_member
     881                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$3)
     882                            .dwattr $C$DW$68, DW_AT_name("pvContainer")
     883                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("pvContainer")
     884                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     885                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     886                            .dwattr $C$DW$68, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     887                            .dwattr $C$DW$68, DW_AT_decl_line(0x77)
     888                            .dwattr $C$DW$68, DW_AT_decl_column(0x09)
     889                            .dwendtag $C$DW$T$32
     890                    
     891                            .dwattr $C$DW$T$32, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
     892                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x71)
     893                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x08)
     894                    $C$DW$T$30      .dwtag  DW_TAG_volatile_type
     895                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$32)
     896                    $C$DW$T$31      .dwtag  DW_TAG_pointer_type
     897                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
     898                            .dwattr $C$DW$T$31, DW_AT_address_class(0x20)
     899                    $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
     900                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$32)
     901                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     902                            .dwattr $C$DW$T$23, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
     903                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x79)
     904                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x1b)
     905                    $C$DW$T$24      .dwtag  DW_TAG_volatile_type
     906                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     907                    $C$DW$T$25      .dwtag  DW_TAG_pointer_type
     908                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
     909                            .dwattr $C$DW$T$25, DW_AT_address_class(0x20)
     910                    
     911                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
     912                            .dwattr $C$DW$T$33, DW_AT_name("xMEMORY_REGION")
     913                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x0c)
     914                    $C$DW$69        .dwtag  DW_TAG_member
     915                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$3)
     916                            .dwattr $C$DW$69, DW_AT_name("pvBaseAddress")
     917                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("pvBaseAddress")
     918                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     919                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     920                            .dwattr $C$DW$69, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     921                            .dwattr $C$DW$69, DW_AT_decl_line(0x7a)
     922                            .dwattr $C$DW$69, DW_AT_decl_column(0x08)
     923                    $C$DW$70        .dwtag  DW_TAG_member
     924                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$13)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:37:13 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   19

     925                            .dwattr $C$DW$70, DW_AT_name("ulLengthInBytes")
     926                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("ulLengthInBytes")
     927                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     928                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     929                            .dwattr $C$DW$70, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     930                            .dwattr $C$DW$70, DW_AT_decl_line(0x7b)
     931                            .dwattr $C$DW$70, DW_AT_decl_column(0x10)
     932                    $C$DW$71        .dwtag  DW_TAG_member
     933                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$13)
     934                            .dwattr $C$DW$71, DW_AT_name("ulParameters")
     935                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("ulParameters")
     936                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     937                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     938                            .dwattr $C$DW$71, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     939                            .dwattr $C$DW$71, DW_AT_decl_line(0x7c)
     940                            .dwattr $C$DW$71, DW_AT_decl_column(0x10)
     941                            .dwendtag $C$DW$T$33
     942                    
     943                            .dwattr $C$DW$T$33, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
     944                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x78)
     945                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
     946                    $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
     947                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$33)
     948                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
     949                            .dwattr $C$DW$T$42, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
     950                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x7d)
     951                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
     952                    
     953                    $C$DW$T$43      .dwtag  DW_TAG_array_type
     954                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
     955                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
     956                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x0c)
     957                    $C$DW$72        .dwtag  DW_TAG_subrange_type
     958                            .dwattr $C$DW$72, DW_AT_upper_bound(0x00)
     959                            .dwendtag $C$DW$T$43
     960                    
     961                    
     962                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
     963                            .dwattr $C$DW$T$34, DW_AT_name("xMINI_LIST_ITEM")
     964                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
     965                    $C$DW$73        .dwtag  DW_TAG_member
     966                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$29)
     967                            .dwattr $C$DW$73, DW_AT_name("xItemValue")
     968                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("xItemValue")
     969                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     970                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     971                            .dwattr $C$DW$73, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     972                            .dwattr $C$DW$73, DW_AT_decl_line(0x7d)
     973                            .dwattr $C$DW$73, DW_AT_decl_column(0x0f)
     974                    $C$DW$74        .dwtag  DW_TAG_member
     975                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$31)
     976                            .dwattr $C$DW$74, DW_AT_name("pxNext")
     977                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("pxNext")
     978                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     979                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:37:13 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   20

     980                            .dwattr $C$DW$74, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     981                            .dwattr $C$DW$74, DW_AT_decl_line(0x7e)
     982                            .dwattr $C$DW$74, DW_AT_decl_column(0x1e)
     983                    $C$DW$75        .dwtag  DW_TAG_member
     984                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$31)
     985                            .dwattr $C$DW$75, DW_AT_name("pxPrevious")
     986                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("pxPrevious")
     987                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     988                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     989                            .dwattr $C$DW$75, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
     990                            .dwattr $C$DW$75, DW_AT_decl_line(0x7f)
     991                            .dwattr $C$DW$75, DW_AT_decl_column(0x1e)
     992                            .dwendtag $C$DW$T$34
     993                    
     994                            .dwattr $C$DW$T$34, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
     995                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x7b)
     996                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x08)
     997                    $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
     998                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$34)
     999                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    1000                            .dwattr $C$DW$T$26, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
    1001                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x81)
    1002                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x20)
    1003                    $C$DW$T$27      .dwtag  DW_TAG_volatile_type
    1004                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1005                    
    1006                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1007                            .dwattr $C$DW$T$44, DW_AT_name("xTASK_PARAMTERS")
    1008                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x24)
    1009                    $C$DW$76        .dwtag  DW_TAG_member
    1010                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$37)
    1011                            .dwattr $C$DW$76, DW_AT_name("pvTaskCode")
    1012                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("pvTaskCode")
    1013                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1014                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1015                            .dwattr $C$DW$76, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
    1016                            .dwattr $C$DW$76, DW_AT_decl_line(0x84)
    1017                            .dwattr $C$DW$76, DW_AT_decl_column(0x0e)
    1018                    $C$DW$77        .dwtag  DW_TAG_member
    1019                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$40)
    1020                            .dwattr $C$DW$77, DW_AT_name("pcName")
    1021                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("pcName")
    1022                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1023                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1024                            .dwattr $C$DW$77, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
    1025                            .dwattr $C$DW$77, DW_AT_decl_line(0x85)
    1026                            .dwattr $C$DW$77, DW_AT_decl_column(0x1c)
    1027                    $C$DW$78        .dwtag  DW_TAG_member
    1028                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$9)
    1029                            .dwattr $C$DW$78, DW_AT_name("usStackDepth")
    1030                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("usStackDepth")
    1031                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1032                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1033                            .dwattr $C$DW$78, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
    1034                            .dwattr $C$DW$78, DW_AT_decl_line(0x86)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:37:13 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   21

    1035                            .dwattr $C$DW$78, DW_AT_decl_column(0x11)
    1036                    $C$DW$79        .dwtag  DW_TAG_member
    1037                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$3)
    1038                            .dwattr $C$DW$79, DW_AT_name("pvParameters")
    1039                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("pvParameters")
    1040                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1041                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1042                            .dwattr $C$DW$79, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
    1043                            .dwattr $C$DW$79, DW_AT_decl_line(0x87)
    1044                            .dwattr $C$DW$79, DW_AT_decl_column(0x08)
    1045                    $C$DW$80        .dwtag  DW_TAG_member
    1046                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$13)
    1047                            .dwattr $C$DW$80, DW_AT_name("uxPriority")
    1048                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("uxPriority")
    1049                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1050                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1051                            .dwattr $C$DW$80, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
    1052                            .dwattr $C$DW$80, DW_AT_decl_line(0x88)
    1053                            .dwattr $C$DW$80, DW_AT_decl_column(0x19)
    1054                    $C$DW$81        .dwtag  DW_TAG_member
    1055                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$41)
    1056                            .dwattr $C$DW$81, DW_AT_name("puxStackBuffer")
    1057                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("puxStackBuffer")
    1058                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1059                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1060                            .dwattr $C$DW$81, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
    1061                            .dwattr $C$DW$81, DW_AT_decl_line(0x89)
    1062                            .dwattr $C$DW$81, DW_AT_decl_column(0x12)
    1063                    $C$DW$82        .dwtag  DW_TAG_member
    1064                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$43)
    1065                            .dwattr $C$DW$82, DW_AT_name("xRegions")
    1066                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("xRegions")
    1067                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1068                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1069                            .dwattr $C$DW$82, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
    1070                            .dwattr $C$DW$82, DW_AT_decl_line(0x8a)
    1071                            .dwattr $C$DW$82, DW_AT_decl_column(0x10)
    1072                            .dwendtag $C$DW$T$44
    1073                    
    1074                            .dwattr $C$DW$T$44, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    1075                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x82)
    1076                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    1077                    $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    1078                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$44)
    1079                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1080                            .dwattr $C$DW$T$74, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    1081                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x8b)
    1082                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    1083                    
    1084                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1085                            .dwattr $C$DW$T$45, DW_AT_name("xTIME_OUT")
    1086                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x08)
    1087                    $C$DW$83        .dwtag  DW_TAG_member
    1088                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$12)
    1089                            .dwattr $C$DW$83, DW_AT_name("xOverflowCount")
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:37:13 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   22

    1090                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("xOverflowCount")
    1091                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1092                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1093                            .dwattr $C$DW$83, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
    1094                            .dwattr $C$DW$83, DW_AT_decl_line(0x71)
    1095                            .dwattr $C$DW$83, DW_AT_decl_column(0x10)
    1096                    $C$DW$84        .dwtag  DW_TAG_member
    1097                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$29)
    1098                            .dwattr $C$DW$84, DW_AT_name("xTimeOnEntering")
    1099                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("xTimeOnEntering")
    1100                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1101                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1102                            .dwattr $C$DW$84, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
    1103                            .dwattr $C$DW$84, DW_AT_decl_line(0x72)
    1104                            .dwattr $C$DW$84, DW_AT_decl_column(0x10)
    1105                            .dwendtag $C$DW$T$45
    1106                    
    1107                            .dwattr $C$DW$T$45, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    1108                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x6f)
    1109                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
    1110                    $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    1111                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$45)
    1112                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1113                            .dwattr $C$DW$T$75, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    1114                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x73)
    1115                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    1116                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1117                    
    1118                    ;***************************************************************
    1119                    ;* DWARF CIE ENTRIES                                           *
    1120                    ;***************************************************************
    1121                    
    1122                    $C$DW$CIE       .dwcie 14
    1123                            .dwcfi  cfa_register, 13
    1124                            .dwcfi  cfa_offset, 0
    1125                            .dwcfi  undefined, 0
    1126                            .dwcfi  undefined, 1
    1127                            .dwcfi  undefined, 2
    1128                            .dwcfi  undefined, 3
    1129                            .dwcfi  same_value, 4
    1130                            .dwcfi  same_value, 5
    1131                            .dwcfi  same_value, 6
    1132                            .dwcfi  same_value, 7
    1133                            .dwcfi  same_value, 8
    1134                            .dwcfi  same_value, 9
    1135                            .dwcfi  same_value, 10
    1136                            .dwcfi  same_value, 11
    1137                            .dwcfi  undefined, 12
    1138                            .dwcfi  undefined, 13
    1139                            .dwcfi  undefined, 14
    1140                            .dwcfi  undefined, 14
    1141                            .dwcfi  undefined, 7
    1142                            .dwendentry
    1143                            .dwendtag $C$DW$CU
    1144                    

--------------------------
Thumb2 Statistics
--------------------------
Number of Thumb2 ins converted to Thumb = 0 (0%)
Number of Thumb ins in input = 87 (91%)
Number of Thumb2 ins encoded as Thumb2 = 8 (100%)
Number of Thumb2 ins converted to 2 OPND Thumb = 23

TI ARM Assembler PC v5.0.4 Mon Apr 21 10:37:13 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   23


No Assembly Errors, No Assembly Warnings
