TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:47 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
heap_2.asm                                                           PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.0.4 *
       3                    ;* Date/Time created: Mon Apr 21 10:17:47 2014                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --e
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../heap_2.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.0.4 Copyright (c) 1996-2013 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("vTaskSuspendAll")

     753                    $C$DW$49        .dwtag  DW_TAG_enumerator, DW_AT_name("eRunning"), DW_AT_const_value(0x00)
     754                            .dwattr $C$DW$49, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     755                            .dwattr $C$DW$49, DW_AT_decl_line(0x90)
     756                            .dwattr $C$DW$49, DW_AT_decl_column(0x02)
     757                    $C$DW$50        .dwtag  DW_TAG_enumerator, DW_AT_name("eReady"), DW_AT_const_value(0x01)
     758                            .dwattr $C$DW$50, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     759                            .dwattr $C$DW$50, DW_AT_decl_line(0x91)
     760                            .dwattr $C$DW$50, DW_AT_decl_column(0x02)
     761                    $C$DW$51        .dwtag  DW_TAG_enumerator, DW_AT_name("eBlocked"), DW_AT_const_value(0x02)
     762                            .dwattr $C$DW$51, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     763                            .dwattr $C$DW$51, DW_AT_decl_line(0x92)
     764                            .dwattr $C$DW$51, DW_AT_decl_column(0x02)
     765                    $C$DW$52        .dwtag  DW_TAG_enumerator, DW_AT_name("eSuspended"), DW_AT_const_value(0x03)
     766                            .dwattr $C$DW$52, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     767                            .dwattr $C$DW$52, DW_AT_decl_line(0x93)
     768                            .dwattr $C$DW$52, DW_AT_decl_column(0x02)
     769                    $C$DW$53        .dwtag  DW_TAG_enumerator, DW_AT_name("eDeleted"), DW_AT_const_value(0x04)
     770                            .dwattr $C$DW$53, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:47 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   15

     771                            .dwattr $C$DW$53, DW_AT_decl_line(0x94)
     772                            .dwattr $C$DW$53, DW_AT_decl_column(0x02)
     773                            .dwendtag $C$DW$T$52
     774                    
     775                            .dwattr $C$DW$T$52, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
     776                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x8f)
     777                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
     778                    $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("eTaskState")
     779                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
     780                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
     781                            .dwattr $C$DW$T$53, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
     782                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x95)
     783                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x03)
     784                    
     785                    $C$DW$T$54      .dwtag  DW_TAG_enumeration_type
     786                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
     787                    $C$DW$54        .dwtag  DW_TAG_enumerator, DW_AT_name("eAbortSleep"), DW_AT_const_value(0x00)
     788                            .dwattr $C$DW$54, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     789                            .dwattr $C$DW$54, DW_AT_decl_line(0x9a)
     790                            .dwattr $C$DW$54, DW_AT_decl_column(0x02)
     791                    $C$DW$55        .dwtag  DW_TAG_enumerator, DW_AT_name("eStandardSleep"), DW_AT_const_value(0x01)
     792                            .dwattr $C$DW$55, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     793                            .dwattr $C$DW$55, DW_AT_decl_line(0x9b)
     794                            .dwattr $C$DW$55, DW_AT_decl_column(0x02)
     795                    $C$DW$56        .dwtag  DW_TAG_enumerator, DW_AT_name("eNoTasksWaitingTimeout"), DW_AT_const_value(0x0
     796                            .dwattr $C$DW$56, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
     797                            .dwattr $C$DW$56, DW_AT_decl_line(0x9c)
     798                            .dwattr $C$DW$56, DW_AT_decl_column(0x02)
     799                            .dwendtag $C$DW$T$54
     800                    
     801                            .dwattr $C$DW$T$54, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
     802                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x99)
     803                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
     804                    $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("eSleepModeStatus")
     805                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
     806                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
     807                            .dwattr $C$DW$T$55, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
     808                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x9d)
     809                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x03)
     810                    
     811                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
     812                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x08)
     813                    $C$DW$57        .dwtag  DW_TAG_member
     814                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$10)
     815                            .dwattr $C$DW$57, DW_AT_name("quot")
     816                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("quot")
     817                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     818                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     819                            .dwattr $C$DW$57, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/s
     820                            .dwattr $C$DW$57, DW_AT_decl_line(0x50)
     821                            .dwattr $C$DW$57, DW_AT_decl_column(0x16)
     822                    $C$DW$58        .dwtag  DW_TAG_member
     823                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$10)
     824                            .dwattr $C$DW$58, DW_AT_name("rem")
     825                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("rem")
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:47 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   16

     826                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     827                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     828                            .dwattr $C$DW$58, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/s
     829                            .dwattr $C$DW$58, DW_AT_decl_line(0x50)
     830                            .dwattr $C$DW$58, DW_AT_decl_column(0x1c)
     831                            .dwendtag $C$DW$T$19
     832                    
     833                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
     834                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x50)
     835                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
     836                    $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
     837                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$19)
     838                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
     839                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
     840                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x50)
     841                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x23)
     842                    
     843                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
     844                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
     845                    $C$DW$59        .dwtag  DW_TAG_member
     846                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$10)
     847                            .dwattr $C$DW$59, DW_AT_name("quot")
     848                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("quot")
     849                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     850                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     851                            .dwattr $C$DW$59, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/s
     852                            .dwattr $C$DW$59, DW_AT_decl_line(0x52)
     853                            .dwattr $C$DW$59, DW_AT_decl_column(0x16)
     854                    $C$DW$60        .dwtag  DW_TAG_member
     855                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$10)
     856                            .dwattr $C$DW$60, DW_AT_name("rem")
     857                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("rem")
     858                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     859                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     860                            .dwattr $C$DW$60, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/s
     861                            .dwattr $C$DW$60, DW_AT_decl_line(0x52)
     862                            .dwattr $C$DW$60, DW_AT_decl_column(0x1c)
     863                            .dwendtag $C$DW$T$20
     864                    
     865                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
     866                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x52)
     867                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
     868                    $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
     869                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$20)
     870                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
     871                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
     872                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x52)
     873                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x23)
     874                    
     875                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
     876                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
     877                    $C$DW$61        .dwtag  DW_TAG_member
     878                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$14)
     879                            .dwattr $C$DW$61, DW_AT_name("quot")
     880                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("quot")
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:47 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   17

     881                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     882                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     883                            .dwattr $C$DW$61, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/s
     884                            .dwattr $C$DW$61, DW_AT_decl_line(0x55)
     885                            .dwattr $C$DW$61, DW_AT_decl_column(0x1c)
     886                    $C$DW$62        .dwtag  DW_TAG_member
     887                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$14)
     888                            .dwattr $C$DW$62, DW_AT_name("rem")
     889                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("rem")
     890                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     891                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     892                            .dwattr $C$DW$62, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/s
     893                            .dwattr $C$DW$62, DW_AT_decl_line(0x55)
     894                            .dwattr $C$DW$62, DW_AT_decl_column(0x22)
     895                            .dwendtag $C$DW$T$21
     896                    
     897                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
     898                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x55)
     899                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
     900                    $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
     901                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$21)
     902                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
     903                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
     904                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x55)
     905                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x29)
     906                    
     907                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
     908                            .dwattr $C$DW$T$24, DW_AT_name("A_BLOCK_LINK")
     909                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
     910                    $C$DW$63        .dwtag  DW_TAG_member
     911                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$22)
     912                            .dwattr $C$DW$63, DW_AT_name("pxNextFreeBlock")
     913                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("pxNextFreeBlock")
     914                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     915                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     916                            .dwattr $C$DW$63, DW_AT_decl_file("../heap_2.c")
     917                            .dwattr $C$DW$63, DW_AT_decl_line(0x45)
     918                            .dwattr $C$DW$63, DW_AT_decl_column(0x17)
     919                    $C$DW$64        .dwtag  DW_TAG_member
     920                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$23)
     921                            .dwattr $C$DW$64, DW_AT_name("xBlockSize")
     922                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("xBlockSize")
     923                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     924                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     925                            .dwattr $C$DW$64, DW_AT_decl_file("../heap_2.c")
     926                            .dwattr $C$DW$64, DW_AT_decl_line(0x46)
     927                            .dwattr $C$DW$64, DW_AT_decl_column(0x09)
     928                            .dwendtag $C$DW$T$24
     929                    
     930                            .dwattr $C$DW$T$24, DW_AT_decl_file("../heap_2.c")
     931                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x43)
     932                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
     933                    $C$DW$T$22      .dwtag  DW_TAG_pointer_type
     934                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$24)
     935                            .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:47 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   18

     936                    $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("xBlockLink")
     937                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$24)
     938                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
     939                            .dwattr $C$DW$T$59, DW_AT_decl_file("../heap_2.c")
     940                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x47)
     941                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x03)
     942                    $C$DW$T$60      .dwtag  DW_TAG_pointer_type
     943                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
     944                            .dwattr $C$DW$T$60, DW_AT_address_class(0x20)
     945                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     946                            .dwattr $C$DW$T$2, DW_AT_name("void")
     947                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     948                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
     949                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
     950                    $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskHandle")
     951                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$3)
     952                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
     953                            .dwattr $C$DW$T$62, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
     954                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x6a)
     955                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x10)
     956                    
     957                    $C$DW$T$41      .dwtag  DW_TAG_subroutine_type
     958                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
     959                    $C$DW$65        .dwtag  DW_TAG_formal_parameter
     960                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$3)
     961                            .dwendtag $C$DW$T$41
     962                    
     963                    $C$DW$T$42      .dwtag  DW_TAG_pointer_type
     964                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
     965                            .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
     966                    $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_CODE")
     967                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
     968                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
     969                            .dwattr $C$DW$T$43, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
     970                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x4f)
     971                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x10)
     972                    $C$DW$T$4       .dwtag  DW_TAG_base_type
     973                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     974                            .dwattr $C$DW$T$4, DW_AT_name("bool")
     975                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     976                    $C$DW$T$5       .dwtag  DW_TAG_base_type
     977                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     978                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
     979                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     980                    $C$DW$T$44      .dwtag  DW_TAG_const_type
     981                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$5)
     982                    $C$DW$T$45      .dwtag  DW_TAG_pointer_type
     983                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
     984                            .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
     985                    $C$DW$T$46      .dwtag  DW_TAG_const_type
     986                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
     987                    $C$DW$T$6       .dwtag  DW_TAG_base_type
     988                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     989                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     990                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:47 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   19

     991                    
     992                    $C$DW$T$39      .dwtag  DW_TAG_array_type
     993                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$6)
     994                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
     995                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x2000)
     996                    $C$DW$66        .dwtag  DW_TAG_subrange_type
     997                            .dwattr $C$DW$66, DW_AT_upper_bound(0x1fff)
     998                            .dwendtag $C$DW$T$39
     999                    
    1000                    $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    1001                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$6)
    1002                            .dwattr $C$DW$T$66, DW_AT_address_class(0x20)
    1003                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    1004                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1005                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1006                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    1007                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    1008                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1009                            .dwattr $C$DW$T$8, DW_AT_name("short")
    1010                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    1011                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    1012                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1013                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1014                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    1015                    $C$DW$T$67      .dwtag  DW_TAG_const_type
    1016                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$9)
    1017                    $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    1018                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$9)
    1019                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1020                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    1021                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x6a)
    1022                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x1a)
    1023                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    1024                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1025                            .dwattr $C$DW$T$10, DW_AT_name("int")
    1026                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    1027                    $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
    1028                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$10)
    1029                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1030                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    1031                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x31)
    1032                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x1c)
    1033                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    1034                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1035                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1036                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    1037                    $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    1038                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$11)
    1039                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1040                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include
    1041                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x64)
    1042                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x19)
    1043                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    1044                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1045                            .dwattr $C$DW$T$12, DW_AT_name("long")
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:47 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   20

    1046                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    1047                    
    1048                    $C$DW$T$73      .dwtag  DW_TAG_subroutine_type
    1049                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$12)
    1050                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1051                    $C$DW$67        .dwtag  DW_TAG_formal_parameter
    1052                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$3)
    1053                            .dwendtag $C$DW$T$73
    1054                    
    1055                    $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    1056                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    1057                            .dwattr $C$DW$T$74, DW_AT_address_class(0x20)
    1058                    $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_HOOK_CODE")
    1059                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    1060                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1061                            .dwattr $C$DW$T$75, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    1062                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x66)
    1063                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x19)
    1064                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    1065                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1066                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1067                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    1068                    $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    1069                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$13)
    1070                    $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    1071                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$13)
    1072                            .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    1073                    $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    1074                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$13)
    1075                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1076                            .dwattr $C$DW$T$32, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
    1077                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x6a)
    1078                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x1c)
    1079                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    1080                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1081                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    1082                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    1083                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    1084                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1085                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1086                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    1087                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    1088                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1089                            .dwattr $C$DW$T$16, DW_AT_name("float")
    1090                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    1091                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    1092                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1093                            .dwattr $C$DW$T$17, DW_AT_name("double")
    1094                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    1095                    $C$DW$T$38      .dwtag  DW_TAG_volatile_type
    1096                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$17)
    1097                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    1098                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1099                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    1100                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:47 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   21

    1101                    
    1102                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1103                            .dwattr $C$DW$T$31, DW_AT_name("xLIST")
    1104                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x14)
    1105                    $C$DW$68        .dwtag  DW_TAG_member
    1106                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$25)
    1107                            .dwattr $C$DW$68, DW_AT_name("uxNumberOfItems")
    1108                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("uxNumberOfItems")
    1109                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1110                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1111                            .dwattr $C$DW$68, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
    1112                            .dwattr $C$DW$68, DW_AT_decl_line(0x88)
    1113                            .dwattr $C$DW$68, DW_AT_decl_column(0x22)
    1114                    $C$DW$69        .dwtag  DW_TAG_member
    1115                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$28)
    1116                            .dwattr $C$DW$69, DW_AT_name("pxIndex")
    1117                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("pxIndex")
    1118                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1119                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1120                            .dwattr $C$DW$69, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
    1121                            .dwattr $C$DW$69, DW_AT_decl_line(0x89)
    1122                            .dwattr $C$DW$69, DW_AT_decl_column(0x17)
    1123                    $C$DW$70        .dwtag  DW_TAG_member
    1124                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$30)
    1125                            .dwattr $C$DW$70, DW_AT_name("xListEnd")
    1126                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("xListEnd")
    1127                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1128                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1129                            .dwattr $C$DW$70, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
    1130                            .dwattr $C$DW$70, DW_AT_decl_line(0x8a)
    1131                            .dwattr $C$DW$70, DW_AT_decl_column(0x19)
    1132                            .dwendtag $C$DW$T$31
    1133                    
    1134                            .dwattr $C$DW$T$31, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
    1135                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x86)
    1136                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    1137                    $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    1138                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$31)
    1139                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1140                            .dwattr $C$DW$T$76, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
    1141                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x8b)
    1142                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x03)
    1143                    
    1144                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1145                            .dwattr $C$DW$T$35, DW_AT_name("xLIST_ITEM")
    1146                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x14)
    1147                    $C$DW$71        .dwtag  DW_TAG_member
    1148                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$32)
    1149                            .dwattr $C$DW$71, DW_AT_name("xItemValue")
    1150                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("xItemValue")
    1151                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1152                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1153                            .dwattr $C$DW$71, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
    1154                            .dwattr $C$DW$71, DW_AT_decl_line(0x73)
    1155                            .dwattr $C$DW$71, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:47 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   22

    1156                    $C$DW$72        .dwtag  DW_TAG_member
    1157                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$34)
    1158                            .dwattr $C$DW$72, DW_AT_name("pxNext")
    1159                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("pxNext")
    1160                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1161                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1162                            .dwattr $C$DW$72, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
    1163                            .dwattr $C$DW$72, DW_AT_decl_line(0x74)
    1164                            .dwattr $C$DW$72, DW_AT_decl_column(0x1f)
    1165                    $C$DW$73        .dwtag  DW_TAG_member
    1166                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$34)
    1167                            .dwattr $C$DW$73, DW_AT_name("pxPrevious")
    1168                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("pxPrevious")
    1169                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1170                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1171                            .dwattr $C$DW$73, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
    1172                            .dwattr $C$DW$73, DW_AT_decl_line(0x75)
    1173                            .dwattr $C$DW$73, DW_AT_decl_column(0x1f)
    1174                    $C$DW$74        .dwtag  DW_TAG_member
    1175                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$3)
    1176                            .dwattr $C$DW$74, DW_AT_name("pvOwner")
    1177                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("pvOwner")
    1178                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1179                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1180                            .dwattr $C$DW$74, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
    1181                            .dwattr $C$DW$74, DW_AT_decl_line(0x76)
    1182                            .dwattr $C$DW$74, DW_AT_decl_column(0x09)
    1183                    $C$DW$75        .dwtag  DW_TAG_member
    1184                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$3)
    1185                            .dwattr $C$DW$75, DW_AT_name("pvContainer")
    1186                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("pvContainer")
    1187                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1188                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1189                            .dwattr $C$DW$75, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
    1190                            .dwattr $C$DW$75, DW_AT_decl_line(0x77)
    1191                            .dwattr $C$DW$75, DW_AT_decl_column(0x09)
    1192                            .dwendtag $C$DW$T$35
    1193                    
    1194                            .dwattr $C$DW$T$35, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
    1195                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x71)
    1196                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x08)
    1197                    $C$DW$T$33      .dwtag  DW_TAG_volatile_type
    1198                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$35)
    1199                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    1200                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1201                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    1202                    $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    1203                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$35)
    1204                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    1205                            .dwattr $C$DW$T$26, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
    1206                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x79)
    1207                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x1b)
    1208                    $C$DW$T$27      .dwtag  DW_TAG_volatile_type
    1209                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1210                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:47 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   23

    1211                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    1212                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    1213                    
    1214                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1215                            .dwattr $C$DW$T$36, DW_AT_name("xMEMORY_REGION")
    1216                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x0c)
    1217                    $C$DW$76        .dwtag  DW_TAG_member
    1218                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$3)
    1219                            .dwattr $C$DW$76, DW_AT_name("pvBaseAddress")
    1220                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("pvBaseAddress")
    1221                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1222                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1223                            .dwattr $C$DW$76, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
    1224                            .dwattr $C$DW$76, DW_AT_decl_line(0x7a)
    1225                            .dwattr $C$DW$76, DW_AT_decl_column(0x08)
    1226                    $C$DW$77        .dwtag  DW_TAG_member
    1227                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$13)
    1228                            .dwattr $C$DW$77, DW_AT_name("ulLengthInBytes")
    1229                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("ulLengthInBytes")
    1230                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1231                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1232                            .dwattr $C$DW$77, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
    1233                            .dwattr $C$DW$77, DW_AT_decl_line(0x7b)
    1234                            .dwattr $C$DW$77, DW_AT_decl_column(0x10)
    1235                    $C$DW$78        .dwtag  DW_TAG_member
    1236                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$13)
    1237                            .dwattr $C$DW$78, DW_AT_name("ulParameters")
    1238                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("ulParameters")
    1239                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1240                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1241                            .dwattr $C$DW$78, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
    1242                            .dwattr $C$DW$78, DW_AT_decl_line(0x7c)
    1243                            .dwattr $C$DW$78, DW_AT_decl_column(0x10)
    1244                            .dwendtag $C$DW$T$36
    1245                    
    1246                            .dwattr $C$DW$T$36, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    1247                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x78)
    1248                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    1249                    $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    1250                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$36)
    1251                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1252                            .dwattr $C$DW$T$48, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    1253                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x7d)
    1254                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x03)
    1255                    
    1256                    $C$DW$T$49      .dwtag  DW_TAG_array_type
    1257                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    1258                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1259                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x0c)
    1260                    $C$DW$79        .dwtag  DW_TAG_subrange_type
    1261                            .dwattr $C$DW$79, DW_AT_upper_bound(0x00)
    1262                            .dwendtag $C$DW$T$49
    1263                    
    1264                    
    1265                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:47 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   24

    1266                            .dwattr $C$DW$T$37, DW_AT_name("xMINI_LIST_ITEM")
    1267                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x0c)
    1268                    $C$DW$80        .dwtag  DW_TAG_member
    1269                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$32)
    1270                            .dwattr $C$DW$80, DW_AT_name("xItemValue")
    1271                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("xItemValue")
    1272                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1273                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1274                            .dwattr $C$DW$80, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
    1275                            .dwattr $C$DW$80, DW_AT_decl_line(0x7d)
    1276                            .dwattr $C$DW$80, DW_AT_decl_column(0x0f)
    1277                    $C$DW$81        .dwtag  DW_TAG_member
    1278                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$34)
    1279                            .dwattr $C$DW$81, DW_AT_name("pxNext")
    1280                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("pxNext")
    1281                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1282                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1283                            .dwattr $C$DW$81, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
    1284                            .dwattr $C$DW$81, DW_AT_decl_line(0x7e)
    1285                            .dwattr $C$DW$81, DW_AT_decl_column(0x1e)
    1286                    $C$DW$82        .dwtag  DW_TAG_member
    1287                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$34)
    1288                            .dwattr $C$DW$82, DW_AT_name("pxPrevious")
    1289                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("pxPrevious")
    1290                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1291                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1292                            .dwattr $C$DW$82, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\include
    1293                            .dwattr $C$DW$82, DW_AT_decl_line(0x7f)
    1294                            .dwattr $C$DW$82, DW_AT_decl_column(0x1e)
    1295                            .dwendtag $C$DW$T$37
    1296                    
    1297                            .dwattr $C$DW$T$37, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
    1298                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x7b)
    1299                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x08)
    1300                    $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    1301                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$37)
    1302                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1303                            .dwattr $C$DW$T$29, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_Assembly\Source\inclu
    1304                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x81)
    1305                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x20)
    1306                    $C$DW$T$30      .dwtag  DW_TAG_volatile_type
    1307                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1308                    
    1309                    $C$DW$T$40      .dwtag  DW_TAG_union_type
    1310                            .dwattr $C$DW$T$40, DW_AT_name("xRTOS_HEAP")
    1311                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x2000)
    1312                    $C$DW$83        .dwtag  DW_TAG_member
    1313                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$38)
    1314                            .dwattr $C$DW$83, DW_AT_name("dDummy")
    1315                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("dDummy")
    1316                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1317                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1318                            .dwattr $C$DW$83, DW_AT_decl_file("../heap_2.c")
    1319                            .dwattr $C$DW$83, DW_AT_decl_line(0x3a)
    1320                            .dwattr $C$DW$83, DW_AT_decl_column(0x17)
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:47 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   25

    1321                    $C$DW$84        .dwtag  DW_TAG_member
    1322                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$39)
    1323                            .dwattr $C$DW$84, DW_AT_name("ucHeap")
    1324                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("ucHeap")
    1325                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1326                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1327                            .dwattr $C$DW$84, DW_AT_decl_file("../heap_2.c")
    1328                            .dwattr $C$DW$84, DW_AT_decl_line(0x3e)
    1329                            .dwattr $C$DW$84, DW_AT_decl_column(0x10)
    1330                            .dwendtag $C$DW$T$40
    1331                    
    1332                            .dwattr $C$DW$T$40, DW_AT_decl_file("../heap_2.c")
    1333                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x37)
    1334                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0e)
    1335                    
    1336                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1337                            .dwattr $C$DW$T$50, DW_AT_name("xTASK_PARAMTERS")
    1338                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x24)
    1339                    $C$DW$85        .dwtag  DW_TAG_member
    1340                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$43)
    1341                            .dwattr $C$DW$85, DW_AT_name("pvTaskCode")
    1342                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("pvTaskCode")
    1343                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1344                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1345                            .dwattr $C$DW$85, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
    1346                            .dwattr $C$DW$85, DW_AT_decl_line(0x84)
    1347                            .dwattr $C$DW$85, DW_AT_decl_column(0x0e)
    1348                    $C$DW$86        .dwtag  DW_TAG_member
    1349                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$46)
    1350                            .dwattr $C$DW$86, DW_AT_name("pcName")
    1351                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("pcName")
    1352                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1353                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1354                            .dwattr $C$DW$86, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
    1355                            .dwattr $C$DW$86, DW_AT_decl_line(0x85)
    1356                            .dwattr $C$DW$86, DW_AT_decl_column(0x1c)
    1357                    $C$DW$87        .dwtag  DW_TAG_member
    1358                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$9)
    1359                            .dwattr $C$DW$87, DW_AT_name("usStackDepth")
    1360                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("usStackDepth")
    1361                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1362                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1363                            .dwattr $C$DW$87, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
    1364                            .dwattr $C$DW$87, DW_AT_decl_line(0x86)
    1365                            .dwattr $C$DW$87, DW_AT_decl_column(0x11)
    1366                    $C$DW$88        .dwtag  DW_TAG_member
    1367                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$3)
    1368                            .dwattr $C$DW$88, DW_AT_name("pvParameters")
    1369                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("pvParameters")
    1370                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1371                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1372                            .dwattr $C$DW$88, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
    1373                            .dwattr $C$DW$88, DW_AT_decl_line(0x87)
    1374                            .dwattr $C$DW$88, DW_AT_decl_column(0x08)
    1375                    $C$DW$89        .dwtag  DW_TAG_member
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:47 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   26

    1376                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$13)
    1377                            .dwattr $C$DW$89, DW_AT_name("uxPriority")
    1378                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("uxPriority")
    1379                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1380                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1381                            .dwattr $C$DW$89, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
    1382                            .dwattr $C$DW$89, DW_AT_decl_line(0x88)
    1383                            .dwattr $C$DW$89, DW_AT_decl_column(0x19)
    1384                    $C$DW$90        .dwtag  DW_TAG_member
    1385                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$47)
    1386                            .dwattr $C$DW$90, DW_AT_name("puxStackBuffer")
    1387                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("puxStackBuffer")
    1388                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1389                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1390                            .dwattr $C$DW$90, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
    1391                            .dwattr $C$DW$90, DW_AT_decl_line(0x89)
    1392                            .dwattr $C$DW$90, DW_AT_decl_column(0x12)
    1393                    $C$DW$91        .dwtag  DW_TAG_member
    1394                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$49)
    1395                            .dwattr $C$DW$91, DW_AT_name("xRegions")
    1396                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("xRegions")
    1397                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1398                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1399                            .dwattr $C$DW$91, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
    1400                            .dwattr $C$DW$91, DW_AT_decl_line(0x8a)
    1401                            .dwattr $C$DW$91, DW_AT_decl_column(0x10)
    1402                            .dwendtag $C$DW$T$50
    1403                    
    1404                            .dwattr $C$DW$T$50, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    1405                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x82)
    1406                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    1407                    $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    1408                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$50)
    1409                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1410                            .dwattr $C$DW$T$77, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    1411                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x8b)
    1412                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x03)
    1413                    
    1414                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    1415                            .dwattr $C$DW$T$51, DW_AT_name("xTIME_OUT")
    1416                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x08)
    1417                    $C$DW$92        .dwtag  DW_TAG_member
    1418                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$12)
    1419                            .dwattr $C$DW$92, DW_AT_name("xOverflowCount")
    1420                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("xOverflowCount")
    1421                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1422                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1423                            .dwattr $C$DW$92, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
    1424                            .dwattr $C$DW$92, DW_AT_decl_line(0x71)
    1425                            .dwattr $C$DW$92, DW_AT_decl_column(0x10)
    1426                    $C$DW$93        .dwtag  DW_TAG_member
    1427                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$32)
    1428                            .dwattr $C$DW$93, DW_AT_name("xTimeOnEntering")
    1429                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("xTimeOnEntering")
    1430                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TI ARM Assembler PC v5.0.4 Mon Apr 21 10:17:47 2014

Tools Copyright (c) 1996-2013 Texas Instruments Incorporated
heap_2.asm                                                           PAGE   27

    1431                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1432                            .dwattr $C$DW$93, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/include
    1433                            .dwattr $C$DW$93, DW_AT_decl_line(0x72)
    1434                            .dwattr $C$DW$93, DW_AT_decl_column(0x10)
    1435                            .dwendtag $C$DW$T$51
    1436                    
    1437                            .dwattr $C$DW$T$51, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    1438                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x6f)
    1439                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
    1440                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    1441                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$51)
    1442                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1443                            .dwattr $C$DW$T$78, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_Assembly/Source/inclu
    1444                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x73)
    1445                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
    1446                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1447                    
    1448                    ;***************************************************************
    1449                    ;* DWARF CIE ENTRIES                                           *
    1450                    ;***************************************************************
    1451                    
    1452                    $C$DW$CIE       .dwcie 14
    1453                            .dwcfi  cfa_register, 13
    1454                            .dwcfi  cfa_offset, 0
    1455                            .dwcfi  undefined, 0
    1456                            .dwcfi  undefined, 1
    1457                            .dwcfi  undefined, 2
    1458                            .dwcfi  undefined, 3
    1459                            .dwcfi  same_value, 4
    1460                            .dwcfi  same_value, 5
    1461                            .dwcfi  same_value, 6
    1462                            .dwcfi  same_value, 7
    1463                            .dwcfi  same_value, 8
    1464                            .dwcfi  same_value, 9
    1465                            .dwcfi  same_value, 10
    1466                            .dwcfi  same_value, 11
    1467                            .dwcfi  undefined, 12
    1468                            .dwcfi  undefined, 13
    1469                            .dwcfi  undefined, 14
    1470                            .dwcfi  undefined, 14
    1471                            .dwcfi  undefined, 7
    1472                            .dwendentry
    1473                            .dwendtag $C$DW$CU
    1474                    

--------------------------
Thumb2 Statistics
--------------------------
Number of Thumb2 ins converted to Thumb = 0 (0%)
Number of Thumb ins in input = 188 (94%)
Number of Thumb2 ins encoded as Thumb2 = 11 (100%)
Number of Thumb2 ins converted to 2 OPND Thumb = 27


No Assembly Errors, No Assembly Warnings
