;******************************************************************************
;* TI ARM C/C++ Codegen                                             PC v5.0.4 *
;* Date/Time created: Mon Apr 07 10:00:27 2014                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=on --code_state=16 --disable_dual_state --embedded_constants=on --endian=little --float_support=vfplib --hll_source=on --object_format=elf --silicon_version=7M3 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../Source/queue.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.0.4 Copyright (c) 1996-2013 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Debug")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/string.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)
$C$DW$2	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$3)
$C$DW$3	.dwtag  DW_TAG_formal_parameter

$C$DW$281	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$281, DW_AT_low_pc(0x00)
	.dwattr $C$DW$281, DW_AT_TI_return
        BX        LR                    ; [DPU_3_PIPE] 
        ; BRANCH OCCURS                  ; [] 
	.dwattr $C$DW$277, DW_AT_TI_end_file("../Source/queue.c")
	.dwattr $C$DW$277, DW_AT_TI_end_line(0x5f6)
	.dwattr $C$DW$277, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$277

;*****************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                             *
;*****************************************************************************
	.global	vPortYieldFromISR
	.global	vPortEnterCritical
	.global	vPortExitCritical
	.global	ulPortSetInterruptMask
	.global	vPortClearInterruptMask
	.global	pvPortMalloc
	.global	vPortFree
	.global	vListInitialise
	.global	vTaskSuspendAll
	.global	xTaskResumeAll
	.global	vTaskPlaceOnEventList
	.global	xTaskRemoveFromEventList
	.global	vTaskSetTimeOutState
	.global	xTaskCheckForTimeOut
	.global	vTaskMissedYield
	.global	memcpy

;******************************************************************************
;* BUILD ATTRIBUTES                                                           *
;******************************************************************************
	.battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
	.battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(5)
	.battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
	.battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
	.battr "TI", Tag_File, 1, Tag_FP_interface(1)

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$50	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
$C$DW$282	.dwtag  DW_TAG_enumerator, DW_AT_name("eRunning"), DW_AT_const_value(0x00)
	.dwattr $C$DW$282, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$282, DW_AT_decl_line(0x90)
	.dwattr $C$DW$282, DW_AT_decl_column(0x02)
$C$DW$283	.dwtag  DW_TAG_enumerator, DW_AT_name("eReady"), DW_AT_const_value(0x01)
	.dwattr $C$DW$283, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$283, DW_AT_decl_line(0x91)
	.dwattr $C$DW$283, DW_AT_decl_column(0x02)
$C$DW$284	.dwtag  DW_TAG_enumerator, DW_AT_name("eBlocked"), DW_AT_const_value(0x02)
	.dwattr $C$DW$284, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$284, DW_AT_decl_line(0x92)
	.dwattr $C$DW$284, DW_AT_decl_column(0x02)
$C$DW$285	.dwtag  DW_TAG_enumerator, DW_AT_name("eSuspended"), DW_AT_const_value(0x03)
	.dwattr $C$DW$285, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$285, DW_AT_decl_line(0x93)
	.dwattr $C$DW$285, DW_AT_decl_column(0x02)
$C$DW$286	.dwtag  DW_TAG_enumerator, DW_AT_name("eDeleted"), DW_AT_const_value(0x04)
	.dwattr $C$DW$286, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$286, DW_AT_decl_line(0x94)
	.dwattr $C$DW$286, DW_AT_decl_column(0x02)
	.dwendtag $C$DW$T$50

	.dwattr $C$DW$T$50, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$T$50, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
$C$DW$T$51	.dwtag  DW_TAG_typedef, DW_AT_name("eTaskState")
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$51, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0x95)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x03)

$C$DW$T$52	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
$C$DW$287	.dwtag  DW_TAG_enumerator, DW_AT_name("eAbortSleep"), DW_AT_const_value(0x00)
	.dwattr $C$DW$287, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$287, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$287, DW_AT_decl_column(0x02)
$C$DW$288	.dwtag  DW_TAG_enumerator, DW_AT_name("eStandardSleep"), DW_AT_const_value(0x01)
	.dwattr $C$DW$288, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$288, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$288, DW_AT_decl_column(0x02)
$C$DW$289	.dwtag  DW_TAG_enumerator, DW_AT_name("eNoTasksWaitingTimeout"), DW_AT_const_value(0x02)
	.dwattr $C$DW$289, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$289, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$289, DW_AT_decl_column(0x02)
	.dwendtag $C$DW$T$52

	.dwattr $C$DW$T$52, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0x99)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
$C$DW$T$53	.dwtag  DW_TAG_typedef, DW_AT_name("eSleepModeStatus")
	.dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$53, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x03)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_byte_size(0x08)
$C$DW$290	.dwtag  DW_TAG_member
	.dwattr $C$DW$290, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$290, DW_AT_name("quot")
	.dwattr $C$DW$290, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$290, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/stdlib.h")
	.dwattr $C$DW$290, DW_AT_decl_line(0x50)
	.dwattr $C$DW$290, DW_AT_decl_column(0x16)
$C$DW$291	.dwtag  DW_TAG_member
	.dwattr $C$DW$291, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$291, DW_AT_name("rem")
	.dwattr $C$DW$291, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$291, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/stdlib.h")
	.dwattr $C$DW$291, DW_AT_decl_line(0x50)
	.dwattr $C$DW$291, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/stdlib.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0x50)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$54	.dwtag  DW_TAG_typedef, DW_AT_name("div_t")
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$54, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/stdlib.h")
	.dwattr $C$DW$T$54, DW_AT_decl_line(0x50)
	.dwattr $C$DW$T$54, DW_AT_decl_column(0x23)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
$C$DW$292	.dwtag  DW_TAG_member
	.dwattr $C$DW$292, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$292, DW_AT_name("quot")
	.dwattr $C$DW$292, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$292, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/stdlib.h")
	.dwattr $C$DW$292, DW_AT_decl_line(0x52)
	.dwattr $C$DW$292, DW_AT_decl_column(0x16)
$C$DW$293	.dwtag  DW_TAG_member
	.dwattr $C$DW$293, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$293, DW_AT_name("rem")
	.dwattr $C$DW$293, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$293, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/stdlib.h")
	.dwattr $C$DW$293, DW_AT_decl_line(0x52)
	.dwattr $C$DW$293, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/stdlib.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0x52)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
$C$DW$T$55	.dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
	.dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$55, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/stdlib.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x52)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x23)

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
$C$DW$294	.dwtag  DW_TAG_member
	.dwattr $C$DW$294, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$294, DW_AT_name("quot")
	.dwattr $C$DW$294, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$294, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/stdlib.h")
	.dwattr $C$DW$294, DW_AT_decl_line(0x55)
	.dwattr $C$DW$294, DW_AT_decl_column(0x1c)
$C$DW$295	.dwtag  DW_TAG_member
	.dwattr $C$DW$295, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$295, DW_AT_name("rem")
	.dwattr $C$DW$295, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$295, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/stdlib.h")
	.dwattr $C$DW$295, DW_AT_decl_line(0x55)
	.dwattr $C$DW$295, DW_AT_decl_column(0x22)
	.dwendtag $C$DW$T$21

	.dwattr $C$DW$T$21, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/stdlib.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x55)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
$C$DW$T$56	.dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
	.dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$56, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/stdlib.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0x55)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x29)

$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_name("QueueDefinition")
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x4c)
$C$DW$296	.dwtag  DW_TAG_member
	.dwattr $C$DW$296, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$296, DW_AT_name("pcHead")
	.dwattr $C$DW$296, DW_AT_TI_symbol_name("pcHead")
	.dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$296, DW_AT_decl_file("../Source/queue.c")
	.dwattr $C$DW$296, DW_AT_decl_line(0x76)
	.dwattr $C$DW$296, DW_AT_decl_column(0x0f)
$C$DW$297	.dwtag  DW_TAG_member
	.dwattr $C$DW$297, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$297, DW_AT_name("pcTail")
	.dwattr $C$DW$297, DW_AT_TI_symbol_name("pcTail")
	.dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$297, DW_AT_decl_file("../Source/queue.c")
	.dwattr $C$DW$297, DW_AT_decl_line(0x77)
	.dwattr $C$DW$297, DW_AT_decl_column(0x0f)
$C$DW$298	.dwtag  DW_TAG_member
	.dwattr $C$DW$298, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$298, DW_AT_name("pcWriteTo")
	.dwattr $C$DW$298, DW_AT_TI_symbol_name("pcWriteTo")
	.dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$298, DW_AT_decl_file("../Source/queue.c")
	.dwattr $C$DW$298, DW_AT_decl_line(0x79)
	.dwattr $C$DW$298, DW_AT_decl_column(0x0f)
$C$DW$299	.dwtag  DW_TAG_member
	.dwattr $C$DW$299, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$299, DW_AT_name("pcReadFrom")
	.dwattr $C$DW$299, DW_AT_TI_symbol_name("pcReadFrom")
	.dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$299, DW_AT_decl_file("../Source/queue.c")
	.dwattr $C$DW$299, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$299, DW_AT_decl_column(0x0f)
$C$DW$300	.dwtag  DW_TAG_member
	.dwattr $C$DW$300, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$300, DW_AT_name("xTasksWaitingToSend")
	.dwattr $C$DW$300, DW_AT_TI_symbol_name("xTasksWaitingToSend")
	.dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$300, DW_AT_decl_file("../Source/queue.c")
	.dwattr $C$DW$300, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$300, DW_AT_decl_column(0x08)
$C$DW$301	.dwtag  DW_TAG_member
	.dwattr $C$DW$301, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$301, DW_AT_name("xTasksWaitingToReceive")
	.dwattr $C$DW$301, DW_AT_TI_symbol_name("xTasksWaitingToReceive")
	.dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$301, DW_AT_decl_file("../Source/queue.c")
	.dwattr $C$DW$301, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$301, DW_AT_decl_column(0x08)
$C$DW$302	.dwtag  DW_TAG_member
	.dwattr $C$DW$302, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$302, DW_AT_name("uxMessagesWaiting")
	.dwattr $C$DW$302, DW_AT_TI_symbol_name("uxMessagesWaiting")
	.dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$302, DW_AT_decl_file("../Source/queue.c")
	.dwattr $C$DW$302, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$302, DW_AT_decl_column(0x22)
$C$DW$303	.dwtag  DW_TAG_member
	.dwattr $C$DW$303, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$303, DW_AT_name("uxLength")
	.dwattr $C$DW$303, DW_AT_TI_symbol_name("uxLength")
	.dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$303, DW_AT_decl_file("../Source/queue.c")
	.dwattr $C$DW$303, DW_AT_decl_line(0x80)
	.dwattr $C$DW$303, DW_AT_decl_column(0x19)
$C$DW$304	.dwtag  DW_TAG_member
	.dwattr $C$DW$304, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$304, DW_AT_name("uxItemSize")
	.dwattr $C$DW$304, DW_AT_TI_symbol_name("uxItemSize")
	.dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$304, DW_AT_decl_file("../Source/queue.c")
	.dwattr $C$DW$304, DW_AT_decl_line(0x81)
	.dwattr $C$DW$304, DW_AT_decl_column(0x19)
$C$DW$305	.dwtag  DW_TAG_member
	.dwattr $C$DW$305, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$305, DW_AT_name("xRxLock")
	.dwattr $C$DW$305, DW_AT_TI_symbol_name("xRxLock")
	.dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$305, DW_AT_decl_file("../Source/queue.c")
	.dwattr $C$DW$305, DW_AT_decl_line(0x83)
	.dwattr $C$DW$305, DW_AT_decl_column(0x20)
$C$DW$306	.dwtag  DW_TAG_member
	.dwattr $C$DW$306, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$306, DW_AT_name("xTxLock")
	.dwattr $C$DW$306, DW_AT_TI_symbol_name("xTxLock")
	.dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$306, DW_AT_decl_file("../Source/queue.c")
	.dwattr $C$DW$306, DW_AT_decl_line(0x84)
	.dwattr $C$DW$306, DW_AT_decl_column(0x20)
	.dwendtag $C$DW$T$26

	.dwattr $C$DW$T$26, DW_AT_decl_file("../Source/queue.c")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x74)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
$C$DW$T$57	.dwtag  DW_TAG_typedef, DW_AT_name("xQUEUE")
	.dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$57, DW_AT_decl_file("../Source/queue.c")
	.dwattr $C$DW$T$57, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$57, DW_AT_decl_column(0x03)
$C$DW$T$58	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$T$58, DW_AT_address_class(0x20)
$C$DW$T$59	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
$C$DW$T$60	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$57)
$C$DW$T$61	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$61, DW_AT_address_class(0x20)
$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")
$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
	.dwattr $C$DW$T$3, DW_AT_address_class(0x20)
$C$DW$T$68	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$3)
$C$DW$T$69	.dwtag  DW_TAG_typedef, DW_AT_name("xQueueHandle")
	.dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$69, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/queue.h")
	.dwattr $C$DW$T$69, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$T$69, DW_AT_decl_column(0x10)
$C$DW$T$71	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$69)
$C$DW$T$72	.dwtag  DW_TAG_typedef, DW_AT_name("xQueueSetHandle")
	.dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$72, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/queue.h")
	.dwattr $C$DW$T$72, DW_AT_decl_line(0x66)
	.dwattr $C$DW$T$72, DW_AT_decl_column(0x10)
$C$DW$T$73	.dwtag  DW_TAG_typedef, DW_AT_name("xQueueSetMemberHandle")
	.dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$73, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/queue.h")
	.dwattr $C$DW$T$73, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$T$73, DW_AT_decl_column(0x10)
$C$DW$T$74	.dwtag  DW_TAG_typedef, DW_AT_name("xTaskHandle")
	.dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$74, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$T$74, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$T$74, DW_AT_decl_column(0x10)

$C$DW$T$39	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
$C$DW$307	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$3)
	.dwendtag $C$DW$T$39

$C$DW$T$40	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$40, DW_AT_address_class(0x20)
$C$DW$T$41	.dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_CODE")
	.dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$41, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\include\projdefs.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
$C$DW$T$62	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$2)
$C$DW$T$63	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$63, DW_AT_address_class(0x20)
$C$DW$T$75	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$63)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$22	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$5)
	.dwattr $C$DW$T$22, DW_AT_address_class(0x20)
$C$DW$T$42	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$5)
$C$DW$T$43	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$43, DW_AT_address_class(0x20)
$C$DW$T$44	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
$C$DW$T$100	.dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$100, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/stdlib.h")
	.dwattr $C$DW$T$100, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$T$100, DW_AT_decl_column(0x1a)
$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
$C$DW$T$101	.dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
	.dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$101, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/stddef.h")
	.dwattr $C$DW$T$101, DW_AT_decl_line(0x31)
	.dwattr $C$DW$T$101, DW_AT_decl_column(0x1c)
$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
$C$DW$T$64	.dwtag  DW_TAG_typedef, DW_AT_name("size_t")
	.dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$64, DW_AT_decl_file("C:/TI_CodeComposer/ccsv5/tools/compiler/arm_5.0.4/include/stdlib.h")
	.dwattr $C$DW$T$64, DW_AT_decl_line(0x64)
	.dwattr $C$DW$T$64, DW_AT_decl_column(0x19)
$C$DW$T$12	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_name("long")
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
$C$DW$T$25	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$12)
$C$DW$T$113	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$113, DW_AT_address_class(0x20)

$C$DW$T$120	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
$C$DW$308	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$3)
	.dwendtag $C$DW$T$120

$C$DW$T$121	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
	.dwattr $C$DW$T$121, DW_AT_address_class(0x20)
$C$DW$T$122	.dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_HOOK_CODE")
	.dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
	.dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$122, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/FreeRTOS.h")
	.dwattr $C$DW$T$122, DW_AT_decl_line(0x66)
	.dwattr $C$DW$T$122, DW_AT_decl_column(0x19)
$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
$C$DW$T$24	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$13)
$C$DW$T$45	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$45, DW_AT_address_class(0x20)
$C$DW$T$33	.dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$33, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\include\../../Source/portable/CCS5/ARM_CM3/portmacro.h")
	.dwattr $C$DW$T$33, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$T$33, DW_AT_decl_column(0x1c)
$C$DW$T$106	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$106, DW_AT_address_class(0x20)
$C$DW$T$107	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x08)

$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_name("xLIST")
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x14)
$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$309, DW_AT_name("uxNumberOfItems")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("uxNumberOfItems")
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$309, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\include\list.h")
	.dwattr $C$DW$309, DW_AT_decl_line(0x88)
	.dwattr $C$DW$309, DW_AT_decl_column(0x22)
$C$DW$310	.dwtag  DW_TAG_member
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$310, DW_AT_name("pxIndex")
	.dwattr $C$DW$310, DW_AT_TI_symbol_name("pxIndex")
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$310, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\include\list.h")
	.dwattr $C$DW$310, DW_AT_decl_line(0x89)
	.dwattr $C$DW$310, DW_AT_decl_column(0x17)
$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$311, DW_AT_name("xListEnd")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("xListEnd")
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$311, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\include\list.h")
	.dwattr $C$DW$311, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$311, DW_AT_decl_column(0x19)
	.dwendtag $C$DW$T$32

	.dwattr $C$DW$T$32, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\include\list.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
$C$DW$T$23	.dwtag  DW_TAG_typedef, DW_AT_name("xList")
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$23, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\include\list.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x03)
$C$DW$T$80	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$80, DW_AT_address_class(0x20)
$C$DW$T$83	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$23)
$C$DW$T$84	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$T$84, DW_AT_address_class(0x20)
$C$DW$T$85	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)

$C$DW$T$36	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$36, DW_AT_name("xLIST_ITEM")
	.dwattr $C$DW$T$36, DW_AT_byte_size(0x14)
$C$DW$312	.dwtag  DW_TAG_member
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$312, DW_AT_name("xItemValue")
	.dwattr $C$DW$312, DW_AT_TI_symbol_name("xItemValue")
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$312, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\include\list.h")
	.dwattr $C$DW$312, DW_AT_decl_line(0x73)
	.dwattr $C$DW$312, DW_AT_decl_column(0x0f)
$C$DW$313	.dwtag  DW_TAG_member
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$313, DW_AT_name("pxNext")
	.dwattr $C$DW$313, DW_AT_TI_symbol_name("pxNext")
	.dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$313, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\include\list.h")
	.dwattr $C$DW$313, DW_AT_decl_line(0x74)
	.dwattr $C$DW$313, DW_AT_decl_column(0x1f)
$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$314, DW_AT_name("pxPrevious")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("pxPrevious")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$314, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\include\list.h")
	.dwattr $C$DW$314, DW_AT_decl_line(0x75)
	.dwattr $C$DW$314, DW_AT_decl_column(0x1f)
$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$315, DW_AT_name("pvOwner")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("pvOwner")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$315, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\include\list.h")
	.dwattr $C$DW$315, DW_AT_decl_line(0x76)
	.dwattr $C$DW$315, DW_AT_decl_column(0x09)
$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$316, DW_AT_name("pvContainer")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("pvContainer")
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$316, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\include\list.h")
	.dwattr $C$DW$316, DW_AT_decl_line(0x77)
	.dwattr $C$DW$316, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$36

	.dwattr $C$DW$T$36, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\include\list.h")
	.dwattr $C$DW$T$36, DW_AT_decl_line(0x71)
	.dwattr $C$DW$T$36, DW_AT_decl_column(0x08)
$C$DW$T$34	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$36)
$C$DW$T$35	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$35, DW_AT_address_class(0x20)
$C$DW$T$27	.dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$27, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\include\list.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x79)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x1b)
$C$DW$T$28	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
$C$DW$T$29	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$29, DW_AT_address_class(0x20)

$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_name("xMEMORY_REGION")
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x0c)
$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$317, DW_AT_name("pvBaseAddress")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("pvBaseAddress")
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$317, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$317, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$317, DW_AT_decl_column(0x08)
$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$318, DW_AT_name("ulLengthInBytes")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("ulLengthInBytes")
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$318, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$318, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$318, DW_AT_decl_column(0x10)
$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$319, DW_AT_name("ulParameters")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("ulParameters")
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$319, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$319, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$319, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$37

	.dwattr $C$DW$T$37, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$T$37, DW_AT_decl_line(0x78)
	.dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
$C$DW$T$46	.dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
	.dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$46, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x03)

$C$DW$T$47	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x0c)
$C$DW$320	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$320, DW_AT_upper_bound(0x00)
	.dwendtag $C$DW$T$47


$C$DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$38, DW_AT_name("xMINI_LIST_ITEM")
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x0c)
$C$DW$321	.dwtag  DW_TAG_member
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$321, DW_AT_name("xItemValue")
	.dwattr $C$DW$321, DW_AT_TI_symbol_name("xItemValue")
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$321, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\include\list.h")
	.dwattr $C$DW$321, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$321, DW_AT_decl_column(0x0f)
$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$322, DW_AT_name("pxNext")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("pxNext")
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$322, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\include\list.h")
	.dwattr $C$DW$322, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$322, DW_AT_decl_column(0x1e)
$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$323, DW_AT_name("pxPrevious")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("pxPrevious")
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$323, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\include\list.h")
	.dwattr $C$DW$323, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$323, DW_AT_decl_column(0x1e)
	.dwendtag $C$DW$T$38

	.dwattr $C$DW$T$38, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\include\list.h")
	.dwattr $C$DW$T$38, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$T$38, DW_AT_decl_column(0x08)
$C$DW$T$30	.dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$30, DW_AT_decl_file("H:\EECS_388\TI_ARM_Project\FreeRTOS_LM3S1968\Source\include\list.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x81)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x20)
$C$DW$T$31	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)

$C$DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$48, DW_AT_name("xTASK_PARAMTERS")
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x24)
$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$324, DW_AT_name("pvTaskCode")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("pvTaskCode")
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$324, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$324, DW_AT_decl_line(0x84)
	.dwattr $C$DW$324, DW_AT_decl_column(0x0e)
$C$DW$325	.dwtag  DW_TAG_member
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$325, DW_AT_name("pcName")
	.dwattr $C$DW$325, DW_AT_TI_symbol_name("pcName")
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$325, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$325, DW_AT_decl_line(0x85)
	.dwattr $C$DW$325, DW_AT_decl_column(0x1c)
$C$DW$326	.dwtag  DW_TAG_member
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$326, DW_AT_name("usStackDepth")
	.dwattr $C$DW$326, DW_AT_TI_symbol_name("usStackDepth")
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$326, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$326, DW_AT_decl_line(0x86)
	.dwattr $C$DW$326, DW_AT_decl_column(0x11)
$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$327, DW_AT_name("pvParameters")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("pvParameters")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$327, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$327, DW_AT_decl_line(0x87)
	.dwattr $C$DW$327, DW_AT_decl_column(0x08)
$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$328, DW_AT_name("uxPriority")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("uxPriority")
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$328, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$328, DW_AT_decl_line(0x88)
	.dwattr $C$DW$328, DW_AT_decl_column(0x19)
$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$329, DW_AT_name("puxStackBuffer")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("puxStackBuffer")
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$329, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$329, DW_AT_decl_line(0x89)
	.dwattr $C$DW$329, DW_AT_decl_column(0x12)
$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$330, DW_AT_name("xRegions")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("xRegions")
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$330, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$330, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$330, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$48

	.dwattr $C$DW$T$48, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$T$48, DW_AT_decl_line(0x82)
	.dwattr $C$DW$T$48, DW_AT_decl_column(0x10)
$C$DW$T$128	.dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
	.dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$128, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$T$128, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$T$128, DW_AT_decl_column(0x03)

$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_name("xTIME_OUT")
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x08)
$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$331, DW_AT_name("xOverflowCount")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("xOverflowCount")
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$331, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$331, DW_AT_decl_line(0x71)
	.dwattr $C$DW$331, DW_AT_decl_column(0x10)
$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$332, DW_AT_name("xTimeOnEntering")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("xTimeOnEntering")
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$332, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$332, DW_AT_decl_line(0x72)
	.dwattr $C$DW$332, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$49

	.dwattr $C$DW$T$49, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$T$49, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$T$49, DW_AT_decl_column(0x10)
$C$DW$T$88	.dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
	.dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$88, DW_AT_decl_file("H:/EECS_388/TI_ARM_Project/FreeRTOS_LM3S1968/Source/include/task.h")
	.dwattr $C$DW$T$88, DW_AT_decl_line(0x73)
	.dwattr $C$DW$T$88, DW_AT_decl_column(0x03)
$C$DW$T$89	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$T$89, DW_AT_address_class(0x20)
$C$DW$T$90	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

$C$DW$CIE	.dwcie 14
	.dwcfi	cfa_register, 13
	.dwcfi	cfa_offset, 0
	.dwcfi	undefined, 0
	.dwcfi	undefined, 1
	.dwcfi	undefined, 2
	.dwcfi	undefined, 3
	.dwcfi	same_value, 4
	.dwcfi	same_value, 5
	.dwcfi	same_value, 6
	.dwcfi	same_value, 7
	.dwcfi	same_value, 8
	.dwcfi	same_value, 9
	.dwcfi	same_value, 10
	.dwcfi	same_value, 11
	.dwcfi	undefined, 12
	.dwcfi	undefined, 13
	.dwcfi	undefined, 14
	.dwcfi	undefined, 14
	.dwcfi	undefined, 7
	.dwendentry
	.dwendtag $C$DW$CU

